{
  "versions": [
    {
      "tag": "v4.4.0+231114 (Patch)",
      "date": "11/14/2023",
      "items": [
        {
          "tag": "update",
          "description": "Improved error message when driver version is incorrect"
        },
        {
          "tag": "fixed",
          "description": "CryoSPARC Live session worker jobs no longer fail during particle picking on sessions created prior to v4.4"
        },
        {
          "tag": "fixed",
          "description": "CryoSPARC Live sessions created prior to v4.4 no longer fail during pausing and exporting particles"
        },
        {
          "tag": "fixed",
          "description": "Class Probability Filter job no longer fails when particle blobs are not available"
        },
        {
          "tag": "fixed",
          "description": "Benchmark job correctly runs with more than one GPU"
        },
        {
          "tag": "fixed",
          "description": "Benchmark job no longer fails if benchmark data is outside the project directory"
        },
        {
          "tag": "fixed",
          "description": "Small Particle parameter definition in default blueprint is now correct"
        }
      ]
    },
    {
      "tag": "v4.4.0",
      "date": "11/08/2023",
      "items": [
        {
          "tag": "new",
          "description": "<p><a href=\"https://guide.cryosparc.com/setup-configuration-and-management/cryosparc-installation-prerequisites#1.-cuda-toolkit\">CryoSPARC now bundles CUDA Toolkit 11.8</a>; a separate CUDA Toolkit installation no is longer required by the CryoSPARC worker application.<br /><strong>BREAKING</strong>: CryoSPARC v4.4 requires NVIDIA driver version 520.61.05 or newer.</p>"
        },
        {
          "tag": "new",
          "description": "<p><strong>Introducing <a href=\"https://guide.cryosparc.com/application-guide-v4.0+/workflows\">Workflows</a> and <a href=\"https://guide.cryosparc.com/application-guide-v4.0+/blueprints\">Blueprints</a>:</strong></p> <ul> <li>→ <strong><a href=\"https://guide.cryosparc.com/application-guide-v4.0+/workflows\">Workflows</a></strong>: Workflows make it easy to replicate processing that you’ve done before. Select a chain of jobs to create a templated processing Workflow, and re-create it in any project or workspace with a single click. Annotate the Workflow with a description and tags, set up default or locked parameter choices, and easily share Workflows from one CryoSPARC instance to another.</li> <li>→ Workflows are flexible. You can create a linear Workflow that for example, starts with an import job and proceeds all the way to a refinement, to make it easier to process a new dataset using an existing set of steps. Alternatively, you can select a portion of a processing workflow that you would like to re-use for exploratory processing (e.g., for sorting particles or separating heterogeneity).</li> <li>→ Use Workflows to save time, to maintain consistency and repeatability, and to capture important target-specific or facility-specific processing details and patterns so that new users can get a head start.</li> <li>→ <a href=\"https://guide.cryosparc.com/application-guide-v4.0+/workflows\">Watch a tutorial video and read the in-depth Workflows guide to get started.</a></li> <li>→ <a href=\"https://guide.cryosparc.com/application-guide-v4.0+/blueprints\">Blueprints</a></strong>: Blueprints allow you to define custom parameters and annotations as a template for any job type. Apply the Blueprint to an existing job or create a new job from a Blueprint directly from the job builder, in any workspace or project.</li> <li>→ Save time and avoid mistakes in entering parameter values by creating Blueprints for e.g., import jobs for specific microscope setups, classification and refinement jobs for specific protein types or sizes, settings for specific computational configurations, etc.</li> <li>→ Create Blueprints to avoid searching across projects for the parameters of previous runs of a particular job type. Easily export, share, and import Blueprints from one CryoSPARC instance to another.</li> <li>→ <a href=\"https://guide.cryosparc.com/application-guide-v4.0+/blueprints\">Read the in-depth Blueprints guide to get started.</a></li></ul>"
        },
        {
          "tag": "new",
          "description": "<p><strong><a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/motion-correction/job-reference-based-motion-correction-beta\">Reference Based Motion Correction (BETA)</a></strong> in CryoSPARC improves final resolution and map quality by re-estimating per-particle motion trajectories using a reference volume, similar to Bayesian Polishing (Zivanov et al, 2019).</p> <ul> <li>→ Before running Reference Based Motion Correction, you must run Patch Motion on your input movies and take the extracted particles through a 3D refinement.</li> <li>→ The reference density and particle poses from 3D refinement are used to go back to the input movies and re-extract particles with optimized motion trajectories. Reference Based Motion Correction is multi-GPU accelerated and optimized, and includes a <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/motion-correction/job-reference-based-motion-correction-beta#hyperparameter-search\">new method for hyperparameter optimization</a>.</li> <li>→ The job also computes optimal empirical dose weights by comparing aligned particles against the reference density, and uses these to weight contribution from early and late frames of the input movies. This dose weighting is often <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/motion-correction/job-reference-based-motion-correction-beta#sample-results\">responsible for a large part of the improvement from Reference Based Motion Correction</a>. In CryoSPARC v4.4, Patch Motion correction can now accept empirical dose weights as input, e.g. from previous processing of a similar dataset, so that empirical dose weights can be applied right from the start of the processing pipeline.</li> <li>→ <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/motion-correction/job-reference-based-motion-correction-beta#empiar-10261-nav1.7-ion-channel\">Reference Based Motion Correction can also perform motion estimation of particles from multiple heterogeneous classes simultaneously</a>, and uses particles from all classes in each micrograph to constrain motion trajectories, potentially leading to improved results over processing each class separately.</li> <li>→ <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/motion-correction/job-reference-based-motion-correction-beta#tutorial-video\">Watch a detailed tutorial video</a> to learn how to use the job, and <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/motion-correction/job-reference-based-motion-correction-beta\">read the job documentation for theory and more details about the method</a>.</li></ul>"
        },
        {
          "tag": "new",
          "description": "<p><strong><a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-orientation-diagnostics\">Orientation Diagnostics</a>,</strong> a job that rapidly computes a set of easily interpretable diagnostics to identify orientation bias and anisotropic signal content in 3D refinement results. Quickly identify potential data collection, sample preparation, or particle picking/curation issues with two complementary statistics: <strong>Conical FSC Area Ratio (cFAR)</strong>, sensitive to anisotropy in signal content and alignments and <strong>Sampling Compensation Factor</strong> <strong>(SCF*)</strong>, sensitive to anisotropy in alignments (Baldwin and Lyumkis, 2020).</p> <ul> <li>→ <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-orientation-diagnostics\">Several new diagnostic plots</a> allow for in-depth analysis of directional variation in FSCs and particle scale factors. The generated diagnostics include the values and plots previously produced by the 3DFSC wrapper job, which is now a legacy job.</li> <li>→ <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-orientation-diagnostics\">Read a tutorial</a> on how to use the job, and read the <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-orientation-diagnostics\">job documentation for theory and more details about the method</a>.</li></ul>"
        },
        {
          "tag": "new",
          "description": "<strong><a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/3d-refinement/job-non-uniform-refinement-new\">Non-Uniform Refinement</a> is up to 2x faster:</strong> the core computation for non-uniform cross-validation regularization is optimized on GPU to be 7x-10x faster. This translates to approximately 2x faster overall run time for Non-Uniform refinement jobs, and Helical and Local Refinement jobs with non-uniform regularization enabled."
        },
        {
          "tag": "new",
          "description": "<p><strong><a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-3d-flexible-refinement#job-types\">3D Flex Reconstruction</a></strong> job now supports CTF aberrations during high-resolution reconstruction. Also, there is now an option to read particles from SSD cache or from project directories during reconstruction, rather than loading all particles into RAM. This option substantially decreases the CPU RAM requirements for reconstruction.</p><ul><li>→ In addition, 3D Flex dependencies are now bundled with CryoSPARC and no longer require a separate online installation step. 3D Flex now supports the latest NVIDIA GPU compute capabilities 8.9 and 9.0.</li></ul>"
        },
        {
          "tag": "new",
          "description": "<p><strong><a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-symmetry-relaxation\">Symmetry Relaxation:</a></strong> There is now an option to relax the pose search over symmetry-related views in Homogeneous and Non-Uniform Refinement.</p><ul><li>→ A “break symmetry” option is available in Homogeneous Reconstruction that randomizes particle poses over the chosen symmetry group.</li></ul>"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-float16-support\"><code>float16</code> Support:</a> Particles and motion-corrected micrographs can now be output in 16-bit floating point format, via a new parameter in motion correction and extraction jobs. This can cut disk usage in half for large projects. The option to output <code>float16</code> can also be set as a project-level default parameter."
        },
        {
          "tag": "new",
          "description": "<p><strong><a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-epu-afis-beam-shift-import\">AFIS Beam Shift Import:</a></strong> In Import Movies and Import Micrographs, beam shift values for data collected in EPU via the Aberration-Free Image Shift (AFIS) method can now be directly imported, and exposure groups created based on clusters of beam shift values.</p> <ul> <li>→ For existing exposure datasets in CryoSPARC, add beam shift information using the new <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/import/job-import-beam-shift\">Import Beam Shift</a> job. In the Exposure Group Utilities job, cluster exposures into exposure groups based on imported beam shift values automatically.</li></ul>"
        },
        {
          "tag": "new",
          "description": "<strong><a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/variability/job-regroup-3d\">Regroup 3D</a></strong> job quickly creates a set of ‘superclasses’ from a larger set of upstream 3D Classification or Heterogeneous Refinement classes. It uses a lightweight spectral clustering algorithm that can aid in identifying dominant conformational variations."
        },
        {
          "tag": "new",
          "description": "<strong><a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/3d-refinement/job-heterogeneous-reconstruction-only\">Heterogeneous Reconstruction Only</a></strong> job reconstructs multiple classes from upstream 3D Classification, Heterogeneous Refinement, or Regroup 3D outputs. It uses weighted back-projection via upstream class posteriors, with an option to apply hard classification. It includes similar reconstruction options as the Homogeneous Reconstruct Only job (including symmetry, box size, etc.)."
        },
        {
          "tag": "new",
          "description": "Viewing direction distribution plots now include an option to <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-bild-files-in-cryosparc-v4.4+\">export as a BILD file for visualization in UCSF Chimera(X)</a>."
        },
        {
          "tag": "new",
          "description": "Experimental SSD cache system with significantly improved reliability and support for network drives. To enable, add <code>export CRYOSPARC_IMPROVED_SSD_CACHE=true</code> to <code>cryosparc_worker/config.sh</code>. <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/environment-variables#cryosparc_worker-config.sh\">See the guide for more details.</a>"
        },
        {
          "tag": "new",
          "description": "<p>Improved behaviour of the <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-cleanup-v4.3+\"><strong>Data Cleanup Tool</strong></a> to streamline compaction of projects and workspaces:</p> <ul> <li>→ All options are unchecked by default.</li> <li>→ When running the Cleanup Data tool on a single workspace within a project, jobs that are linked to other workspaces will no longer be deleted by the tool; instead those jobs will be unlinked from the workspace being cleaned and will remain present in the other workspaces.</li> <li>→ CryoSPARC Live jobs, which are excluded from the cleanup process, are marked as “Skipped” and their size is now displayed.</li> <li>→ The total project directory size is now displayed in the cleanup tool along with the total size of data that the tool can clear, which may be different due to imported and manually copied files that may be present in the project directory.</li></ul>"
        },
        {
          "tag": "new",
          "description": "<strong><a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-curation/job-2d-classification\">2D Classification</a></strong> implementation that reduces memory usage and provides speedups with larger datasets. The original implementation is available as a legacy job type."
        },
        {
          "tag": "new",
          "description": "<strong><a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-curation/job-reconstruct-2d-classes\">Reconstruct 2D Classes</a></strong> job that reconstructs 2D class averages from previously classified particles."
        },
        {
          "tag": "new",
          "description": "Ability to set custom parameters within the Live session view when configuring custom Streaming 2D Classification, Ab-inito and Streaming Refinement jobs."
        },
        {
          "tag": "new",
          "description": "Job cards now indicate warnings and errors, along with a text preview. If a job contains warnings or encountered an error, an icon will display in the cards and tree view. Hovering over the icon will display more information about the warning/error. A subset of the error will be visible directly on the job card view if applicable."
        },
        {
          "tag": "new",
          "description": "Ability to copy parameter code name via the ‘Inputs and Parameters’ tab when previewing a job. This name can be used in <a href=\"https://tools.cryosparc.com/intro.html\"><code>cryosparc-tools</code> scripts</a>."
        },
        {
          "tag": "new",
          "description": "If a job exists in more than one workspace, an icon and informational tooltip will be show on the cards view. In addition, jobs that display in the tree view but are not explicitly linked to the selected workspace are marked with an icon and informational tooltip for additional context."
        },
        {
          "tag": "new",
          "description": "Ability to star a Live session from within the session view through the primary dropdown menu."
        },
        {
          "tag": "new",
          "description": "Import Particles contains a new set of parameters to enable build-time output group generation and validation. This allows Import Particles to be used within Workflows for automated processing."
        },
        {
          "tag": "new",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/simulations/job-simulate-data-gpu\">Simulate Data job</a> that is now GPU accelerated. The previous implementation is available as a legacy job."
        },
        {
          "tag": "update",
          "description": "The <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-performance-benchmarking-v4.3+\">Performance Benchmarks</a> system now captures benchmarks from the core algorithms used in 2D Classification and 3D Classification jobs. In addition, reference GPU Benchmarks have been added for the <code>RTX 4090</code>, <code>A100 PCIE-40GB</code>, <code>RTX 3090</code>, and <code>A4000</code> GPUs, as well as for <code>AWS EC2 g5</code> instances with FSx for Lustre and local NVME SSDs."
        },
        {
          "tag": "update",
          "description": "The <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/post-processing/job-validation-fsc\">Validation (FSC) job</a> now outputs an additional FSC figure with square plot markers along with a line, to more clearly see each resolution shell."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/variability/job-3d-variability-display\">3D Variability Display</a> now includes an option to create intermediate reconstructions with equal numbers of particles in each frame. The job now also allows up to 100 input components instead of 20."
        },
        {
          "tag": "update",
          "description": "2D Classification now has an option to set a minimum alignment resolution that provides the ability to high-pass filter references during classification and can be useful for smaller particles in some cases. The job also has an option to display a scale bar on the 2D class averages figure."
        },
        {
          "tag": "update",
          "description": "Heterogeneous Refinement now correctly accounts for the <code>Backprojection resolution factor</code> parameter; the job card image display is improved when there are classes of very low resolution; the <code>Initial random assignment iterations</code> parameter now applies only if non-distinct initial volumes are provided; and the job now outputs a volume series containing all the classes that were produced."
        },
        {
          "tag": "update",
          "description": "3D Classification now filters the consensus volume according to its FSC and outputs the result for downstream use."
        },
        {
          "tag": "update",
          "description": "Sharpening Tools job now estimates a B-factor using a Guinier plot if a sharpening B-factor is not provided, with options to include mask and FSC weights prior to estimation."
        },
        {
          "tag": "update",
          "description": "Downsample Particles now allows ‘uncropping’: when the desired box size is larger than the input particle box size, the particles are padded in real space and the padded region is filled with the mean value of the particle."
        },
        {
          "tag": "update",
          "description": "Downsample particles now has an option to re-center particles according to their shifts."
        },
        {
          "tag": "update",
          "description": "The Rebalance 2D Classes job now displays a plot of the pairwise affinity matrix between 2D classes, and also updates particle’s 2D alignments to be in-register within each superclass. Also, the job now always outputs combined datasets for particles and templates, even if “Split outputs” was activated."
        },
        {
          "tag": "update",
          "description": "The legacy web application (deprecated since CryoSPARC v3.0 in December 2021) that could be spawned via <code>cryosparcm start app_legacy</code> and operated at <code>BASE_PORT + 7</code> is no longer bundled with CryoSPARC."
        },
        {
          "tag": "update",
          "description": "The CryoSPARC database now has <a href=\"https://www.mongodb.com/docs/manual/core/journaling/\">journaling</a> turned on by default, increasing durability in the event of a failure."
        },
        {
          "tag": "update",
          "description": "When a job is in building status, any custom parameters set are visible on the job card in the tree view."
        },
        {
          "tag": "update",
          "description": "CryoSPARC Live sessions now use 10% less storage space per micrograph in the database by reducing the number of plots created during preprocessing. To turn on all plotting, enable the “Enable Plotting in RTP Worker” session parameter."
        },
        {
          "tag": "update",
          "description": "CryoSPARC Live Session UIDs now increment monotonically, independent from Workspace UID."
        },
        {
          "tag": "update",
          "description": "Micrograph images with pick locations overlayed can now be downloaded from the micrograph viewer in CryoSPARC Live."
        },
        {
          "tag": "update",
          "description": "The job details sidebar now shows the last time a job was exported and the path to which it was exported, to make it easy to find exported data."
        },
        {
          "tag": "update",
          "description": "The recent jobs sidebar can now be toggled to show either the user’s jobs only or all instance jobs, as well as showing completed, failed, and killed jobs."
        },
        {
          "tag": "update",
          "description": "In Blob Picker and Filament Tracer, the templates are now available as outputs, along with the particles."
        },
        {
          "tag": "update",
          "description": "The Template Picker now has a parameter to disable automatic re-centering of the template image, which has been known to cause issues in some cases."
        },
        {
          "tag": "update",
          "description": "Exposure Sets Tools and Particle Sets Tools now generate their output groups before they are run, allowing these jobs to be part of pre-defined Workflows."
        },
        {
          "tag": "update",
          "description": "Volume Tools now can invert masks without applying a threshold."
        },
        {
          "tag": "update",
          "description": "Volume Tools now specifies that the units for the dilation radius and the padding width are in pixels, and the default soft mask padding is set to 12 pixels."
        },
        {
          "tag": "update",
          "description": "Volume Alignment Tools now has an option to reassign particles’ UIDs, for assisting the refinement of particles with custom symmetry operators."
        },
        {
          "tag": "update",
          "description": "Homogeneous Reconstruction Only now includes the posterior precision as an output, as part of the the volume group."
        },
        {
          "tag": "update",
          "description": "DeepEMhancer job now includes an option to enable dynamic allocation of GPU memory, obviating the need to set an environment variable."
        },
        {
          "tag": "update",
          "description": "DeepEMhancer model path can now be specified as a project-level default parameter."
        },
        {
          "tag": "update",
          "description": "The Deep Picker job now runs with Tensorflow v2.8."
        },
        {
          "tag": "update",
          "description": "Many jobs now use a common progress bar in the event log."
        },
        {
          "tag": "update",
          "description": "When queueing a job via the sidebar, the last used lane will now automatically be selected, if applicable."
        },
        {
          "tag": "update",
          "description": "When importing a job, the path will now default to the project directory of the selected project."
        },
        {
          "tag": "update",
          "description": "Initial loading of the job tree view is improved."
        },
        {
          "tag": "update",
          "description": "Summary data shown on job cards is improved across CryoSPARC."
        },
        {
          "tag": "update",
          "description": "Additional quick actions are now available for swift creation of commonly run jobs."
        },
        {
          "tag": "update",
          "description": "Additional project-level filters can now be used to show archived or detached projects."
        },
        {
          "tag": "fixed",
          "description": "PatchCTF can now correctly handle high-magnification micrographs without throwing <code>AssertionError: Get rid of patches that are too close to edges</code>."
        },
        {
          "tag": "fixed",
          "description": "2D classification no longer displays classes upside-down relative to the image plotting convention used in the rest of CryoSPARC."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where a list of all jobs are not available via the header quick switcher when viewing all jobs within a single project."
        },
        {
          "tag": "fixed",
          "description": "Resolved a bug where it is possible to create Session configuration profiles with the same name."
        },
        {
          "tag": "fixed",
          "description": "Resolved a bug where when deleting a workspace the interface does not redirect to the project level."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where the number of GPUs a job is utilizing is formatted incorrectly on the job card."
        },
        {
          "tag": "fixed",
          "description": "When queueing a job via the sidebar, the cluster submission script variable configuration panel is now hidden if no custom variables are defined in the script."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue on Firefox where the exposure feed in a Live session view can not be controlled via the mouse scrollbar."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue on the job cards display where the border outlining parents, children and cloned jobs is too thin."
        },
        {
          "tag": "fixed",
          "description": "Fixed a issue where queued jobs can be accidentally deleted via the multi-action sidebar panel."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where the ‘Build’ button in the job preview dialog does not function correctly in certain cases."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue in the jobs tree view where the final or final ancestor status of a job is not visible until selected."
        },
        {
          "tag": "fixed",
          "description": "Fixed an issue in 2D Classification where the greyscale background of class averages is incorrectly computed from the values in the corners of the average."
        },
        {
          "tag": "fixed",
          "description": "Fixed <code>pymongo.errors.WriteError: Size must be between 0 and 16793600(16MB)</code> when processing a live session with a large number (&gt;10,000) of movies."
        },
        {
          "tag": "fixed",
          "description": "It is now possible to specify <code>--cpus</code> in <code>cryosparcw connect</code> without also having to specify <code>--update</code>."
        },
        {
          "tag": "fixed",
          "description": "Exposures processed by CryoSPARC Live now have their average intensity computed."
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug where Particle Subtraction does not process all of the particles if the half sets are not of equal sizes."
        },
        {
          "tag": "fixed",
          "description": "Resolved a bug where 3D Variability’s tile image displays components in the wrong order after job completion."
        },
        {
          "tag": "fixed",
          "description": "2D Classification no longer erroneously removes duplicates by default for particle datasets with <code>filament</code> present."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug where Helical Refinement in building mode doesn’t allow modifications to the “enable FSC noise-substitution” parameter"
        },
        {
          "tag": "fixed",
          "description": "Fixed bug where flipping the hand of a volume (in volume tools, homogeneous reconstruction, Align 3D, and 3D Variability Display jobs) causes symmetric volumes to no longer be aligned to the conventional symmetry axes."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug causing 2D Classification to calculate the wrong inter-particle distance when removing duplicates when downsampled particles are provided as input."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug causing an <code>UnboundLocalError</code> in Patch CTF Extraction."
        },
        {
          "tag": "fixed",
          "description": "Disabled menu items no longer erroneously open sub menus when hovering."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where the spacebar shortcut for opening job dialogs stops working due to conflicting event handlers."
        },
        {
          "tag": "fixed",
          "description": "Fixed an issue where the scatter plot in Manually Curate Exposures does not updating the rejected status of micrographs correctly."
        },
        {
          "tag": "fixed",
          "description": "Deleting a job while the queue slideover is open no longer causes it to lose context and go blank."
        },
        {
          "tag": "fixed",
          "description": "Select 2D job now correctly reports error messages when it cannot connect to the backend."
        },
        {
          "tag": "fixed",
          "description": "Installer no longer writes duplicate <code>PATH</code> entries for <code>cryosparc_master/bin</code> directory into <code>.bashrc</code>."
        },
        {
          "tag": "fixed",
          "description": "CryoSPARC Live processing jobs no longer use more memory than needed when plotting."
        },
        {
          "tag": "fixed",
          "description": "Errors that happen when CryoSPARC Live is watching for new files are now isolated so that errors in one session do not affect other running sessions."
        },
        {
          "tag": "fixed",
          "description": "CryoSPARC Live can now run reconstruction processes (2D Classification, Refinement) on a lane with multiple one-GPU targets."
        },
        {
          "tag": "fixed",
          "description": "The reliability of <code>cryosparcm update</code> is now improved in the case where the master is connected to itself as a worker."
        },
        {
          "tag": "fixed",
          "description": "CTFFIND4 jobs no longer fail due to localization settings on some systems."
        },
        {
          "tag": "fixed",
          "description": "Leading and trailing spaces are now automatically removed when setting parameters."
        },
        {
          "tag": "fixed",
          "description": "Local Motion Correction no longer fails when no particles are extracted from one or more exposures."
        },
        {
          "tag": "fixed",
          "description": "3D Classification no longer fails during noise estimation if the largest class contains fewer than 100 particles. A warning is also now printed if any per-particle scale factors become NaN."
        },
        {
          "tag": "fixed",
          "description": "The new parameter <code>Disable auto batchsize</code> now allows disabling the automatic GPU processing batch size calculation in non-uniform and homogeneous refinement that can sometimes cause the jobs to run out of GPU RAM. Extraneous batch size parameters from local refinement are removed."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug where background subtraction of density maps during ab-initio and heterogeneous refinement is incorrect."
        },
        {
          "tag": "fixed",
          "description": "Fixed erroneous component ordering in 3D Variability Analysis Display when using 10+ components."
        },
        {
          "tag": "fixed",
          "description": "Fixed confusing labelling of variability component plots produced at the end of 3D Variability Analysis jobs."
        },
        {
          "tag": "fixed",
          "description": "MRC format volume outputs from CryoSPARC now include mx/my/mz values in the header which fixes display issues in some visualization programs."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue in the job builder where numerical inputs display inaccurate tooltip information on hover."
        },
        {
          "tag": "fixed",
          "description": "Moving jobs between workspaces now correctly updates workspace statistics."
        },
        {
          "tag": "fixed",
          "description": "The workspace count statistic is now correctly incremented when a new workspace is created in a project."
        },
        {
          "tag": "fixed",
          "description": "Fixed an issue where the lock file within a project locked to another instance is overwritten rather than blocking the attachment of the project in another instance."
        },
        {
          "tag": "fixed",
          "description": "Homogeneous Reconstruct Only job now correctly allows for turning off the real-space window on particles."
        }
      ]
    },
    {
      "tag": "v4.3.1",
      "date": "08/31/2023",
      "items": [
        {
          "tag": "fixed",
          "description": "Fixed an issue where in some cases, memory usage of the CryoSPARC master processes could grow without bound after restarting the instance."
        },
        {
          "tag": "fixed",
          "description": "Sizes of job directories on disk are no longer updated more often than necessary."
        },
        {
          "tag": "fixed",
          "description": "CryoSPARC Live sessions are now automatically paused when the instance is restarted."
        },
        {
          "tag": "fixed",
          "description": "Fixed an issue where a project could be detached while a CryoSPARC Live session was still running."
        },
        {
          "tag": "fixed",
          "description": "CryoSPARC Live no longer monitors worker jobs when not necessary."
        }
      ]
    },
    {
      "tag": "v4.3.0+230816 (Patch)",
      "date": "08/16/2023",
      "items": [
        {
          "tag": "fixed",
          "description": "Prevent “syntax error” following successful CryoSPARC update"
        }
      ]
    },
    {
      "tag": "v4.3.0",
      "date": "08/09/2023",
      "items": [
        {
          "tag": "new",
          "description": "<p><b><a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-cleanup-v4.3+\">Data Cleanup Tools</a></b></p> <p>A new suite of tools to simplify the process of tracking and reducing disk space usage in CryoSPARC. <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-cleanup-v4.3+\">Supporting five ways to clear up projects or workspaces:</a></p> <ul><li>→ Mark certain jobs as <b>final</b> and automatically clear everything except for jobs needed to replicate those results</li><li>→ <b>Compact</b> CryoSPARC Live sessions, removing preprocessing data but storing particle locations and parameters needed to <b>restore</b> the session later</li><li>→ <b>Restack</b> particles to remove filtered out junk particles and then automatically clear <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-cleanup-v4.3+#determinism-in-cryosparc\">deterministic</a> <b>preprocessing</b> jobs that can be re-run later if needed</li><li>→ Clear <b>intermediate results</b> of iterative jobs across a project or workspace</li><li>→ Clear <b>killed and failed</b> jobs that take up disk space but can’t be further used</li> </ul> <p>Featuring a comprehensive Cleanup Data user interface, on-demand refreshing of project and job size statistics, data usage summaries in the project details sidebar, and new right-click menu options for selecting ancestors and descendants of jobs manually. See the <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-cleanup-v4.3+\">Data Cleanup guide</a> for more details.</p>"
        },
        {
          "tag": "new",
          "description": "<p><b><a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-performance-benchmarking-v4.3+\">Performance Benchmarking Utilities</a></b></p> <ul><li>→ A new <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-performance-benchmarking-v4.3+\">system for measuring and comparing key aspects of CryoSPARC performance</a> across CPU, File system, and GPU operations. The benchmarking jobs break down critical elements of CryoSPARC high performance code paths and measure detailed timings to shed light on which parts of a system may be bottlenecking performance.</li><li>→ A new performance benchmark user interface allowing for visual comparison of different benchmark runs as well as <strong>reference benchmarks</strong> published along with CryoSPARC. The interface can display detailed timings from benchmarking jobs or job runtimes from full runs of the <strong>Extensive Validation</strong> <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/tutorial-verify-cryosparc-installation-with-the-extensive-workflow-sysadmin-guide\">(previously called Extensive Workflow)</a> test set.</li> </ul>"
        },
        {
          "tag": "new",
          "description": "Particle caching in CryoSPARC jobs now support multiple threads (default 2), increasing copy speed on certain filesystems. To modify, specify <code>CRYOSPARC_CACHE_NUM_THREADS</code> in <code>cryosparc_worker/config.sh</code>. <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/environment-variables\">Read the guide for more information."
        },
        {
          "tag": "new",
          "description": "<p><b><a href=\"https://guide.cryosparc.com/application-guide-v4.0+/interactive-jobs\">Interactive Job Improvements</a></b></p> <p><a href=\"https://guide.cryosparc.com/application-guide-v4.0+/interactive-jobs\">New plots, displays, and interactive tools across all interactive jobs</a>, including a new exposure image grid view in the Exposure Curation job for ease of assessing and manually curating exposures, and the ability to set threshold parameters when starting the job to bypass interaction and automatically filter data.</p> <p>Several usability enhancements, including:</p> <ul><li>→ Extraction is now optional in the manual picker</li>   <li>→ Datasets without pick statistics can be used in Inspect Picks</li><li>→ Charts in Exposure Curation remember their expand/collapse state when reloaded</li><li>→ Exposure Curation now displays particle picks if available</li><li>→ Optimized micrograph image loading for faster response times</li> </ul>"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/tutorial-verify-cryosparc-installation-with-the-extensive-workflow-sysadmin-guide\">Extensive Validation</a> (previously called Extensive Workflow) job extended to support multiple datasets and also has a new <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-performance-benchmarking-v4.3+#performance-benchmarking-entire-jobs-with-the-extensive-validation-job\">“Benchmark” mode</a> where timing results are reported and browsable using the new Performance Benchmarking system."
        },
        {
          "tag": "new",
          "description": "The <code>cryosparcm compact</code> command can reduce the amount of disk space used by the MongoDB database. <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-reduce-database-size-v4.3+\">This, along with other steps</a>, may be useful for reducing used storage space in instances with large database sizes. See the <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-reduce-database-size-v4.3+\">Guide: Reduce Database Size</a> for more details."
        },
        {
          "tag": "update",
          "description": "<p>Interactive job improvements:</p> <ul><li>→ Flipped Select 2D resolution threshold selection option for clarity</li>   <li>→ Added total picks across all exposures as info badge in Manual Picker top bar</li><li>→ Added filter to Select 2D job to allow showing of only selected or unselected classes (sorting options can be applied to filtered classes)</li><li>→ Added info badge to Inspect Picks job to display the total number of particles within the applied thresholds</li><li>→ Manual Picker and Inspect Picks jobs now display all available data fields in the micrograph table</li><li>→ Added an exposure image preview when hovering exposure table rows in interactive jobs</li><li>→ Individual tab has been renamed to diagnostics in Exposure Curation job for clarity of function</li><li>→ Thresholds of 0 now filter micrographs correctly in Exposure Curation job</li><li>→ Support added for right clicking to remove picks in Manual Picker job</li> </ul>"
        },
        {
          "tag": "update",
          "description": "Non-uniform Refinement implementation speedups up to 15% on certain GPUs and box sizes."
        },
        {
          "tag": "update",
          "description": "Import Particles job is now 50-70% faster."
        },
        {
          "tag": "update",
          "description": "Improved speed of the caching system by reducing the number of file lookups, and improved  logging of the cache system while a job is running."
        },
        {
          "tag": "update",
          "description": "CTFFIND4 is updated to v4.1.14."
        },
        {
          "tag": "update",
          "description": "Import and utility jobs that previously ran only on the master node can now optionally be launched on any worker node or cluster lane. The <code>CRYOSPARC_DISABLE_IMPORT_ON_MASTER</code> environment variable is no longer used."
        },
        {
          "tag": "update",
          "description": "Added star button to top navigation bar in browse system to allow starring a workspace from the jobs page."
        },
        {
          "tag": "update",
          "description": "Quick access panel will now remember selections on a user basis rather than a browser tab basis."
        },
        {
          "tag": "update",
          "description": "The load all jobs view option is now saved per-user rather than based on the browser."
        },
        {
          "tag": "update",
          "description": "Event log view options have been moved into a new view options menu to minimize interface clutter."
        },
        {
          "tag": "update",
          "description": "Sessions can now be marked as completed from the session browser view."
        },
        {
          "tag": "update",
          "description": "Archived and detached projects no longer show within the session browser."
        },
        {
          "tag": "update",
          "description": "An Additional spotlight action added to navigate to the job history page."
        },
        {
          "tag": "update",
          "description": "The ‘view job’ button in the sidebar can be <code>ctrl</code>/<code>cmd</code> clicked to open in a new tab"
        },
        {
          "tag": "update",
          "description": "For job types that take random seed parameters, the random seed that was used is now saved in the input parameters of the job for easy reuse. The random seed will stay consistent if the job is cleared and re-run."
        },
        {
          "tag": "update",
          "description": "2D Classification, 3D Classification, and 3D Variability Analysis jobs will now produce intermediate results at each iteration, but will delete intermediate results from previous iterations as each new iteration completes. This behaviour can be turned off with a project-level or job-level parameter that will keep all intermediate results."
        },
        {
          "tag": "update",
          "description": "Jobs that fail to report heartbeat to the master node within the required timeout but continue running in the background will now be killed on their worker node, rather than being allowed to continue running after having been marked as failed due to missing heartbeat."
        },
        {
          "tag": "update",
          "description": "Worker installation job launch test (<code>cryosparcm test workers</code>) timeout increased to 2 minutes from 10 seconds."
        },
        {
          "tag": "update",
          "description": "The <code>config.sh</code> file with environment variables will now be included in the <code>cryosparcm snaplogs</code> bundle of logs."
        },
        {
          "tag": "update",
          "description": "CryoSPARC running version is now available in the Job PDF download."
        },
        {
          "tag": "update",
          "description": "MongoDB database journaling can be enabled by adding <code>export CRYOSPARC_MONGO_EXTRA_FLAGS=&quot; &quot;</code> to <code>cryosparc_master/config.sh</code>."
        },
        {
          "tag": "fixed",
          "description": "Topaz Extract job no longer extracts particles from denoised micrographs by default."
        },
        {
          "tag": "fixed",
          "description": "3DFlex Generate job no longer ignores the Number of Frames parameter."
        },
        {
          "tag": "fixed",
          "description": "Fixed unnecessary <code>AssertionError</code> in Flex Mesh Prep job when pixel size between input mask and volume match but have rounding error difference"
        },
        {
          "tag": "fixed",
          "description": "Heterogenous Refinement job no longer fails with <code>AttributeError</code> when “Refinement box size (Voxels)” parameter passed <code>None</code> as a value."
        },
        {
          "tag": "fixed",
          "description": "Worker installation test (<code>cryosparcm test workers</code>) no longer fails when worker target does not have SSD configured."
        },
        {
          "tag": "fixed",
          "description": "CryoSPARC Live Session compute configuration parameters no longer fails to be changed if a worker lane that was previously selected is removed from the CryoSPARC instance."
        },
        {
          "tag": "fixed",
          "description": "Fixed select confirmation appearance in Edge browser on Windows."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug where Job PDF would show incorrect parameter values in some cases."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where PDF event log download was crashing due to control characters being interpreted incorrectly during text cleaning."
        },
        {
          "tag": "fixed",
          "description": "Corrected sorting order of the job event log PDF."
        },
        {
          "tag": "fixed",
          "description": "Added optimistic job count update to stop the user interface loading state from glitching when deleting a workspace job when few exist."
        },
        {
          "tag": "fixed",
          "description": "Resolved error where Import Result Group fails to import Topaz jobs correctly, causing downstream jobs to fail."
        },
        {
          "tag": "fixed",
          "description": "Resolved error where Import 3D Volumes job fails with “Unable to connect to EMDB server” when trying to load volumes from EMBD."
        },
        {
          "tag": "fixed",
          "description": "Allow retrieving job and workspace documents from the CLI without errors."
        },
        {
          "tag": "fixed",
          "description": "Improved handling of missing job parent in tree view."
        },
        {
          "tag": "fixed",
          "description": "Live no longer stops finding new exposures until the next restart."
        }
      ]
    },
    {
      "tag": "v4.2.0+230427 (Patch)",
      "date": "04/27/2023",
      "items": [
        {
          "tag": "fixed",
          "description": "Correct free SSD cache storage calculation to prevent infinite cache hang when there is enough available SSD storage"
        }
      ]
    },
    {
      "tag": "v4.2.0+230403 (Patch)",
      "date": "04/03/2023",
      "items": [
        {
          "tag": "fixed",
          "description": "Correct retrieval of legacy cluster configurations"
        },
        {
          "tag": "fixed",
          "description": "Live no longer stops finding new exposures"
        },
        {
          "tag": "fixed",
          "description": "SSD Cache system correctly retries up to 3 times on network timeout"
        }
      ]
    },
    {
      "tag": "v4.2.1",
      "date": "03/15/2023",
      "items": [
        {
          "tag": "new",
          "description": "A project-level parameter now controls whether or not jobs output <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-management-in-cryosparc-v4.0+#4.-ability-to-clear-intermediate-results\">intermediate results</a>, with default on. Turning this off will save disk space, without having to manually clear intermediate results after the jobs complete."
        },
        {
          "tag": "update",
          "description": "In <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-particle-sets-tool\"><em>Particle Sets Tool</em></a> and <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-exposure-sets-tool\"><em>Exposure Sets Tool</em></a> jobs, add note in event log indicating that result groups are taken from set <code>A</code> for the <code>intersect</code> dataset."
        },
        {
          "tag": "update",
          "description": "In <em>Average Power Spectra</em> job, print particle pixel size and power spectra sample spacing to the event log."
        },
        {
          "tag": "fixed",
          "description": "<em>Manual Picker</em> no longer fails when micrograph CTF input is not provided."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where loading external data for the homepage modules would fail if a non-standard response was received."
        },
        {
          "tag": "fixed",
          "description": "Prevented a database error from occurring when no recent items existed for a user."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where copying to the clipboard would not work in some cases depending on how CryoSPARC was hosted over an internal network."
        },
        {
          "tag": "fixed",
          "description": "Priority field in the job queuing slide-over is now required and cannot be empty."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where a previously selected entity was still selected after creating a new project."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where clearing a job would not reset its queue priority."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where completed jobs that were deleted displayed within project, workspace and session cards."
        },
        {
          "tag": "fixed",
          "description": "In <em>3D Classification</em>, fixed <code>KeyError</code> with CTF fields when “Output results after every F-EM iteration” is enabled."
        },
        {
          "tag": "fixed",
          "description": "Fixed an issue where re-ordering classes and outputting intermediate results in 3D Classification conflicted and caused the job to fail. These options are now mutually exclusive."
        }
      ]
    },
    {
      "tag": "v4.2.0+230302 (Patch)",
      "date": "03/02/2023",
      "items": [
        {
          "tag": "update",
          "description": "In <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/ctf-refinement/job-global-ctf-refinement\">Global CTF Refinement</a>, throw a warning if the spherical aberration refines to a nonpositive value."
        },
        {
          "tag": "update",
          "description": "In <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/variability/job-3d-classification-beta\">3D Classification</a>, add &quot;Force re-do FSC split” parameter that forces re-splitting the particles into half-set splits from scratch. Disabling this allows for preserving the input splits, for particles from previous helical refinements, symmetry expansions, or local refinements."
        },
        {
          "tag": "fixed",
          "description": "Fixed a problem in <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-curation/job-2d-classification\">2D classification</a> where many classes would be blank or very faint if multiple GPUs were used."
        },
        {
          "tag": "fixed",
          "description": "Fixed issues when running multiple jobs using the same SSD cache space."
        },
        {
          "tag": "fixed",
          "description": "Fixed <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/post-processing/job-threedfsc-wrapper\">3DFSC</a> crashing due to list index out of range error."
        },
        {
          "tag": "fixed",
          "description": "In <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/variability/job-3d-classification-beta\">3D Classification</a>, removed extraneous <code>alignments3D</code> entry in <code>particles_all_classes</code> dataset output which caused <a href=\"https://github.com/asarnow/pyem/blob/master/csparc2star.py\">csparc2star.py</a> to assign all particles to a single class."
        }
      ]
    },
    {
      "tag": "v4.2.0",
      "date": "02/27/2023",
      "items": [
        {
          "tag": "new",
          "description": "CryoSPARC now fully supports CUDA 11.8, enabling support for NVIDIA Hopper and NVIDIA Ada Lovelace GPUs (NVIDIA H100, NVIDIA RTX 40 Series), including for 3DFlex."
        },
        {
          "tag": "new",
          "description": "<p>The browse system has been updated with various incremental improvements including table header sorting, customizable view options, and upgraded CSV download functionality.</p><ul><li>→ A <a href=\"https://guide.cryosparc.com/application-guide-v4.0+/using-the-cryosparc-interface/view-options\">view options menu</a> can be accessed from the browse system control bar allowing card and table details to be shown or hidden to suit user preference.</li><li>→ The view options menu table section items can be dragged and dropped within the list to re-order the table view columns.</li><li>→ The CSV download feature now includes an additional dialog allowing the user to select what information to include or exclude and the ability to re-order the table columns.</li></ul>"
        },
        {
          "tag": "new",
          "description": "Within the details sidebar of a job, you can click on a particular cloned, parent, or child job to view it in the current tab. Command/ctrl click it to open that job in a new tab."
        },
        {
          "tag": "new",
          "description": "Within the ‘Metadata’ tab in the job preview dialog, there is a button to download the JSON data of a job to your clipboard."
        },
        {
          "tag": "new",
          "description": "Added a quick action to perform CTF Estimation via <em>CTTFIND4</em> from a <em>Patch Motion Correction</em> job."
        },
        {
          "tag": "update",
          "description": "Introduced a workaround for a bug in CUDA 11.8 which formerly caused jobs relying on CUDA Fourier transforms (cuFFT) to run slower than they should (sometimes dramatically so)."
        },
        {
          "tag": "update",
          "description": "When importing <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/import/job-import-movies\">movies</a> and <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/import/job-import-micrographs\">micrographs</a>, the ‘Skip header check’ parameter is now enabled by default."
        },

        {
          "tag": "update",
          "description": "Performance and stability improvements to all interactive job tables and the browse table in Live sessions."
        },
        {
          "tag": "update",
          "description": "Improvements to the context menu for job cards within the current jobs dialog."
        },
        {
          "tag": "update",
          "description": "Optimized current jobs tab within manage dialog and added a running timer for each job."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug in <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/variability/job-3d-classification-beta\">3D Classification</a> that caused <a href=\"https://github.com/asarnow/pyem/blob/master/csparc2star.py\">csparc2star.py</a> to produce erroneous star files if class reordering was turned on."
        },
        {
          "tag": "fixed",
          "description": "If a job is running on a cluster, the available memory usage statistic is no longer displayed within the event log."
        },
        {
          "tag": "fixed",
          "description": "If specified, the cropped box size is correctly displayed on the card of a <em>Volume Tools</em> job."
        },
        {
          "tag": "fixed",
          "description": "Resolved cases where the outputs view mode toggle was triggered while attempting to perform a browser or operating system keyboard shortcut."
        },
        {
          "tag": "fixed",
          "description": "<p>Removed variables <code>ram_gb</code>, <code>num_cpu</code>, and <code>num_gpu</code> from appearing as custom variables in a cluster configuration.</p><ul><li>→ The above variables are internal variables set by CryoSPARC and cannot be used/modified as custom variables</li><li>→ <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-configuring-custom-variables-for-cluster-job-submission-scripts\">Updated guide</a> with a list of internal cluster variables and instructions for modifying resources requested in a cluster submission script</li></ul>"
        },
        {
          "tag": "fixed",
          "description": "Fixed reading of <code>.mrc.bz2</code> gain reference files in CryoSPARC Live."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue on some OSes where building <code>pycuda</code> would fail during installation."
        },
        {
          "tag": "fixed",
          "description": "Fixed error message during job heartbeat failure to correctly specify heartbeat timeout."
        },
        {
          "tag": "fixed",
          "description": "Fixed “wrong generation counter” error during some long-running jobs."
        },
        {
          "tag": "fixed",
          "description": "Performance optimizations to the volume viewer in Live Sessions and the job preview dialog."
        },
        {
          "tag": "fixed",
          "description": "Fixed <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-curation/job-2d-classification\">2D Classification</a> to allow manual overrides to <em>Force max over poses/shifts</em> parameter if classes is set to 20 or fewer."
        },
        {
          "tag": "fixed",
          "description": "Removed the parameter “Overall normalizer (override)” in particle extraction. The parameter had no effect."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where clearing intermediate results for projects triggered multiple notifications."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where viewing a job without selecting the card would select and pin it to the sidebar."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where the current jobs tab within the manage dialog would crash the application in some situations when interactive jobs were queued or active."
        },
        {
          "tag": "fixed",
          "description": "Resolved a bug where it was not possible to define a threshold for the ‘Timestamp’ attribute of exposures in a Live Session."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue that caused an ‘Invalid path’ error when building <em>Topaz</em> or <em>DeepEMhancer</em> jobs."
        }
      ]
    },
    {
      "tag": "v4.1.2",
      "date": "01/23/2023",
      "items": [
        {
          "tag": "new",
          "description": "Added a new <em>Restack Particles</em> job for consolidating particle files. More information available <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/extraction/job-restack-particles\">in the guide</a>."
        },
        {
          "tag": "new",
          "description": "New <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/variability/job-3d-classification-beta\"><em>3D Classification</em></a> parameters<ul><li>→ Added an option (default: on) to re-order classes by number of particles at the end of processing</li><li>→ Added maximum F-EM iterations which will terminate classification even if convergence criteria are not met</li></ul>"
        },
        {
          "tag": "new",
          "description": "In addition to CPU memory used, available CPU memory can now be displayed in the job event log. It is also displayed in the job log PDF."
        },
        {
          "tag": "new",
          "description": "Added options to sort projects by their size."
        },
        {
          "tag": "new",
          "description": "Added a new project-level action to delete detached projects from the CryoSPARC database. More information is available in the updated <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-management-in-cryosparc-v4.0+#detach\">data management guide</a>."
        },
        {
          "tag": "new",
          "description": "Exposure preview context menus in CryoSPARC Live now feature a button to reject/unreject the exposure."
        },
        {
          "tag": "update",
          "description": "Additional timestamp information added to job output log."
        },
        {
          "tag": "update",
          "description": "The job preview dialog project and workspace breadcrumbs have been updated to native browser links to allow them to be opened in a new window or tab."
        },
        {
          "tag": "update",
          "description": "Buttons with a corresponding keyboard shortcut will now show that shortcut in their tooltips."
        },
        {
          "tag": "update",
          "description": "The tree view now supports using the shift key to toggle the outputs view on all job cards."
        },
        {
          "tag": "update",
          "description": "Multi-select context menu improvements<ul><li>→ The job card action menu trigger button will now always display that job’s specific action menu even with multiple jobs selected</li><li>→ Opening the action menu on a job card not included in a multi-selection will show that job’s specific action menu instead of the multi-select action menu</li><li>→ The multi-select action menu can now be opened by right clicking the workspace background and not just jobs within the selection</li></ul>"
        },
        {
          "tag": "fixed",
          "description": "In <em>3D classification</em>, ensure solvent mask is generated from consensus volume if (only) a focus mask is supplied."
        },
        {
          "tag": "fixed",
          "description": "Fix a memory leak in <em>3D Classification</em> related to plotting. With the fix applied, peak memory usage should be significantly reduced, with jobs that have a large number (50+) of classes seeing the most benefit (up to a 75% reduction)."
        },
        {
          "tag": "fixed",
          "description": "Fix incorrect batch size during class ESS tuning in <em>3D Classification</em> that required excessive amounts of GPU memory."
        },
        {
          "tag": "fixed",
          "description": "Errors reading TIFF files during import movies could cause abnormal termination."
        },
        {
          "tag": "fixed",
          "description": "Event log would flash and jump in a perpetual loading state in some cases."
        },
        {
          "tag": "fixed",
          "description": "Job description would automatically close while being edited in some cases."
        },
        {
          "tag": "fixed",
          "description": "Clearing intermediate results on jobs with empty output result groups would cause an error."
        },
        {
          "tag": "fixed",
          "description": "Jobs exported from this version may now be correctly imported in older versions of CryoSPARC."
        },
        {
          "tag": "fixed",
          "description": "Added a guard against creating redundant outputs in <em>Extract From Micrographs (CPU)</em>."
        }
      ]
    },
    {
      "tag": "v4.1.1+230110 (Patch)",
      "date": "01/10/2023",
      "items": [
        {
          "tag": "update",
          "description": "Improved database startup reliability following updates."
        },
        {
          "tag": "fixed",
          "description": "Prevent wrong generation dataset error for some jobs that process a large amount of micrographs or particles."
        },
        {
          "tag": "fixed",
          "description": "Prevent Extract From Micrographs (GPU) job from using too much GPU memory, causing exposures to fail with <code>cufftAllocFailed</code> or <code>cufftInternalError</code>."
        }
      ]
    },
    {
      "tag": "v4.1.1",
      "date": "12/20/2022",
      "items": [
        {
          "tag": "fixed",
          "description": "Fixed a bug affecting some OSes in the dependency installation for 3DFlex jobs (<code>cryosparcw install-3dflex</code>) that caused a <code>gcc</code> compilation error during the PyCUDA build."
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused 3DVA display to fail when using a subset of variability components."
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug causing restarted jobs with GPU requirements to override the scheduler and jump to the front of the queue on the specified lane."
        }
      ]
    },
    {
      "tag": "v4.1.0",
      "date": "12/12/2022",
      "items": [
        {
          "tag": "new",
          "description": "<b><a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-3d-flexible-refinement\">3D Flexible Refinement (3DFlex)</a></b> (<span className=\"tag tag--beta\">Beta</span>) is a motion-based deep generative model for continuous heterogeneity. It can model non-rigid motion and flexibility of a protein molecule across its conformational landscape, and can use the motion model to combine signal from particle images in different conformations to improve refinement resolution in flexible regions.<ul><li>→ 3DFlex jointly learns a single canonical 3D density map of the particle, latent coordinates for each particle image, and a flow generator network. Given a latent position, the flow generator outputs a 3D deformation field mapping the canonical density to a particular conformation</li><li>→ 3DFlex requires tuning of some parameters and optionally can take custom inputs defining geometry and topology of the target molecule</li><li>→ <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-3d-flexible-refinement\">Read an in-depth guide, including new example results using 3DFlex</a></li><li>→ <a href=\"https://youtu.be/o1srM6PkIP0\">Watch a walkthrough video covering how to using the new algorithm in CryoSPARC</a></li><li>→ Read the <a href=\"https://doi.org/10.1101/2021.04.22.440893\">bioRxiv preprint</a> from April 2021. An updated paper will be made available soon.</li></ul>"
        },
        {
          "tag": "new",
          "description": "<b><a href=\"https://tools.cryosparc.com\">cryosparc-tools</a></b> (<span className=\"tag tag--beta\">Beta</span>) is an open-source Python library that enables powerful scripting access to CryoSPARC.<ul><li>→ Programmatically read and write exposure, particle and volume data</li><li>→ Easily perform advanced operations on metadata (alignments, CTF, etc) and programmatically insert modified data back into CryoSPARC</li><li>→ Access project, workspace and job data</li><li>→ Build and run jobs to orchestrate custom cryo-EM workflows</li><li>→ Extend CryoSPARC functionality with third-party software packages</li><li>→ cryosparc-tools is <a href=\"https://github.com/cryoem-uoft/cryosparc-tools\">on GitHub</a> and available via <code>pip</code> and can be used outside of the CryoSPARC environment in your own programs and tools</li><li>→ <a href=\"https://tools.cryosparc.com\">Read the full documentation including example usage</a></li></ul>"
        },
        {
          "tag": "new",
          "description": "Multi-select actions allow for cloning multiple jobs at once, cloning a chain of jobs between two selections, queuing, clearing or deleting multiple jobs at once, and more. Learn more about multi actions <a href=\"https://guide.cryosparc.com/application-guide-v4.0+/managing-jobs#multi-actions\">here</a>."
        },
        {
          "tag": "new",
          "description": "<a href=\"https://guide.cryosparc.com/application-guide-v4.0+/managing-jobs#restart-job\">Restart job action</a> allows a job to be restarted from a killable or clearable state. This new action kills, clears, and queues the job to the same lane with the same parameters with which it was initially run."
        },
        {
          "tag": "new",
          "description": "Ability to configure custom variables for use in cluster submission scripts directly through the Cluster Configuration Tab in the Admin Panel. Custom variables can be configured at the instance level, target level and job level. See <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-configuring-custom-variables-for-cluster-job-submission-scripts\">Guide: Configuring Custom Variables for Cluster Job Submission Scripts</a> for more details."
        },
        {
          "tag": "new",
          "description": "Ability for admins to restrict users to view and run jobs on specific lanes using the Lane Restrictions Tab on the Admin Panel. See <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-lane-assignments-and-restrictions\">Guide: Lane Assignments and Restrictions</a> for more details. By default, when a CryoSPARC user is created, they are assigned all existing lanes."
        },
        {
          "tag": "update",
          "description": "Multiple updates to <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/variability/job-3d-classification-beta\">Job: 3D Classification</a>. Refer to the job guide and updated <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-3d-classification-beta#important-considerations\">Tutorial: 3D Classification</a> for details.<ul><li>→ Per-particle scale optimization is now built-in to the job</li><li>→ New 'class flow matrix' diagram helps to visualize class changes across F-EM iterations</li><li>→ New ‘Δ’ text column lists class size differences across F-EM iterations</li><li>→ Updated aesthetics for class flow diagram to improve clarity of edges</li><li>→ Unique volumes are no longer required for initialization</li></ul>"
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-remove-duplicate-particles\">Job: Remove Duplicate Particles</a> now allows for duplicate rejection based on 2D and 3D alignment error, in addition to NCC score."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-symmetry-expansion\">Job: Symmetry Expansion</a> now includes a parameter that enables splitting the output particle stack by the applied symmetry operator."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-volume-alignment-tools\">Job: Volume Alignment Tools</a> now allows for application of arbitrary rotations to input volumes, particles, and masks."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-curation/interactive-job-select-2d-classes\">Job: Select 2D Classes</a> now exports an .mrc stack containing only selected classes, and an .mrc stack containing only rejected classes."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-curation/job-2d-classification\">Job: 2D Classification</a> now by default removes duplicate particles after classification based on a minimum separation distance between pick locations."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-curation/job-2d-classification\">2D Classification</a> jobs that perform binary class re-centering now show the binary masks used, generated from the specified threshold."
        },
        {
          "tag": "update",
          "description": "New project-level option to set the <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/post-processing/job-deepemhancer-wrapper#optional-set-deepemhancer-executable-path-as-project-level-default-parameter\">default path to a DeepEMhancer executable</a>. If set, all new DeepEMhancer jobs will automatically be populated with the project-level path."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/import/job-import-particle-stack\">Job: Import Particle Stack</a> now copies <code>rlnAutopickFigureOfMerit</code> into CryoSPARC's <code>pick_stats/ncc_score</code> upon import, if available."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/ctf-refinement/job-global-ctf-refinement\">Job: Global CTF Refinement</a> now allows for initializing the spherical aberration to a custom value, prior to fitting."
        },
        {
          "tag": "update",
          "description": "Ability to prevent CryoSPARC from requesting external resources external HTTPS resources used to display information modules on the homepage by setting <code>CRYOSPARC_DISABLE_EXTERNAL_REQUESTS</code> environment variable to true. <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/environment-variables\">Details</a>."
        },
        {
          "tag": "update",
          "description": "The CryoSPARC updater (<code>cryosparcm update</code>) has several enhancements, including:<ul><li>→ Ability to only download the master and worker update packages without doing a full update. Read more <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-updates#manually-download-update-packages\">here</a></li><li>→ Ability to skip downloading the master and worker update packages, and update using the previously-downloaded packages. Read more <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-updates#skip-downloading-update-packages-during-update\">here</a></li><li>→ The CryoSPARC instance is only shut down after confirming the master and worker update packages are downloaded and valid, reducing downtime during an update</li><li>→ The output log of the update process is now written to <code>cryosparc_master/run/update.log</code>, and can be read any time using <code>cryosparcm log update</code>.</li></ul>"
        },
        {
          "tag": "update",
          "description": "Ability for instances with the <code>CRYOSPARC_DISABLE_IMPORT_ON_MASTER</code> environment variable to queue jobs to the master node."
        },
        {
          "tag": "update",
          "description": "The signatures for the CLI functions <code>delete_project</code> and <code>delete_workspace</code> have changed. Please see the <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/cli\"><code>cryosparcm cli</code> reference page on the CryoSPARC Guide</a> for more information."
        },
        {
          "tag": "update",
          "description": "Project directories can now be renamed by using the edit button beside the \"directory\" field in the details section of the project sidebar."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-reassign-particles-to-micrographs\">Job: Reassign Particles to Micrographs</a> will now copy the exposure group data from the micrographs to the particles if the <code>particles.ctf</code> slot and the <code>exposure.ctf</code> or <code>exposure.mscope_params</code> slots are connected."
        },
        {
          "tag": "update",
          "description": "Job: Import Movies info tag now displays the size of each exposure and number of frames."
        },
        {
          "tag": "update",
          "description": "When viewing jobs in a flattened view (e.g., all jobs in a project) the clone job action sub-menu now provides all workspaces as options to clone into."
        },
        {
          "tag": "update",
          "description": "Restrict some <code>cryosparcm</code> commands to owner UNIX account, including <code>createuser</code>, <code>updateuser</code>, <code>resetpassword</code> and <code>patch</code>."
        },
        {
          "tag": "update",
          "description": "Close open file handles during Import jobs."
        },
        {
          "tag": "update",
          "description": "User IDs are now visible in the output of <code>cryosparcm listusers</code>"
        },
        {
          "tag": "update",
          "description": "<code>job_type</code> variable is now added to available cluster submission script variables provided by CryoSPARC. This value can be used for tracking which CryoSPARC job types are running on a cluster lane or for determining resource requirements for a cluster script."
        },
        {
          "tag": "update",
          "description": "<code>qstat_cmd_tpl</code> and <code>qdel_cmd_tpl</code> will have access to the same variables that are injected into <code>send_cmd_tpl</code>, including any user-configured custom variables."
        },
        {
          "tag": "update",
          "description": "Additional logging for master cache functions."
        },
        {
          "tag": "update",
          "description": "Interactive jobs now print out more informative errors in a scrollable, clearable log at the top of the interactive panel in the job dialog."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue where when viewing all parameters of a job within the comparison dialog incorrect custom parameter values were shown."
        },
        {
          "tag": "fixed",
          "description": "Jobs created via quick actions are no longer created in a different workspace or session than the one currently selected."
        },
        {
          "tag": "fixed",
          "description": "NCC score slider in CryoSPARC Live no longer loses all picks when set to 0."
        },
        {
          "tag": "fixed",
          "description": "Fixed ValueError in <a href=\"https://guide.cryosparc.com/application-guide-v4.0+/interactive-jobs#interactive-job-manually-curate-exposures\">Manually Curate Exposures</a> due to outliers during histogram creation."
        },
        {
          "tag": "fixed",
          "description": "Fixed bugs in <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/ctf-estimation/job-gctf-wrapper\">Job: Gctf (Wrapper)</a> that caused local CTF refinement to fail."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug in Job: 3D Variability Analysis that prevented job from completing when number of components is set to 1."
        },
        {
          "tag": "fixed",
          "description": "The job dialog outputs tab now correctly displays the name of low-level results."
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that prevented correct download links for each output group of a job from being displayed within the sidebar details panel when a job is selected."
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that prevented multiple entities from being selected via the checkbox within the table view."
        },
        {
          "tag": "fixed",
          "description": "Scroll bars are no longer shown overtop of menus and dialogs in Safari."
        },
        {
          "tag": "fixed",
          "description": "Hostname no longer appears twice on instance management cards."
        },
        {
          "tag": "fixed",
          "description": "The sidebar action panel now collapses automatically after an option has been selected."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where a \"Not Found\" message would flash in the sidebar on load."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug that resulted in incorrect cropping of some PNG figures in the event log."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug in <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/simulations/job-simulate-data-beta\">Job: Simulate Data</a> that caused incorrect particles’ CTF parameters when “apply CTF” was disabled."
        },
        {
          "tag": "fixed",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/simulations/job-simulate-data-beta\">Job: Simulate Data</a> no longer requires the SSD cache"
        },
        {
          "tag": "fixed",
          "description": "Residual plots in <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/ctf-refinement/job-global-ctf-refinement\">Job: Global CTF Refinement</a> now properly account for phase ambiguities of 2π."
        },
        {
          "tag": "fixed",
          "description": "Fixed <code>KeyError</code> in <a href=\"https://guide.cryosparc.com/application-guide-v4.0+/interactive-jobs#interactive-job-inspect-particle-picks\">Inspect Particle Picks</a> caused by micrographs that contain no particle picks."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug in <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/3d-refinement/job-homogeneous-reconstruction-only\">Job: Homogeneous Reconstruction Only</a> with helical symmetry enforced and custom box size."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug in CryoSPARC Live that caused failed exposures to be double-counted as queued exposures."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where retrieving CryoSPARC Live sessions via the CLI would fail."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where slow database command response times would cause problems when configuring the database (e.g., updating CryoSPARC)."
        },
        {
          "tag": "fixed",
          "description": "Extensive Workflow now runs on a worker with 32GB of RAM."
        },
        {
          "tag": "fixed",
          "description": "Installation and update are now cancelled if Python dependency installation fails."
        },
        {
          "tag": "fixed",
          "description": "Prevent job heartbeat failures following multiple disconnects and reconnects."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug that raised a <code>JSONDecodeError</code> when calling <code>cryosparcm eventlog</code> on Job: 3D Variability Display."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug that caused <code>command_core</code>, <code>command_rtp</code> and <code>command_vis</code> logs to not be properly rotated."
        },
        {
          "tag": "fixed",
          "description": "Event logs for motion correction and extraction jobs now count movies/micrographs starting from one instead of starting from zero (e.g. “completed 20/20” instead of “completed 19/20”)."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug whereby ice thickness reported by Patch CTF (including in CryoSPARC Live) can be <code>NaN</code>."
        },
        {
          "tag": "fixed",
          "description": "Prevent file reading operations from failing on systems that incorrectly seek"
        },
        {
          "tag": "fixed",
          "description": "Fixed bug that caused extracted particle count not to be displayed on the details panel when viewing a Live session"
        }
      ]
    },
    {
      "tag": "v4.0.3",
      "date": "11/03/2022",
      "items": [
        {
          "tag": "fixed",
          "description": "Prevent interface from becoming unresponsive when viewing the homepage in cases where the web application cannot load external resources."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where changelog grid styling was causing items to overlap on Safari."
        },
        {
          "tag": "fixed",
          "description": "Prevented an issue where available CryoSPARC updates would not display on the homepage and navigation bar."
        }
      ]
    },
    {
      "tag": "v4.0.2",
      "date": "10/24/2022",
      "items": [
        {
          "tag": "new",
          "description": "When viewing jobs within a workspace there is an option to load all jobs at once rather than incrementally load as you scroll down the page."
        },
        {
          "tag": "new",
          "description": "New project-level option to set the <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/deep-picking/topaz\" target=\"_blank\">default path to a Topaz executable</a>. If set, all new Topaz jobs will automatically be populated with the specified project-level path."
        },
        {
          "tag": "new",
          "description": "Ability to use the spotlight to search for applicable jobs based on what project or workspace has been selected."
        },
        {
          "tag": "update",
          "description": "In <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/ctf-refinement/job-exposure-group-utilities\" target=\"_blank\">Job: Exposure Group Utilities</a>, when specifying a regular expression to split exposures or particles into exposure groups, all unmatched items will now be grouped together into a single, separate exposure group."
        },
        {
          "tag": "update",
          "description": "Added <code>--offline</code> and <code>--skip_workers</code> options to <code>cryosparcm errorreport</code><ul><li><code>--offline</code> skips retrieval of database statistics and worker instance information (intended for use when the CryoSPARC instance is not running)</li><li><code>--skip_workers</code> skips retrieval of worker instance information (intended for use when there are issues connecting to worker nodes)</li></ul>"
        },
        {
          "tag": "update",
          "description": "The first applicable lane is now pre-selected when queueing a job from the sidebar."
        },
        {
          "tag": "update",
          "description": "<code>systemd</code> setup is now simplified, and correctly enables CryoSPARC environment during <code>systemd</code> process startup. <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/optional-cryosparc-and-systemd\" target=\"_blank\">Read the guide here.</a>"
        },
        {
          "tag": "fixed",
          "description": "Resolved inconsistency between displayed values for accepted and rejected exposures (and threshold included and excluded) in the Curate Exposures job with specific threshold ranges set now match job outputs in all cases."
        },
        {
          "tag": "fixed",
          "description": "Inspect Picks in v4+ now rejects outlier particles based on absolute value of power score rather than percentile (matching the behaviour of v3.3)."
        },
        {
          "tag": "fixed",
          "description": "Local Motion correction no longer fails when some movies have zero particles or when some movies are corrupt."
        },
        {
          "tag": "fixed",
          "description": "Multiple targets within a single lane will now correctly display in the instance section of the manage dialog."
        },
        {
          "tag": "fixed",
          "description": "Volume viewer will now properly resize to the available space when adjusting sidebars and resizing the window."
        },
        {
          "tag": "fixed",
          "description": "Clicking checkboxes on the job table view will now correctly additively select them."
        },
        {
          "tag": "fixed",
          "description": "Event log downloads will no longer break in cases where ASCII characters are not included in the pdf font set."
        },
        {
          "tag": "fixed",
          "description": "Users can now log in with emails where the domain does not include a <code>.</code>"
        },
        {
          "tag": "fixed",
          "description": "The page will no longer automatically refresh when downloading files from the output actions menus in Firefox."
        },
        {
          "tag": "fixed",
          "description": "When viewing a volume in Firefox, the selecting the up/down arrows within the threshold control number input field will retain focus in the same way other browsers do."
        },
        {
          "tag": "fixed",
          "description": "Prevent Live session view from crashing if the session was started after being marked as completed."
        },
        {
          "tag": "fixed",
          "description": "When making picks on the micrograph in the Manual Picker job, the picks column will correctly update in the corresponding table row."
        },
        {
          "tag": "fixed",
          "description": "When attaching a project, workspaces no longer have an incorrect “Created By” field, but show the user that attached the project."
        },
        {
          "tag": "fixed",
          "description": "Project title is now a required field when creating projects from the command line."
        },
        {
          "tag": "fixed",
          "description": "Clear Intermediate Results no longer deletes non-final results from some refinement jobs when those results were used downstream."
        },
        {
          "tag": "fixed",
          "description": "Improved error messages and error checking in Topaz Train, Extract and Cross Validation jobs."
        },
        {
          "tag": "fixed",
          "description": "Topaz Denoise job now correctly allocates CPU resources when run without GPUs."
        },
        {
          "tag": "fixed",
          "description": "Installation test (<code>cryosparcm test install</code>) no longer fails if only clusters are connected to the instance."
        },
        {
          "tag": "fixed",
          "description": "Starting a Live session that was previously marked as “completed” no longer incorrectly pauses the session twice."
        },
        {
          "tag": "fixed",
          "description": "Queue dialog now correctly applies titles and descriptions that were set."
        },
        {
          "tag": "fixed",
          "description": "Queue dialog now has a tooltip to clarify the toggle to show or hide lanes with applicable targets based on job resource requirements."
        },
        {
          "tag": "fixed",
          "description": "Manually Curate Exposures job no longer fails for infinite or NaN CTF parameters, outputs a warning instead."
        },
        {
          "tag": "fixed",
          "description": "Ab-initio jobs no longer break display of job cards when there are many classes."
        },
        {
          "tag": "fixed",
          "description": "Inspect Picks job no longer fails during CTF calibration if exposures do not contain enough particle pick locations."
        },
        {
          "tag": "fixed",
          "description": "3D Classification no longer fails when Output Diagnostic Plots at every Interation is set to False."
        },
        {
          "tag": "fixed",
          "description": "When using cryosparcm cluster connect, the final connected cluster configuration is printed as the output of the command (returning to v3.3 behaviour)."
        },
        {
          "tag": "fixed",
          "description": "The range values for threshold sliders and input controls in the Curate Exposures job will now round display values to expected precision in all cases."
        },
        {
          "tag": "fixed",
          "description": "The reload browser shortcut will no longer manually reject selected exposure in the Curate Exposures job."
        },
        {
          "tag": "fixed",
          "description": "Table index cells in the Curate Exposures job now correctly update their colour when setting thresholds or manually rejecting/un-rejecting."
        },
        {
          "tag": "fixed",
          "description": "Filenames and other non-number values will now display correctly in the hover preview popovers in all interactive jobs."
        },
        {
          "tag": "fixed",
          "description": "Input fields in the Curate Exposures job can now be incremented using the arrow keys without changing the selected exposure in the micrographs table."
        }
      ]
    },
    {
      "tag": "v4.0.1+221017 (Patch)",
      "date": "10/17/2022",
      "items": [
        {
          "tag": "update",
          "description": "Over 10x speedup in job completion processes (check and passthrough outputs) for jobs with many output groups (e.g., 3D Classification with 20+ classes). Also speeds up “Mark as Completed” action for jobs."
        },
        {
          "tag": "update",
          "description": "Added more detailed logging message when manually taking over projects in an instance using <code>cryosparcm cli \"take_over_projects()\"</code>"
        },
        {
          "tag": "fixed",
          "description": "CryoSPARC environment no longer uses <code>LD_PRELOAD</code> to load <code>libtiff</code>, resolving issues where dependencies of <code>libtiff</code> (<code>libLerc</code> and <code>libstdc++</code>) would not be found on some OSes (e.g., CentOS 7)."
        }
      ]
    },
    {
      "tag": "v4.0.1",
      "date": "10/06/2022",
      "items": [
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/post-processing/job-deepemhancer-wrapper\">Job: DeepEMhancer (Wrapper)</a> now accepts a mask input for DeepEMhancer’s binary mask normalization mode."
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/interactive-jobs#interactive-job-manually-curate-exposures\">Job: Manually Curate Exposures</a> now outputs a warning if not all input particles exist in the input micrographs."
        },
        {
          "tag": "update",
          "description": "Tensorflow test is now disabled by default during <code>cryosparcm test workers</code>. To enable, specify <code>--test-tensorflow</code>. Read the full installation test guide <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-installation-testing-with-cryosparcm-test\">here</a>."
        },
        {
          "tag": "update",
          "description": "The <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/admin-panel#instance-logs\">instance tab</a> within the admin panel now loads primary system logs by default."
        },
        {
          "tag": "update",
          "description": "<code>cryosparcm errorreport</code> will now add the entire <code>app</code>, <code>app_api</code>, and <code>app_legacy</code> log files to the generated archive."
        },
        {
          "tag": "update",
          "description": "Updated the Windows shortcut for multi-selecting to use the <code>ctrl</code> key instead of the <code>meta</code> key."
        },
        {
          "tag": "update",
          "description": "Updated <code>command_core</code> request License-ID header check “Authentication failed” message with actionable suggestions."
        },
        {
          "tag": "fixed",
          "description": "Removed the <code>cryosparcw</code> executable path validation check by the master node when running <code>cryosparcm cluster connect</code>."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where running jobs could be marked as completed."
        },
        {
          "tag": "fixed",
          "description": "Prevent SSH and other command failures when system library versions don’t match embedded CryoSPARC libraries."
        },
        {
          "tag": "fixed",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/managing-data#project-data\">Project data management table</a> now shows projects shared with the user."
        },
        {
          "tag": "fixed",
          "description": "The tree view no longer resets its zoom level when creating or modifying jobs."
        },
        {
          "tag": "fixed",
          "description": "Resolved an issue in the job builder where scrolling was locked when hovering over an input box."
        },
        {
          "tag": "fixed",
          "description": "Items with many tags now display correctly in the sidebar details panel and on the cards."
        },
        {
          "tag": "fixed",
          "description": "The browse view no longer auto-scrolls to a newly created job."
        },
        {
          "tag": "fixed",
          "description": "Resolved issue where job cards were not properly displaying images and info tags."
        },
        {
          "tag": "fixed",
          "description": "Allow clearing long-running notifications from Notifications panel."
        },
        {
          "tag": "fixed",
          "description": "Fixed <code>cryosparcm fixdbport</code> error."
        }
      ]
    },
    {
      "tag": "v4.0.0",
      "date": "10/03/2022",
      "items": [
        {
          "tag": "new",
          "description": "All-new CryoSPARC interface designed for performance and productivity. Watch a <a target=\"_blank\" href=\"https://youtu.be/b9UD7_GGZas\">video walkthrough</a> of all the new features and read the <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/a-tour-of-the-cryosparc-interface\">comprehensive new guide</a>.<ul><li>→ <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/interactive-jobs\">Redesigned interactive jobs</a> (Inspect Picks, Exposure Curation, etc.) with significantly improved functionality and scalability. Easily handle large datasets (25K+ exposures)</li><li>→ <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/inspecting-data#volumes\">Integrated in-app 3D volume viewer</a> to inspect volume outputs from all job types</li><li>→ System for <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/using-the-cryosparc-interface/filters-and-sorting\">browsing and filtering</a> projects, workspaces, sessions and jobs</li><li>→ <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/using-the-cryosparc-interface/tags\">Tagging system</a> to easily organize and record details about projects and jobs</li><li>→ Multi-job selection and a new <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/inspecting-data#comparing-jobs\">job comparison view</a></li><li>→ <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/using-the-cryosparc-interface/browsing-the-cryosparc-instance#table-view\">Table view</a> for projects, workspaces, sessions and jobs with CSV download support</li><li>→ Two new ways to build jobs in addition to the drag-and-drop Job Builder: <ul><li>→ <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/creating-and-running-jobs#job-quick-actions\">Quick actions</a>: right click a job and run common next steps (e.g., Blob Picker → Inspect Picks)</li><li>→ <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/creating-and-running-jobs#job-cart\">Job cart</a>: select outputs directly from completed job cards to generate a filtered list of applicable jobs. Create and connect in a single click</li></ul></li><li>→ <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/downloading-and-exporting-data#downloading-the-job-event-log\">Download a PDF report</a> of each job including key stats and the event log</li><li>→ And much more! Be sure to watch the video and read the <a target=\"_blank\" href=\"https://guide.cryosparc.com/application-guide-v4.0+/a-tour-of-the-cryosparc-interface\">guide</a></li></ul>" 
        },
        {
          "tag": "new",
          "description": "CryoSPARC Live is now integrated as part of the CryoSPARC interface. Seamlessly transition from the primary interface into a Live session within the same browser tab: <a target=\"_blank\" href=\"https://guide.cryosparc.com/live/how-to-access-cryosparc-live\">How to Access CryoSPARC Live</a>." 
        },
        {
          "tag": "new",
          "description": "Improved algorithm and diagnostics in <a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/variability/job-3d-classification-beta\">3D Classification (BETA)</a>.<ul><li>→ <a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-3d-classification-beta\">New tutorial covering multiple datasets and use cases</a></li><li>→ FSC-based regularization to improve class quality and variety</li><li>→ Two new convergence criteria (class switches, density change)</li><li>→ Separate solvent and focus mask inputs</li><li>→ Option for hard classification</li><li>→ Better tuned and refactored default parameters</li><li>→Updated diagnostics, including: <ul><li>→ class \"flow\"</li><li>→ focus mask overlay</li><li>→ difference-from-consensus</li></ul></li></ul>" 
        },
        {
          "tag": "new",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/post-processing/job-deepemhancer-wrapper\">Wrapper for DeepEMhancer</a>, a deep learning model for automatic masking-like and sharpening-like post-processing." 
        },
        {
          "tag": "new",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/helical-reconstruction-beta/job-average-power-spectra\">“Average Power Spectra” Job</a> for averaging the power spectra of aligned, 2D-classified particles for helical symmetry exploration." 
        },
        {
          "tag": "new",
          "description": "Verify CryoSPARC installation integrity with <code>cryosparcm test install</code> and <code>cryosparcm test workers</code>. Read the Guide: <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-installation-testing-with-cryosparcm-test\">Installation Testing with <code>cryosparcm test</code>.</a>"
        },
        {
          "tag": "new",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-maintenance-mode-and-configurable-user-facing-messages\">“Maintenance Mode” setting</a> which may be toggled on/off to prevent queued jobs from running while allowing running jobs to complete." 
        },
        {
          "tag": "new",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-maintenance-mode-and-configurable-user-facing-messages#message-of-the-day\">Administrator-configurable login message and instance banner</a> to show notices to users." 
        },
        {
          "tag": "new",
          "description": "Improved project data management system, simplifying common projects tasks such as transfer and archival.<ul><li>→ <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-management-in-cryosparc-v4.0+\">New comprehensive Data Management Guide for v4.0</a></li><li>→ New project <strong>Attach</strong> and <strong>Detach</strong> actions to easily move projects between CryoSPARC instances</li><li>→ New project <strong>Archive</strong> and <strong>Unarchive</strong> actions simplify moving projects to archival storage or changing a project location on disk</li><li>→ For new projects, the generated project directory name is a hyphenated variant of the project title instead of <code>PXX</code>. A <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/environment-variables\">configurable prefix</a> may be added to project directory names for easy identification</li><li>→ Projects now use an <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-management-in-cryosparc-v4.0+#overview\">instance-lock</a> to prevent accidental corruption due to multiple CryoSPARC instances modifying the same project simultaneously</li><li>→ Projects and Jobs no longer prefix output files with <code>cryosparc_PXX_</code> on disk, since project numeric identifiers may change when detaching and re-attaching a project. The prefix is added when <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-data-management-in-cryosparc-v4.0+#overview\">downloading files through the browser instead</a></li></ul>" 
        },
        {
          "tag": "new",
          "description": "Improved <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/hardware-and-system-requirements#database-and-command-api-security\">CryoSPARC database and API security</a> with authenticated access control." 
        },
        {
          "tag": "new",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-download-error-reports\">Error reporting tools</a> to simplify troubleshooting.<ul><li>→ Download a job error report bundle from the Event Log tab of the Job Dialog</li><li>→ Download a system error report bundle from the Instance Logs tab of the Admin Panel</li><li>→ From the CLI, the <code>cryosparcm errorreport</code> <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/cryosparcm#cryosparcm-errorreport\">function</a> generates a system level error report bundle when the web-app is inaccessible</li></ul>" 
        },
        {
          "tag": "new",
          "description": "<code>cryosparcm filterlog</code> <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/cryosparcm#cryosparcm-filterlog-less-than-process-greater-than\">command</a> filters logs by days, date, name, function, and level and adopts a more consistent logging format including timestamps at the beginning of logs lines." 
        },
        {
          "tag": "new",
          "description": "<code>cryosparcm cluster validate</code> <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/cryosparcm#cryosparcm-cluster\">function</a> validates cluster configurations during installation." 
        },
        {
          "tag": "new",
          "description": "View improved database backup functionality with recent activity records. Available in Instance Information → Backups." 
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/3d-refinement/job-non-uniform-refinement-new\">Job: Non-Uniform Refinement</a> now supports optional Ewald Sphere Correction via an advanced parameter switch."
        },
        {
          "tag": "update",
          "description": "All jobs which process masks and volumes now accept masks sampled at different box and/or pixel sizes relative to the volume, which are internally resampled when appropriate."
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/local-refinement\">Local Refinement and Particle Subtraction</a> now issue a warning if binary masks are used."
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-picking/job-extract-from-micrographs\">Job: Extract from Micrographs</a> now supports extracting and downsampling to two different box sizes via Fourier crop to provide smaller particles for early classification and reconstruction steps."
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/ctf-refinement/job-global-ctf-refinement\">Job: Global CTF Refinement</a> default parameters no longer fit fourth order aberrations (Spherical Aberration and Tetrafoil) unless specifically enabled."
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/motion-correction/job-local-motion-correction\">Job: Local Motion Correction</a> now includes an option to downsample particles via Fourier crop after correcting per-particle motion."
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/3d-reconstruction/job-ab-initio-reconstruction\">Job: Ab-initio Reconstruction</a> now includes an unused particles output when not all particles were used for reconstruction in the single-class case."
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/ctf-estimation/job-gctf-wrapper\">Job: Gctf </a> is now a “Legacy” job. Turn on “Show legacy jobs” in the job builder to unhide the job. Gctf also includes a CUDA libraries parameter to override CUDA version for compatibility with available Gctf binaries."
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-curation/job-2d-classification\">Job: 2D Classification</a> may now run <strong>without</strong> CTF correction by turning off the <code>Do CTF correction</code> parameter, which may be useful for negative stain data."
        },
        {
          "tag": "update",
          "description": "Improvements to CryoSPARC Live interface: <ul><li>→ In the Live Overview tab, enter rejection thresholds with free-form numeric input</li><li>→ Display particle picks in more distinguishable colours</li><li>→ Volume viewer includes action buttons for resetting and zooming</li></ul>"
        },
        {
          "tag": "update",
          "description": "Added <code>Maximum number of local maxima to consider</code> picking parameter to Blob Picker and Template Picker in CryoSPARC Live."
        },
        {
          "tag": "update",
          "description": "<a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/guide-cluster-integration-validation\">Improved cluster job status updates</a> before a job is launched for better visibility. "
        },
        {
          "tag": "update",
          "description": "Silent password input prompt in <code>cryosparcm</code> <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/cryosparcm\">commands</a>; will not be printed in the command output."
        },
        {
          "tag": "update",
          "description": "Added <code>cryosparcm cli</code> functions <code>get_project_symlinks</code> and <code>get_job_symlinks</code> to find moved symlinks in jobs. <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/software-system-guides/tutorial-migrating-your-cryosparc-instance\">Read the guide for more details</a>."
        },
        {
          "tag": "update",
          "description": "Reduced excessive verbiage in log files for certain job types that process particles."
        },
        {
          "tag": "update",
          "description": "Added <code>CRYOSPARC_DB_CONNECTION_TIMEOUT_MS</code> <a target=\"_blank\" href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/environment-variables#cryosparc_master-config.sh\">configurable environment variable</a> for adjusting connection timeout during database startup."
        },
        {
          "tag": "update",
          "description": "Improved libcufft library initialization when only major version files (e.g., <code>libcufft.so.10</code>) are available."
        },
        {
          "tag": "update",
          "description": "Updated Extensive Workflow to issue warning rather than timeout error caused by long-running jobs."
        },
        {
          "tag": "update",
          "description": "Previous v3.3 web application (now running at <code>BASE_PORT + 7</code>) does not start up by default. To start it, run <code>cryosparcm start app_legacy</code>."
        },
        {
          "tag": "update",
          "description": "CryoSPARC Live (<code>liveapp</code> service) is integrated into the main web application interface running at <code>BASE_PORT</code> and is no longer available at <code>BASE_PORT + 6</code>."
        },
        {
          "tag": "update",
          "description": "Automatically update session data sizes when a session is paused or completed for improved data management."
        },
        {
          "tag": "fixed",
          "description": "Exposure Sets Tools no longer fails to intersect on <code>path</code> if <code>mscope_params</code> result slot is connected to both <code>Exposures_A</code> and <code>Exposures_B</code> input groups."
        },
        {
          "tag": "fixed",
          "description": "Heterogeneous Refinement jobs no longer fails when <code>Force hard classification</code> is turned on and some classes become empty."
        },
        {
          "tag": "fixed",
          "description": "Additional corrupt exposure error handling for Full-Frame Motion Correction, Patch Motion Correction and Patch CTF jobs."
        },
        {
          "tag": "fixed",
          "description": "Scheduler no longer fails for all queued jobs when a single queued job fails to run."
        },
        {
          "tag": "fixed",
          "description": "<code>cryosparcm restore</code> no longer fails when restoring against an empty database directory."
        },
        {
          "tag": "fixed",
          "description": "Show database connection error message in job log if one occurs during job startup."
        },
        {
          "tag": "fixed",
          "description": "<code>cryosparcm restart</code> no longer restarts all services if an incorrect service name is provided as an argument."
        },
        {
          "tag": "fixed",
          "description": "Long running background processes in one project no longer block actions across all projects in the system."
        },
        {
          "tag": "fixed",
          "description": "Fixed <code>phase_shift</code> attribute in CryoSPARC Live overview plot that was previously displayed as radians instead of degrees with an incorrect label."
        },
        {
          "tag": "fixed",
          "description": "FFTs on CPU no longer use a minimum of 8 threads that was causing contention on some systems."
        }
      ]
    },
    {
      "tag": "v3.3.2",
      "date": "08/24/2022",
      "items": [
        {
          "tag": "new",
          "description": "New <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/variability/job-3d-classification-beta\">3D Classification <span class='tag tag--beta'>BETA</span> job</a> can be used to quickly classify particles into many 3D classes, without re-alignment of particle poses and shifts. Sort out heterogeneity from million+ particle datasets with 100+ classes. Read a tutorial <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-3d-classification-beta\">here</a>" 
        },
        {
          "tag": "new",
          "description": "New ruler and scale bar allow for <a href=\"https://guide.cryosparc.com/live/ui-overview#exposure-viewer-ruler-and-scale-bar\">interactively determining the size of a particle in cryoSPARC Live</a>" 
        },
        {
          "tag": "new",
          "description": "<strong>New Blob Picker Tuner</strong> determines optimal blob picker parameters from a minimal set of user-selected manual picks. Tunes blob size, shape, and picker score thresholds automatically. Read a tutorial <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-blob-picker-tuner\">here</a>." 
        },
        {
          "tag": "new",
          "description": "A technique for <strong>Ewald Sphere Correction</strong> implemented in <strong>homogeneous refinement and reconstruction jobs</strong> allows for higher resolution reconstructions of larger proteins. Read a tutorial <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-ewald-sphere-correction\">here</a>. The new technique corrects for the Ewald Sphere during pose alignment and during back-projection, and also correctly estimates/refines <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-ctf-refinement#ewald-sphere-correction\">higher-order CTF aberrations (HOA) while accounting for the Ewald Sphere</a>." 
        },
        {
          "tag": "new",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-ctf-refinement#global-ctf-refinement-per-exposure-group-beam-tilt-trefoil-spherical-aberration-tetrafoil-and-anisot\"><strong>Anisotropic magnification</strong> can now be estimated during CTF refinement</a>, and is corrected for in Refinement, Reconstruction, 3D Classification, and 3D Variability jobs." 
        },
        {
          "tag": "new",
          "description": "<strong>Substantial speed and memory improvements to FSC calculations</strong> in all job types, speeding up FSC calculation by over 10x, and providing an overall <strong>speedup of up to 20% for homogeneous refinements</strong>. A benchmark refinement of 100,000 Ribosome particles at 360 pixel box size (EMPIAR-10028) takes only 5.2 minutes on a single NVIDIA V100 GPU." 
        },
        {
          "tag": "new",
          "description": "Substantially improved TIFF read performance for some filesystems. <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/environment-variables#cryosparc_worker-config.sh\">To enable, add <code>export CRYOSPARC_TIFF_IO_SHM=true</code> to <code>cryosparc_worker/config.sh</code>.</a>" 
        },
        {
          "tag": "new",
          "description": "<code>cryosparcm log</code> provides an improved log format and new filter flags." 
        },
        {
          "tag": "new",
          "description": "Import 3D Volumes now supports importing <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/import/job-import-3d-volumes\">multiple volumes, including importing entries directly from EMDB</a>." 
        },
        {
          "tag": "new",
          "description": "FSC Plots are now accompanied by an <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-emdb-friendly-xml-file-for-fsc-plots\">EMDB-friendly XML file</a>." 
        },
        {
          "tag": "new",
          "description": "<strong>Improved performance in large projects</strong>. Faster Tree View updates and instantaneous input drag-and-drop connections." 
        },
        {
          "tag": "new",
          "description": "New <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-volume-alignment-tools\">Volume Alignment Tools utility</a>, supporting re-centering and symmetry alignment of 3D volumes." 
        },
        {
          "tag": "new",
          "description": "Specify path of directory containing preprocessed micrographs for Topaz Train and Extract [Patch 211214]" 
        },
        {
          "tag": "new",
          "description": "New 3D Classification advanced parameter \"Output data after every full iter\" to enable data outputs (volumes, particles, volume series) after every full iteration [Patch 211214]" 
        },
        {
          "tag": "new",
          "description": "<code>cryosparcm cli \"update_parents_and_children_for_project(project_uid)\"</code> function to fix broken tree view input/output connections in previously-imported projects [Patch 220215]" 
        },
        {
          "tag": "new",
          "description": "Exposure/Particle Sets Tool option to ignore leading UIDs when comparing paths for intersection mode [Patch 220215]" 
        },
        {
          "tag": "new",
          "description": "Support for reading <code>.mrc</code> files containing float16 data (datatype code 12) [Patch 220215]" 
        },
        {
          "tag": "new",
          "description": "Option to remove all duplicates in Remove Duplicate Particles job [Patch 220315]" 
        },
        {
          "tag": "new",
          "description": "Pre-processing jobs no longer fail immediately when a child process encounters a segmentation fault [Patch 220518]" 
        },
        {
          "tag": "new",
          "description": "Patch Motion jobs now use an improved IO library, providing substantial speedups on some cluster file systems [Patch 220518]" 
        },
        {
          "tag": "new",
          "description": "Blob Picker Tuner job now reports progress during optimization [Patch 220518]" 
        },
        {
          "tag": "new",
          "description": "Validation (FSC) job now takes in an optional <code>Override Pixel Size (Å)</code> parameter to allow adjusting the final pixel size and resolution estimate if incorrect pixel size was specified during processing [Patch 220518]" 
        },
        {
          "tag": "new",
          "description": "Align 3D job now takes in particle stack(s) and rotates/shifts the alignments of the particles to match the rotation and shift applied to the volumes during 3D alignment [Patch 220518]" 
        },
        {
          "tag": "new",
          "description": "Project deletion (and other long running actions) are now decoupled from instance-wide locks, allowing a cryoSPARC instance to continue to perform unrelated actions while a deletion is ongoing [Patch 220518]" 
        },
        {
          "tag": "new",
          "description": "<em>Patch Motion Correction</em> now supports Fourier crop ratios of 1/8 and 1/16 [Patch 220824]" 
        },
        {
          "tag": "new",
          "description": "<em>3D Variability Display</em> (Cluster Mode) now has a volume series output [Patch 220824]" 
        },
        {
          "tag": "new",
          "description": "Exposure processing priority in a cryoSPARC Live session can now be modified. For more information, see: <a href=\"https://guide.cryosparc.com/live/live-jobs-and-session-level-functions#session-level-functions\">the Guide page on Session-level functions</a> [Patch 220824]" 
        },
        {
          "tag": "new",
          "description": "Cache log now outputs average speed (MB/s) and estimated time to completion [Patch 220824]" 
        },
        {
          "tag": "new",
          "description": "<code>cryosparcw call &lt;cmd&gt;</code> enables execution of a command in a transient cryoSPARC worker environment [Patch 220824]" 
        },
        {
          "tag": "new",
          "description": "<code>cryosparcm eventlog &lt;project_uid&gt; &lt;job_uid&gt;</code> prints all text from a job's overview tab to stdout [Patch 220824]" 
        },
        {
          "tag": "update",
          "description": "3DVA Display job can now output particle sets corresponding to intermediate states." 
        },
        {
          "tag": "update",
          "description": "Added option to select a subset of variability components in 3DVA Display job." 
        },
        {
          "tag": "update",
          "description": "Volume Tools job now accepts a custom output filename. The default output name has also been updated to be more informative." 
        },
        {
          "tag": "update",
          "description": "Display path of job working directory at the top of the event log."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-ssd-particle-caching-in-cryosparc#increase-or-reduce-cache-files-lifetime\">Automatically delete SSD cache files</a> that have not been used in more than 30 days during job caching steps."
        },
        {
          "tag": "update",
          "description": "<a href=\"https://guide.cryosparc.com/setup-configuration-and-management/how-to-download-install-and-configure/accessing-cryosparc#appendix-d-custom-ssl-certificate-authority-bundle\">Specify path to custom Certificate Authority bundle for external SSL requests</a>."
        },
        {
          "tag": "update",
          "description": "CLI endpoint to safely update a project's directory (<code>update_project_directory(project_uid, new_project_dir)</code>)."
        },
        {
          "tag": "update",
          "description": "Ability to use common path field (vs. UID) to intersect or split in Exposure Sets Tool and Particle Sets Tool."
        },
        {
          "tag": "update",
          "description": "CryoSPARC Live Data Management now supports <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/cryosparc-live-session-data-management#state-change-hooks\">executing a script upon a datatype's state change</a>. Add <code>export CRYOSPARC_LIVE_DATA_MANAGEMENT_SCRIPT_ENABLE=true</code> and <code>export CRYOSPARC_LIVE_DATA_MANAGEMENT_SCRIPT_PATH=/path/to/script.sh</code> in cryosparc_master/config.sh to enable this feature."
        },
        {
          "tag": "update",
          "description": "Particle subtraction now respects refined higher-order aberrations."
        },
        {
          "tag": "update",
          "description": "Added FSC mask auto-tightening to the standalone Validation (FSC) job."
        },
        {
          "tag": "update",
          "description": "Extraction Box Size in Local Motion Correction now uses the input particle box size by default."
        },
        {
          "tag": "update",
          "description": "3D Classification volume outputs are now unmasked, fixing downstream refinements [Patch 211214]"
        },
        {
          "tag": "update",
          "description": "New printout for each 3D Classification iteration to clearly specify O-EM/F-EM iterations left [Patch 211214]"
        },
        {
          "tag": "update",
          "description": "3D Variability Display has more informative <code>.mrc</code> volume file names (simple/intermediates mode) [Patch 220215]"
        },
        {
          "tag": "update",
          "description": "Improved error details when a cli method call fails [Patch 220315]"
        },
        {
          "tag": "update",
          "description": "Improved logging in Extract From Micrographs (GPU), now shows number of particles rejected near edges of each micrograph [Patch 220315]"
        },
        {
          "tag": "update",
          "description": "Improved EER read performance for some file systems [Patch 220315]"
        },
        {
          "tag": "update",
          "description": "CryoSPARC Live Session Data Management: All datatype sizes are now updated when a session is “paused” or “completed”"
        },
        {
          "tag": "update",
          "description": "Helpful error messages when calling cryosparcm/cli functions with incorrect arguments"
        },
        {
          "tag": "update",
          "description": "Check for Corrupt Particles job now has an option to check for NaN values in the particle data files to test for data corruption on disk"
        },
        {
          "tag": "update",
          "description": "Extraction jobs now have an option to force re-extraction of CTF values for each particle from the input micrographs"
        },
        {
          "tag": "update",
          "description": "Outputs in the Sharpening Tools job are now separated into two output groups and can be directly connected to downstream Volume Tools jobs [Patch 220518]"
        },
        {
          "tag": "update",
          "description": "Warnings in the Import Particles job's Overview tab are now more visible when fields are missing in the imported metadata files [Patch 220518]"
        },
        {
          "tag": "update",
          "description": "Warnings in the Check For Corrupt Particles job's Overview tab are now more visible when corrupt files are found [Patch 220518]"
        },
        {
          "tag": "update",
          "description": "The Local Refinement (NEW!) job now explicitly requires an input mask [Patch 220518]"
        },
        {
          "tag": "update",
          "description": "Blob picker output images now show more contrast for negative stain data [Patch 220518]"
        },
        {
          "tag": "update",
          "description": "Further improvements to error messages when problems are encountered while reading particles or micrographs [Patch 220824]"
        },
        {
          "tag": "update",
          "description": "Volume series outputs in <em>3D Variability Display</em> no longer require a <code>zip</code> system dependency [Patch 220824]"
        },
        {
          "tag": "update",
          "description": "<em>3D Variability Display</em> (Cluster Mode) 1D histogram now includes a legend [Patch 220824]"
        },
        {
          "tag": "update",
          "description": "Warning if all three dimensions of the input data for <em>Import Templates</em> match, which suggests that a cubic (3D) volume has been input instead of a stack of 2D templates [Patch 220824]"
        },
        {
          "tag": "update",
          "description": "Summary of rejected particle counts and reasons for rejection in <em>Extract From Micrographs</em> jobs [Patch 220824]"
        },
        {
          "tag": "update",
          "description": "Jobs now fail if they require more SSD cache space than the total available space or quota [Patch 220824]"
        },
        {
          "tag": "update",
          "description": "If available, show MRC file name in job log when file cannot be read [Patch 220824]"
        },
        {
          "tag": "update",
          "description": "Improved error formatting when running functions via <code>cryosparcm cli</code> [Patch 220824]"
        },
        {
          "tag": "fixed",
          "description": "Fixed contrast issues in Inspect Picks, Manual Picker and Curate Exposures jobs when viewing a micrograph that wasn't motion-corrected in cryoSPARC."
        },
        {
          "tag": "fixed",
          "description": "Fixed issue in Volume Tools that caused ringing artefacts when downsampling masks."
        },
        {
          "tag": "fixed",
          "description": "Added resolution parameter to low-pass filter templates in Blob and Template Picker jobs."
        },
        {
          "tag": "fixed",
          "description": "Fixed <code>libtiff</code> error when running the worker on a read-only file system."
        },
        {
          "tag": "fixed",
          "description": "Corrected volume flip in cryoSPARC Live 3D volume web viewer."
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused stale notifications to persist after restarting cryoSPARC."
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug where it was not possible to queue a job into a new workspace."
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug where topics from the cryoSPARC Discussion Forum would not display on the dashboard."
        },
        {
          "tag": "fixed",
          "description": "Updated the job queuing interface to clarify which nodes certain jobs are launched on. Interactive jobs are always launched on the master node. Import jobs are launched on the master node unless <code>CRYOSPARC_DISABLE_IMPORT_ON_MASTER</code> is set to true, in which case import jobs can run on any lane/node selected. All other job types launch on a lane/node the user selects."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug where symmetry alignment during refinement often aligned volumes incorrectly if they were already aligned."
        },
        {
          "tag": "fixed",
          "description": "Fixed bug where volumes are improperly aligned to symmetry axes in helical refinement."
        },
        {
          "tag": "fixed",
          "description": "Fixed an error during startup that occurs when an instance has less than 1000 notifications [v3.3.1]"
        },
        {
          "tag": "fixed",
          "description": "Fixed plotting error during (legacy) local refinement [Patch 211202]"
        },
        {
          "tag": "fixed",
          "description": "Use correct license check SSL certificate configuration when running cryoSPARC in insecure mode [Patch 211214]"
        },
        {
          "tag": "fixed",
          "description": "Fixed Blob Tuner Error when Blob picker finds no particles [Patch 211214]"
        },
        {
          "tag": "fixed",
          "description": "Passthrough GS split in 3D Classification [Patch 211214]"
        },
        {
          "tag": "fixed",
          "description": "Check for empty splits in Homogenous Reconstruction job [Patch 211214]"
        },
        {
          "tag": "fixed",
          "description": "Prevent crash of Rigid Motion Correction, Local Motion Correction and Extract Particles jobs when encountering corrupt exposures. The jobs now continue after any error in a single exposure, and output all incomplete exposures as a separate output [Patch 220118]"
        },
        {
          "tag": "fixed",
          "description": "Set <code>class</code> field for 3D Classification particle outputs (fixes bug with downstream particles and <code>csparc2star.py</code>) [Patch 220118]"
        },
        {
          "tag": "fixed",
          "description": "In 3D Classification, viewing direction distribution plots work with empty classes [Patch 220118]"
        },
        {
          "tag": "fixed",
          "description": "In Topaz Extract, use provided preprocessed directory when no pre-trained model is specified [Patch 220118]"
        },
        {
          "tag": "fixed",
          "description": "Importing projects retain job tree view input/output connections [Patch 220215]"
        },
        {
          "tag": "fixed",
          "description": "Symmetry Search Utility no longer fails with KeyError [Patch 220215]"
        },
        {
          "tag": "fixed",
          "description": "Topaz Train imported jobs no longer reference preprocessed micrographs directory from old project [Patch 220215]"
        },
        {
          "tag": "fixed",
          "description": "Remove unused “Number of GPUs to parallelize” parameter from Local Motion Correction (non-multi) [Patch 220215]"
        },
        {
          "tag": "fixed",
          "description": "Include 1st and 99th percentile particles in Inspect Picks threshold range [Patch 220315]"
        },
        {
          "tag": "fixed",
          "description": "Use high-order aberration information in ResLog job [Patch 220315]"
        },
        {
          "tag": "fixed",
          "description": "Local Motion does not fail when some movies do not include particles [Patch 220315]"
        },
        {
          "tag": "fixed",
          "description": "Filter correct component reaction coordinates in 3D Variability Display job [Patch 220315]"
        },
        {
          "tag": "fixed",
          "description": "Prevent error in Local Motion Correction when zero-shift frame is set [Patch 220315]"
        },
        {
          "tag": "fixed",
          "description": "Improve multithreaded performance for some operations [Patch 220315]"
        },
        {
          "tag": "fixed",
          "description": "Local motion no longer fails when zero shift frame is not set by previous motion correction job"
        },
        {
          "tag": "fixed",
          "description": "AttributeError raised in Filament Tracer job when only one particle pick is found on a given filament"
        },
        {
          "tag": "fixed",
          "description": "GPU FSC calculation in Refinement jobs raises AssertionError when used with box sizes under 84"
        },
        {
          "tag": "fixed",
          "description": "Topaz job now correctly fails when topaz subprocess fails"
        },
        {
          "tag": "fixed",
          "description": "Micrograph contrast in Manual Picker job is sometimes set to a value that clips the image"
        },
        {
          "tag": "fixed",
          "description": "Support for 3DVA Display clustering with one component"
        },
        {
          "tag": "fixed",
          "description": "Return HTTP 404 response when GridFS image requests are not found"
        },
        {
          "tag": "fixed",
          "description": "Allow clearing Extract Particles jobs created before the previous patch [Patch 220518]"
        },
        {
          "tag": "fixed",
          "description": "Prevent Motion Correction job failure due to low-level memory error from corrupt TIFF files [Patch 220518]"
        },
        {
          "tag": "fixed",
          "description": "Corrected stdout/stderr redirect options in <code>cryosparcm cluster example</code> scripts [Patch 220518]"
        },
        {
          "tag": "fixed",
          "description": "Manual picker and Inspect picks jobs no longer overly downsample rectangular (K3) images [Patch 220518]"
        },
        {
          "tag": "fixed",
          "description": "Job status timestamps are now correctly cleared when a job is cleared [Patch 220518]"
        },
        {
          "tag": "fixed",
          "description": "Patch CTF job no longer fails with data from spherical aberration-corrected microscopes [Patch 220518]"
        },
        {
          "tag": "fixed",
          "description": "<em>Local Resolution Estimation</em> job now reads the mask from the “Static Mask” input group [Patch 220824]"
        },
        {
          "tag": "fixed",
          "description": "<code>.mrc.bz2</code> files with an MRC extended header now load correctly [Patch 220824]"
        },
        {
          "tag": "fixed",
          "description": "<code>workspaces.json</code> now correctly updated when a cryoSPARC Live session is running [Patch 220824]"
        },
        {
          "tag": "fixed",
          "description": "Prevent SSD cache system failure when file size is missing in cache files database collection [Patch 220824]"
        }
      ]
    },
    {
      "tag": "v3.2.0",
      "date": "03/29/2021",
      "items": [
        {
          "tag": "new",
          "description": "Added option for sorting jobs by date and title. Projects and workspaces can be sorted by title as well" 
        },
        {
          "tag": "new",
          "description": "Check Particles job for verifying data integrity of particle stacks [Patch 210511]" 
        },
        {
          "tag": "new",
          "description": "Computational batch size parameter in Heterogeneous Refinement job [Patch 210511]" 
        },
        {
          "tag": "new",
          "description": "<code>cryosparcm changeport</code> command and related utilities for changing the base port [Patch 210601]" 
        },
        {
          "tag": "new",
          "description": "New utility <code>cryosparcm licensestatus</code> to verify if a license is valid [Patch 210629]" 
        },
        {
          "tag": "new",
          "description": "<code>cryosparcm status</code> now reports patch version [Patch 210713]" 
        },
        {
          "tag": "new",
          "description": "Set environment variable <code>CRYOSPARC_SSD_CACHE_LIFETIME_DAYS</code> in <code>cryosparc_master/config.sh</code> to auto-remove cache files older than the given number of days [Patch 210803]" 
        },
        {
          "tag": "new",
          "description": "New TIFF reading strategy for improved performance on network file systems such as GPFS and Lustre. To enable, add export <code>CRYOSPARC_TIFF_IO_SHM=true</code> to <code>cryosparc_worker/config.sh</code> [Patch 210817]" 
        },
        {
          "tag": "new",
          "description": "\"Reassign Particles to Micrographs\" job to reassign particles to their associated micrographs [Patch 210831]"
        },
        {
          "tag": "new",
          "description": "Full Prefix/suffix cutting parameters for matching between input movies and micrographs in \"Import Micrographs\" job [Patch 210831]"
        },
        {
          "tag": "new",
          "description": "Extend master/worker communication timeout with <code>CRYOSPARC_CLIENT_TIMEOUT</code> environment variable [Patch 210831]"
        },
        {
          "tag": "new",
          "description": "Download EMDB-friendly XML files from FSC figures [Patch 211012]"
        },
        {
          "tag": "update",
          "description": "Substantially improved performance in iterative particle-processing jobs (2D Classification, Refinement) when particles are stored on some types of filesystems (including FSx for Lustre), resolving cases where some users found that jobs run in v3.1 were slower than in v2.15"
        },
        {
          "tag": "update",
          "description": "Deep Particle Picking jobs (Deep Picker Train, Deep Picker Inference) now require CUDA Toolkit 11+"
        },
        {
          "tag": "update",
          "description": "The 'Metadata' tab within the job preview dialog is more performant and features expandable sections and colour highlighting based on data type"
        },
        {
          "tag": "update",
          "description": "Import Particles no longer ignores the <code>rlnImagePixelSize</code> column while trying to import a particle <code>.star</code> file"
        },
        {
          "tag": "update",
          "description": "CryoSPARC processes are now less likely to become orphaned due to more robust supervisor management configuration"
        },
        {
          "tag": "update",
          "description": "Removed unused cuBLAS dependency that caused multiple GPU contexts on all GPUs in a system to be created even when using only a single GPU"
        },
        {
          "tag": "update",
          "description": "GPU status info is now updated when a worker is connected for the first time, or when a worker connection is updated"
        },
        {
          "tag": "update",
          "description": "New option to work around bug in CUDA on CentOS 7 that causes <code>cuMemHostAlloc failed</code> errors in multiple job types. To engage this, add <code>export CRYOSPARC_NO_PAGELOCK=true</code> to the <code>cryosparc_worker/config.sh</code> file."
        },
        {
          "tag": "update",
          "description": "Patch CTF Estimation no longer fails when encountering an error on a specific micrograph. Failed micrographs are outputted to a separate group if exceptions are encountered and processing continues."
        },
        {
          "tag": "update",
          "description": "Local Resolution job now prints local resolution statistics (minimum, median, maximum, 25th percentile, 75th percentile) in job event log [Patch 210401]"
        },
        {
          "tag": "update",
          "description": "CryoSPARC Live Data Management now supports executing a script upon a datatype's state change. Add <code>export CRYOSPARC_LIVE_DATA_MANAGEMENT_SCRIPT_ENABLE=true</code> and <code>export CRYOSPARC_LIVE_DATA_MANAGEMENT_SCRIPT_PATH=/path/to/script.sh</code> in <code>cryosparc_master/config.sh</code> to enable this feature [Patch 210401]"
        },
        {
          "tag": "fixed",
          "description": "Issue in Patch Motion that causes dose weighting to be incorrectly applied in some cases. This was caused by the introduction of variable-dose support in v3.1."
        },
        {
          "tag": "fixed",
          "description": "Patch CTF Estimation fails with <code>IndexError: index 0 is out of bounds for axis 0 with size 0</code>"
        },
        {
          "tag": "fixed",
          "description": "Patch CTF Estimation fails with <code>ValueError: Axis limits cannot be NaN or Inf</code>"
        },
        {
          "tag": "fixed",
          "description": "Patch CTF Estimation sometimes reports underestimated CTF fit resolution in cryoSPARC Live, in cases where the correlation between the fit and the actual signal is very poor at low resolutions"
        },
        {
          "tag": "fixed",
          "description": "Issue that can cause exposure groups set up at import to be lost during processing, specifically through wrapper jobs for GCTF or CTFFIND"
        },
        {
          "tag": "fixed",
          "description": "Issue where Deep Picker Train job would fail reporting that there are no training particles on any micrographs"
        },
        {
          "tag": "fixed",
          "description": "Topaz wrapper TypeError during negative stain processing: can't multiple sequence by non-int of type <code>numpy.float32</code>"
        },
        {
          "tag": "fixed",
          "description": "Issue causing <code>IndexError</code> in wrapper for Motioncor2"
        },
        {
          "tag": "fixed",
          "description": "Issue in particle simulator job where all particles would be modulated by the same CTF regardless of specified input CTF parameters"
        },
        {
          "tag": "fixed",
          "description": "Issue in <code>cryosparcm cli delete_user</code> command that prevented an admin user from being authenticated"
        },
        {
          "tag": "fixed",
          "description": "Issue in Extract From Micrographs (CPU) job requiring a GPU dependency, causing it to fail on CPU-only workstations"
        },
        {
          "tag": "fixed",
          "description": "Import Job/Import Result Group fails with <code>Unable to find data referenced by cs files</code> when importing a <code>mscope_params</code> result group due to empty fields [Patch 210401]"
        },
        {
          "tag": "fixed",
          "description": "Local Motion correction with EER data [Patch 210413]"
        },
        {
          "tag": "fixed",
          "description": "Jobs no longer wait on cache forever after the cache is unlocked in other jobs [Patch 210413]"
        },
        {
          "tag": "fixed",
          "description": "Restore missing \"Use Class Weights\" parameter in Deep Picker Train job [Patch 210413]"
        },
        {
          "tag": "fixed",
          "description": "Prevent <code>LD_PRELOAD</code> warning when launching cluster jobs [Patch 210413]"
        },
        {
          "tag": "fixed",
          "description": "<code>ValueError</code> during 3DFSC job volume output stage [Patch 210511]"
        },
        {
          "tag": "fixed",
          "description": "Empty workspaces after importing project [Patch 210511]"
        },
        {
          "tag": "fixed",
          "description": "Prevent error when extracting particles generated by Topaz [Patch 210601]"
        },
        {
          "tag": "fixed",
          "description": "Prevent error in Deep Inference job during plotting [Patch 210601]"
        },
        {
          "tag": "fixed",
          "description": "Improved error messages when reading invalid exposures or particle stacks [Patch 210601]"
        },
        {
          "tag": "fixed",
          "description": "Prevent numeric initialization error in Ab-Initio Reconstruction jobs for some systems [Patch 210615]"
        },
        {
          "tag": "fixed",
          "description": "Prevent numeric error in Inspect Picks job [Patch 210615]"
        },
        {
          "tag": "fixed",
          "description": "Statistic showing the total number of particles being processed by Ab-Initio Reconstruction job in cryoSPARC Live sometimes isn't updated [Patch 210629]"
        },
        {
          "tag": "fixed",
          "description": "Prevent <code>mrc_readmic (1) 447: Invalid argument</code> errors that occur after extracting particles in a pipeline where micrographs were imported multiple times [Patch 210629]"
        },
        {
          "tag": "fixed",
          "description": "Prevent I/O exceptions from terminating the cryoSPARC Live Worker while processing exposures [Patch 210713]"
        },
        {
          "tag": "fixed",
          "description": "Allow shell operators during cluster job submission, enabling redirections required for LSF Clusters [Patch 210713]"
        },
        {
          "tag": "fixed",
          "description": "Exception handling for Clear Intermediate Results [Patch 210831]"
        },
        {
          "tag": "fixed",
          "description": "Corrected <code>cryosparcm cluster example</code> JSON output [Patch 210831]"
        },
        {
          "tag": "fixed",
          "description": "Consistent exposure/particle matching in Deep Picker [Patch 211012]"
        },
        {
          "tag": "fixed",
          "description": "Prevent startup error when system does not report CPU frequency [Patch 211012]"
        },
        {
          "tag": "fixed",
          "description": "Prevent loss reporting error during Topaz jobs [Patch 211012]"
        },
        {
          "tag": "fixed",
          "description": "Prevent create directory errors on some file systems [Patch 211012]"
        }
      ]
    },
    {
      "tag": "v3.1.0",
      "date": "01/28/2021",
      "items": [
        {
          "tag": "new",
          "description": "Local Refinement (NEW! BETA) job, supporting features including: <ul><li>→ Non-Uniform regularization and adaptive pose marginalization</li><li>→ Alignment priors for soft penalization of unlikely poses</li><li>→ Reconstruction using higher-order CTF aberrations</li><li>→ Enforced point-group symmetry</li></ul>" 
        },
        {
          "tag": "new",
          "description": "Helical Processing feature improvements: <ul><li>→ Helical refinement now supports Non-Uniform regularization</li><li>→ Symmetry expansion now supports helical symmetry</li><li>→ In helical refinement, shifts along the helical axis can be limited to the asymmetric unit, improving resolutions for many datasets</li><li>→ \"z-clip\" parameter added to helical refinement's dynamic masking, to generate a mask covering only the central region along the z-axis</li></ul>" 
        },
        {
          "tag": "new",
          "description": "New Extract from Micrographs (CPU) job, supporting particle extraction on CPU in parallel using multiple cores." 
        },
        {
          "tag": "new",
          "description": "Admin users can now modify the list of users in which a project is shared with" 
        },
        {
          "tag": "update",
          "description": "Major updates to SSD caching to avoid issues of <code>Detected file change due to change in file size</code> and improve performance"
        },
        {
          "tag": "update",
          "description": "Several robustness improvements for Patch-CTF Estimation. Previous behaviour can be enabled using \"Classic mode\" parameter."
        },
        {
          "tag": "update",
          "description": "You can now quickly queue interactive jobs via the job details in the sidebar. The queue dialog has also been updated to clarify what machine the interactive jobs will run on."
        },
        {
          "tag": "update",
          "description": "Import Movies and Patch Motion now skip bad files instead of failing. Skipped files are added as a separate output."
        },
        {
          "tag": "update",
          "description": "Import Particles no longer ignores the <code>data_optics</code> section while trying to import a particle .star file. Exposure groups and CTF parameters other than high-order aberrations are retained from <code>data_optics</code> table."
        },
        {
          "tag": "update",
          "description": "Rebalance 2D Classes now has a \"Override maximum superclass size\" parameter that can be set to override the maximum size of all superclasses"
        },
        {
          "tag": "update",
          "description": "When launching a job, hidden files (files that start with a '.') will be ignored when checking if the job directory is empty if the <code>CRYOSPARC_IGNORE_HIDDEN_FILES</code> environment variable exists (add to <code>cryosparc_master/config.sh</code>)"
        },
        {
          "tag": "update",
          "description": "Homogeneous Reconstruct now has the option to reconstruct with helical symmetry, and to reconstruct with an inverted hand"
        },
        {
          "tag": "update",
          "description": "Homogeneous Reconstruct now supports input alignments on any pixel size, regardless of the reconstruction pixel size"
        },
        {
          "tag": "update",
          "description": "cryoSPARC Job Scheduler will now ignore CPU requirements when queuing jobs to non-cluster lanes; only RAM and GPU will be considered"
        },
        {
          "tag": "update",
          "description": "Change the parameter \"Remove leading UID in input micrograph path\" in Import Particles to be optional"
        },
        {
          "tag": "fixed",
          "description": "Discussion forum topics have returned to the dashboard"
        },
        {
          "tag": "fixed",
          "description": "Some users were unable to create an account or reset their password in Chrome"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug in Import Particles that caused it will fail when trying to convert <code>rlnOriginX/rlnOriginY</code> to <code>rlnOriginXAngst/rlnOriginYAngst</code> while importing Relion 3.1 star files"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused the cryoSPARC start process to not complete"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused the string of characters appended to the micrograph file paths created by cryoSPARC to be a variable length (now 21 characters)"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused the Import Project function to fail with <code>_pickle.UnpicklingError: could not find MARK</code>"
        },
        {
          "tag": "fixed",
          "description": "Filament tracer now eliminates particles beyond the micrograph's edge"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that prevented the Rebalance 2D Classes job from launching on clusters"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug in the Volume Tools job that gave erroneous output when the \"Invert mask\" and \"Fill holes\" options were both true"
        },
        {
          "tag": "fixed",
          "description": "Fixed a plotting issue in Heterogeneous Refinement causing orientation plots to fail with a <code>ValueError</code>"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue that prevented pre-v3.0 Extract From Micrographs, 2D Classification, and Create Templates jobs from being cleared"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue causing static masks to be improperly resized in Homogeneous Refinement New, Non-Uniform Refinement New, and Helical Refinement"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue preventing Helical Refinement from running with static masks that were sampled on a different grid than the volume; fixed related bug with static masks being improperly rotated when the \"Align input structure to helical (z) axis\" parameter was activated"
        },
        {
          "tag": "fixed",
          "description": "Fixed bug where running \"Clear Intermediate Results\" on a project caused the outputs of Curate Exposures jobs within the project to be inadvertently deleted."
        },
        {
          "tag": "fixed",
          "description": "Add support for pre-release versions of Topaz"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where job queue modal would display incorrect default lane/target info when 'default' lane doesn't exist"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where systemd service used wrong python interpreter"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where deleted sessions still appear in cryoSPARC Live browse view"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue in <code>cryosparcm updateuser</code> when using <code>lastname</code> flag"
        },
        {
          "tag": "fixed",
          "description": "Fixed IndexError in motioncor2 wrapper job"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where Topaz denoise would not work"
        },
        {
          "tag": "new",
          "description": "Clicking on the number of failed exposures in the navigation sidebar will open a dialog displaying the error details for each exposure" 
        },
        {
          "tag": "fixed",
          "description": "Fixed a case where a deleted session would display in the browse page when selected"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused manual picks on \"Test\" exposures to be excluded from session statistics and from being extracted"
        },
        {
          "tag": "fixed",
          "description": "Job cards in the \"current jobs\" and \"target\" modals will now open their respective job modals when clicked. Job cards will also display the job's priority if one has been set"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug in the cryoSPARC Live Worker that caused it to fail repeatedly due to uncaught exceptions caused by IO errors"
        },
        {
          "tag": "fixed",
          "description": "Blob and template particle diameters are now correctly shown as Å values"
        }
      ]
    },
    {
      "tag": "v3.0.1",
      "date": "12/15/2020",
      "items": [
        {
          "tag": "update",
          "description": "Disable existing conda environments before activating cryoSPARC's conda environment"
        },
        {
          "tag": "fixed",
          "description": "Specifying initial user credentials in install.sh fails with \"improper usage\" because of incorrect arguments"
        },
        {
          "tag": "fixed",
          "description": "Command <code>cryosparcm updateuser</code> fails because of incorrect arguments"
        },
        {
          "tag": "fixed",
          "description": "cURL symbol lookup error on CentOS8 when starting cryoSPARC after update to v3.0.0"
        },
        {
          "tag": "fixed",
          "description": "Importing Projects from v2.15.0 or earlier into v3.0.0 fails with UnicodeDecodeError"
        },
        {
          "tag": "fixed",
          "description": "Command <code>cryosparcw newcuda</code> uses old pyCUDA binary that doesn't exist"
        },
        {
          "tag": "fixed",
          "description": "Deleting an Extract From Micrographs job fails with KeyError"
        },
        {
          "tag": "fixed",
          "description": "Importing particle pose information in Import Particles fails with TypeError"
        },
        {
          "tag": "fixed",
          "description": "Command <code>cryosparcm backup</code> fails if cryoSPARC is turned off"
        },
        {
          "tag": "fixed",
          "description": "Inspect Picks job fails with ValueError if using micrographs imported with \"Constant CTF\" parameter"
        },
        {
          "tag": "fixed",
          "description": "Symmetry Search Utility job fails with TypeError in \"rise\" mode"
        }
      ]
    },
    {
      "tag": "v3.0.0",
      "date": "12/09/2020",
      "items": [
        {
          "tag": "new",
          "description": "New and improved cryoSPARC Live app, redesigned and reworked for robust and seamless real-time end-to-end cryo-EM data processing. CryoSPARC Live is built for data collection facilities, cryo-EM cores, industry labs, microscope operators and individual users who want to perform real-time cryo-EM data quality assessment and decision-making based on streaming 2D and 3D results that update in time with new data. CryoSPARC Live is also now the best and fastest way for users to perform their first-cut processing and curation on already available data. <ul><li>→ Expedited and optimized preprocessing, <a href=\"https://guide.cryosparc.com/live/performance-metrics\">enabling up to 600+ movies per hour per GPU</a> (motion correction, CTF estimation, particle picking and extraction)</li><li>→ The ability to seamlessly reprocess data at any time, to curate exposures, test/refine picking strategies and the choice of particles for refinement, on the fly</li><li>→ <em>Streaming 2D classification</em>, in-line <em>Ab-initio Reconstruction</em>, and <em>Streaming high-resolution 3D Refinement</em>, which update automatically as new particles become available</li><li>→ Seamless integration with cryoSPARC, allowing for direct advanced processing from the results generated in cryoSPARC Live without any data shuffling</li></ul>" 
        },
        {
          "tag": "new",
          "description": "After extensive beta testing globally, cryoSPARC Live is now available free of charge for general academic use. To learn more and to access Live, please see: <a href=\"https://guide.cryosparc.com\">guide.cryosparc.com</a><ul><li>→ Watch Now: <a href=\"https://guide.cryosparc.com/live/tutorial-videos\">CryoSPARC Live Walkthrough</li></ul>"
        },
        {
          "tag": "new",
          "description": "Improved <em>Non-Uniform Refinement</em> algorithm <span class='tag tag--new'>NEW</span> and job type <span class='tag tag--beta'>Beta</span>. Higher resolution results and reduced sensitivity to parameter changes. For more details, see the new paper published in <a href=\"https://www.nature.com/articles/s41592-020-00990-8\">Nature Methods</a> Plus: <ul><li>→ Support for local and global CTF refinement during non-uniform refinement</li><li>→ Fast, new GPU implementation of non-uniform regularization developed with support from NVIDIA</li><li>→ Additionally, support for automatic adaptive marginalization over alignment variables (enabled by default) yielding further improvements for small molecules.</li></ul>"
        },
        {
          "tag": "new",
          "description": "Upgraded to modern Python 3.7 runtime, including new updated dependencies and installation. Easy upgrades and downgrades between cryoSPARC v2 and v3."
        },
        {
          "tag": "new",
          "description": "Support for CUDA 11 + Ampere Architecture GPUs (3080, 3090, A100, etc.). <ul><li>→ Please ensure you’re running the latest NVIDIA Driver compatible with your GPU and CUDA Toolkit version. <a href=\"https://www.nvidia.com/Download/index.aspx\">You can download the latest driver for your GPUs here</a>. Visit <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/troubleshooting#gpu-issues\">Troubleshooting</a> for common GPU errors.</li></ul>"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-eer-file-support\">Full support for Thermo Fisher Scientific EER data</a> in cryoSPARC and cryoSPARC Live. EER data is decompressed on the fly and can be upsampled and split into the desired number of fractions during processing."
        },
        {
          "tag": "new",
          "description": "Improved defect file and defect pixel support in motion correction jobs in cryoSPARC and cryoSPARC Live. Defect pixels can be specified in a <code>.txt</code> defect file or as zeros in the gain reference."
        },
        {
          "tag": "new",
          "description": "Helical Reconstruction <span class='tag tag--beta'>BETA</span>: New suite of tools for end-to-end helical processing and refinement, including: <ul><li>→ <span class='tag tag--new'>NEW</span> high-resolution Helical Refinement job that also supports non-uniform regularization, and enforcement and local optimization of helical symmetry</li><li>→ <span class='tag tag--new'>NEW</span> <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-picking/job-filament-tracer-beta\">Filament Tracer</a> job tailored to the picking of filaments</li><li>→ Updates to <em>Inspect Particle Picks</em> to allow pruning of filament picks by curvature</li><li>→ <span class='tag tag--new'>New</span> <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/helical-reconstruction-beta/job-symmetry-search-utility-beta\"></a>Symmetry search utility</a> for exploring the symmetry space in a helical volume</li></ul>"
        },
        {
          "tag": "new",
          "description": "<em>Extract From Micrographs</em> will now re-center particles by default if they have already been extracted and aligned through 2D classification, 3D reconstruction, or refinement."
        },
        {
          "tag": "new",
          "description": "<span class='tag tag--new'>New</span> <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/3d-refinement/job-homogeneous-reconstruction-only\">Homogeneous Reconstruction Only</a> job type that performs 3D reconstruction from previously aligned particle images."
        },
        {
          "tag": "new",
          "description": "Ability to set priority values for jobs and users in cryoSPARC and cryoSPARC Live, allowing jobs to run in priority order instead of the order they were queued. Learn more about this feature with our <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-priority-job-queuing\">Guide to Priority Job Queuing</a>"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/cryosparc-live-session-data-management\">CryoSPARC Live Session Data Management:</a> View, delete and archive data created by cryoSPARC Live on a granular level. Save space taken up by data generated in old sessions and projects, while still being able to browse and view results."
        },
        {
          "tag": "new",
          "description": "A new Data Management tab is available in the Resource Manager in cryoSPARC, displaying details of all projects and workspaces available to the logged in user. At-a-glance information includes: project creation and ownership info, project directory location, last accessed/viewed, project size and other details."
        },
        {
          "tag": "new",
          "description": "Reduced GPU memory footprint in Patch Motion Correction. The overall GPU memory footprint of patch motion correction has been reduced. This enables most K3-sized image data to be processed on 11GB GPUs. Additionally, a \"low-memory mode\" switch is now available, which reduces it even further (at expense of speed)."
        },
        {
          "tag": "new",
          "description": "<span class='tag tag--new'>New</span> <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-remove-duplicate-particles\">Remove Duplicate Particles job</a> checks for particles that are extracted too close together on a micrograph and keeps only one, to allow combining picks from multiple pickers without affecting FSC estimates."
        },
        {
          "tag": "new",
          "description": "<span class='tag tag--beta'>Beta</span> Patch Motion Correction in cryoSPARC and cryoSPARC Live now optionally support movie data that has been saved with a variable dose rate among frames (e.g., from Leginon)"
        },
        {
          "tag": "new",
          "description": "<span class='tag tag--new'>New</span> <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/optional-cryosparc-and-systemd\">Systemd Unit File</a> to restart cryoSPARC after server shutdown: A systemd unit file is now included to allow running cryoSPARC as a service."
        },
        {
          "tag": "update",
          "description": "Improvements to <em>Patch CTF estimation</em> for better CTF fit in cases where background or envelope estimation is difficult. Improved robustness in relative ice thickness measure."
        },
        {
          "tag": "update",
          "description": "<em>Downsample Particles</em> and <em>Extract from Micrographs</em> will now correctly scale particle alignment shifts, fixing issues where downsample was used immediately prior to local refinement or 3D variability."
        },
        {
          "tag": "update",
          "description": "Orientation distribution and posterior precision plots were added to <em>Heterogeneous Refinement</em>, and can be disabled by turning off the \"Show viewing orientation distribution plots\" parameter."
        },
        {
          "tag": "update",
          "description": "<em>Import Micrographs</em> now has an option to output constant CTF values, so that subsequent steps will ignore the CTF entirely. Useful for negative stain and exotic data collection."
        },
        {
          "tag": "update",
          "description": "Improved <code>cryosparcm patch</code> pre-apply validation."
        },
        {
          "tag": "update",
          "description": "Reduced SSD-cache coordination bandwidth, improving the robustness of caching on multi-node systems."
        },
        {
          "tag": "update",
          "description": "Smarter cluster job ID parsing following cluster submission. Ability to use shell redirects in cluster submission commands, enabling native support for the LSF cluster management system."
        },
        {
          "tag": "update",
          "description": "Each project, workspace and job now records a 'last accessed' timestamp, updating whenever a user views the project, workspace or job through the web application interface. This allows for administrators to quickly identify and remove/archive data that is no longer used."
        },
        {
          "tag": "update",
          "description": "Queuing interactive jobs always default to the master node."
        },
        {
          "tag": "update",
          "description": "Ability to specify a first and last name for new users in the Admin panel and through the command line interface."
        },
        {
          "tag": "update",
          "description": "Default umask is now <code>002</code>, to allow write permissions by 'group' for folders created by cryoSPARC."
        },
        {
          "tag": "update",
          "description": "Renamed internal installation directories from <code>cryosparc2_*</code> to <code>cryosparc_*</code>"
        },
        {
          "tag": "fixed",
          "description": "<em>Import Particles</em> job fixes: Importing particle locations using micrographs created in v2.15+ failed because of a variable length UID prepended to the path of each micrograph; Using the \"ignore raw data\" parameter causes the job to fail with a missing pixel size error; Support for offsets specified in angstroms (<code>_rlnOriginXAngst</code>, <code>_rlnOriginYAngst</code>)."
        },
        {
          "tag": "fixed",
          "description": "Import result group fails if some path fields are blank."
        },
        {
          "tag": "fixed",
          "description": "<em>Inspect Picks</em> \"use_denoise\" button failed to actually load denoised micrographs, even if they were connected."
        },
        {
          "tag": "fixed",
          "description": " <em>Local Refinement</em> now respects the static masking and minimization-over-per-particle-scale parameters, which were previously not used correctly."
        },
        {
          "tag": "fixed",
          "description": "Setting \"Override number of iterations\" to True without providing a number of iterations previously prevented Local Refinement from ever terminating."
        },
        {
          "tag": "fixed",
          "description": "<em>Non-Uniform Refinement</em>: Local processing causes an error if masks are too close to the edge of the refinement box."
        },
        {
          "tag": "fixed",
          "description": "<em>Local Filtering</em> had <code>SSD:True</code> hard-coded, causing it to fail when running on resources without SSDs."
        },
        {
          "tag": "fixed",
          "description": "Usernames are now correctly displayed in the details panel for a job."
        }
      ]
    },
    {
      "tag": "v2.15.0",
      "date": "05/13/2020",
      "items": [
        {
          "tag": "new",
          "description": "First version of a new, comprehensive cryoSPARC guide! Available at <a href=\"https://guide.cryosparc.com\">guide.cryosparc.com</a> (Beta). This guide will consolidate all existing documentation and be populated with cryo-EM data processing tutorials, tips, descriptions of methods, case studies, etc."
        },
        {
          "tag": "new",
          "description": "Use the new <code>cryosparcm patch</code> command to install bug fixes and improvements without a full update"
        },
        {
          "tag": "new",
          "description": "It is now possible to set a project-level default value for whether or not to cache particle images to the local SSD before running jobs within a project. The parameter can be adjusted from the sidebar when a project is selected"
        },
        {
          "tag": "new",
          "description": "New <em>Particle Class Probability Filter</em> job: Filter particles based on the probability of matching their assigned 2D or 3D classes"
        },
        {
          "tag": "update",
          "description": "In the <em>Topaz Denoise</em> job, the default values for the following parameters have been altered to better suit Topaz: The default value for the \"shape of split micrographs\" parameter has been changed to 1536. The default value for the \"padding around each split micrograph\" parameter has been changed to 256."
        },
        {
          "tag": "update",
          "description": "The <em>Topaz Cross-Validation</em> job has been updated with various improvements: Added option to output models from subsidiary training jobs when running cross-validation. Added expected number of particles and training radius as cross-validation parameters. Improved GPU distribution for subsidiary training jobs."
        },
        {
          "tag": "update",
          "description": "All Topaz jobs now store preprocessed micrographs to avoid unnecessary preprocessing in subsequent Topaz jobs."
        },
        {
          "tag": "update",
          "description": "Added option for the <em>Extensive Workflow</em> to run additional job types, including <em>Local Motion Correction</em>, Multi-class <em>ab-initio</em> and <em>3D Variability</em>. This can be used as a full system test for new installs and updates."
        },
        {
          "tag": "update",
          "description": "Use dynamically-generated SSD cache paths by including environment variables in the <code>CRYOSPARC_SSD_PATH</code> definition for a worker's <code>config.sh</code>"
        },
        {
          "tag": "update",
          "description": "<em>Import Movies</em> and <em>Import Micrographs</em> jobs are now parallelizable across multiple threads while reading the headers of all exposures to import"
        },
        {
          "tag": "update",
          "description": "Initial and final mini-batch size parameters for <em>Ab-initio Reconstruction</em> can now be set to zero to automatically tune based on the estimated particle size"
        },
        {
          "tag": "update",
          "description": "The project and workspace switchers, which allow you to quickly search and navigate, have been revamped. When you're viewing a project or workspace, the switcher will highlight and scroll to it, allowing you to easily navigate relative to them. When viewing a job within a workspace, the workspace switcher will display a link icon next to every workspace that particular job is linked to."
        },
        {
          "tag": "update",
          "description": "The job history tab within the resource manager page now shows only jobs that have not been deleted by default. Select the 'show deleted' toggle to show only jobs that have been deleted."
        },
        {
          "tag": "update",
          "description": "Jobs can now only be imported from inside the project directory. This fixes a bug that causes particles to not be cached if they were imported from outside the project."
        },
        {
          "tag": "update",
          "description": "Executing a <code>cryosparcm</code> command is now only allowed by the owner of the script and on the master node. You can override this parameter by setting <code>CRYOSPARC_FORCE_USER</code> or <code>CRYOSPARC_FORCE_HOSTNAME</code> to <code>true</code> in your shell (or permanently inside <code>cryosparc2_master/config.sh</code>)."
        },
        {
          "tag": "fixed",
          "description": "Bug where multiple jobs launched simultaneously using the same particles could result in endless \"cache waiting\" messages"
        },
        {
          "tag": "fixed",
          "description": "<em>Full-frame Motion Correction</em> runs out of memory on 8GB cards with K3 data. There is now a switch to reduce memory usage by approximately half"
        },
        {
          "tag": "fixed",
          "description": "<code>ValueError</code> was raised in <em>2D classification</em> or <em>Patch CTF Estimation</em> jobs when movies that were imported separately but contain files with the same names get overwritten"
        },
        {
          "tag": "fixed",
          "description": "All refinement jobs now use the first (rather than last) FSC threshold crossing for filtering during iterations"
        },
        {
          "tag": "fixed",
          "description": "Bug in <em>Particle Set Tools</em> intersection when set A is smaller than set B"
        },
        {
          "tag": "fixed",
          "description": "Bug in <em>Heterogeneous Refinement</em> which fails if intermediate plots are disabled"
        },
        {
          "tag": "fixed",
          "description": "<em>Manual Picker</em> fails while calculating the contrast intensity range for a micrograph with an irregular shape"
        },
        {
          "tag": "fixed",
          "description": "Topaz Denoised micrographs display fail to display correctly in the <em>Manual Picker</em> job (as either gray or black images)"
        },
        {
          "tag": "fixed",
          "description": "Micrographs captured at a low magnification fail during <em>Patch CTF Estimation</em> with an <code>IndexError</code>"
        },
        {
          "tag": "fixed",
          "description": "<em>Select 2D</em> fails when trying to select classes from a particle <code>.mrc</code> file that is too large to fit in memory. Also fixed a bug where an <code>IndexError</code> is raised if a class has less than 3 particles in it."
        },
        {
          "tag": "fixed",
          "description": "<em>Exposure Group Utility</em> job fails with a <code>KeyError</code> when an input dataset has a missing CTF result field"
        },
        {
          "tag": "fixed",
          "description": "<em>Inspect Picks</em> job fails if you try to extract locations and the box size set is not an even number"
        },
        {
          "tag": "fixed",
          "description": "<em>Downsample Particles</em> now exports particles in the correct order if the input particles are out of order on disk"
        },
        {
          "tag": "fixed",
          "description": "<em>MotionCor2</em> Wrapper: <code>total dose</code> is incorrectly specified as the <code>frame dose</code> argument for dose weighting"
        },
        {
          "tag": "fixed",
          "description": "<em>MotionCor2</em> Wrapper: output pixel size is incorrect after specifying a Fourier crop factor, causing CTF Estimates to fail"
        },
        {
          "tag": "fixed",
          "description": "Project directory sizes don't update when a project is deleted"
        },
        {
          "tag": "fixed",
          "description": "Allow importing movies shot on high-aspect ratio detectors (2:1 aspect ratio or higher)"
        },
        {
          "tag": "fixed",
          "description": "Resolved version incompatibilities with Topaz version <code>0.2.4a</code>"
        }
      ]
    },
    {
      "tag": "v2.14.2",
      "date": "02/21/2020",
      "items": [
        {
          "tag": "new",
          "description": "The job builder includes a search bar to quickly find the job you're looking for"
        },
        {
          "tag": "update",
          "description": "Many optimizations across cryoSPARC jobs - datasets containing a large number of items will see significant speedups"
        },
        {
          "tag": "update",
          "description": "Added option to use pre-trained initializations in Topaz Train"
        },
        {
          "tag": "update",
          "description": "Added option to use pre-trained model when running Topaz Extract"
        },
        {
          "tag": "fixed",
          "description": "Topaz Denoise fails when trained model is input"
        },
        {
          "tag": "fixed",
          "description": "Template Picker fails on K3 micrographs motion corrected using external software"
        },
        {
          "tag": "update",
          "description": "All jobs that output FSC plots have been updated to allow for downloading the raw data for external plotting"
        },
        {
          "tag": "update",
          "description": "Curate Exposures job can be run without connecting micrographs, allowing for CTF-based curation using only movies"
        },
        {
          "tag": "new",
          "description": "\"Cache Particles on SSD\" Job that will cache particles on a node of your choice"
        },
        {
          "tag": "fixed",
          "description": "Turning on the \"Generate new FSC Mask\" parameter in the Sharpening Tools job caused an <code>AssertionError</code>"
        },
        {
          "tag": "fixed",
          "description": "\"Particles Excluded\" output group image in Select2D job was the same as the \"Particles Included\" output group image"
        },
        {
          "tag": "fixed",
          "description": "New Homogeneous Refinement job sometimes fails when resampling initial model because boxes were not even sized"
        },
        {
          "tag": "fixed",
          "description": "Performance regressions in the \"Extract from Micrographs\" job where the time to extract particles increased non-linearly with a larger number of exposures"
        },
        {
          "tag": "fixed",
          "description": "\"Inspect Particle Picks\" job fails with a <code>KeyError</code> when it encounters an exposure with no particle locations"
        }
      ]
    },
    {
      "tag": "v2.13.2",
      "date": "01/30/2020",
      "items": [
        {
          "tag": "new",
          "description": "The 3D Variability Display job output now includes an in-browser, in-line interactive 3D scatter plot to analyze clusters in the distribution of particle reaction coordinates! The user can select which three reaction coordinates to display, and individual clusters can be shown or hidden. Read the new full tutorial, including examples of results: <a href=\"https://cryosparc.com/docs/tutorials/3d-variability-analysis-2/\">3D Variability Analysis Tutorial: Part Two</a>"
        },
        {
          "tag": "fixed",
          "description": "CPU and GPU memory usage of Homogeneous Refinement is substantially reduced. In tests, it is now possible to refine a 1024 box size on a 11GB consumer-grade NVIDIA GPU (GTX 1080Ti), though this does require ~160GB of CPU RAM. A smaller 256 box size can run on a 4GB GPU and requires only 6GB of CPU RAM"
        },
        {
          "tag": "new",
          "description": "When inspecting particle picks from template or blob pickers, particle pick scores (NCC) and power scores are automatically calibrated with respect to the defocus of each micrograph. This ensures that setting an appropriate threshold on one micrograph will yield good picks on other micrographs with very different defocus. See the tutorial: <a href=\"https://cryosparc.com/docs/tutorials/particle-picking-calibration/\">Particle Picking Calibration</a>"
        },
        {
          "tag": "new",
          "description": "Negative stain and phase-plate datasets are now more easy to process. A single toggle can be set during import and no other parameter changes are necessary in subsequent job types. See the tutorial for details: <a href=\"https://cryosparc.com/docs/tutorials/negative-stain-phase-plate/\">Negative Stain and Phase Plate Data Workflows</a>"
        },
        {
          "tag": "new",
          "description": "The blob picker can now use \"ring\" shaped blobs, which perform well in picking viruses and other spherical particles (eg. apoferritin)"
        },
        {
          "tag": "fixed",
          "description": "The template picker now uses substantially less GPU memory for large micrographs (e.g., K3 super-resolution data)"
        },
        {
          "tag": "new",
          "description": "Relion 3.1 format <code>.star</code> files can now be imported without errors, though optics group data is not currently parsed"
        },
        {
          "tag": "fixed",
          "description": "Local per-particle motion correction of K3 data now works correctly"
        },
        {
          "tag": "new",
          "description": "Manual picker interactive job now has adaptive robust contrast normalization to make seeing particles in imperfect images easier"
        },
        {
          "tag": "new",
          "description": "Manual Picker interactive job now includes a \"Contrast Intensity Override\" slider that allows users to manually select the contrast bounds when viewing a micrograph. The average, patch-based intensity is used by default for the Manual Picker and Exposure Curation jobs"
        },
        {
          "tag": "new",
          "description": "Validation (FSC) Job: Validation of a refinement result (i.e. half-maps) using the FSC is now available as a separate job type, with optional mask input"
        },
        {
          "tag": "update",
          "description": "Fourier-space plots in Homogeneous Refinement display correctly"
        },
        {
          "tag": "new",
          "description": "Multiple updates to Topaz-wrapped jobs in cryoSPARC:<ul><li>→ Added multiprocessing to substantially improve preprocessing times in all Topaz jobs</li><li>→ Added parameter to select number of CPUs in the Topaz Extract job</li><li>→ Topaz jobs now automatically account for negative stain data</li><li>→ Topaz-extracted particles no longer cause 2D classification jobs to occasionally fail due to inconsistent CTF outputs</li></ul>"
        },
        {
          "tag": "update",
          "description": "Passthrough output files now include the project and job numbers for easier referencing (e.g.,<code>P1_J1_passthrough.cs</code>)"
        },
        {
          "tag": "update",
          "description": "Manual Picker job now fails by default if the CTF inputs are not connected. An override switch has been added to allow manual picking without CTF estimates, which is not the recommended workflow"
        },
        {
          "tag": "update",
          "description": "3D Variability Display can now flip the handedness of output volume series"
        },
        {
          "tag": "fixed",
          "description": "Bug that would cause <code>cufftInvalidPlan</code> error during refinement"
        },
        {
          "tag": "fixed",
          "description": "Bug where two Select 2D jobs are jobs connected to each other, the last Select 2D job shows incorrect class average thumbnails"
        },
        {
          "tag": "fixed",
          "description": "Bug where the <code>command_vis</code> would repeatedly try to start but fails, using 100% CPU in the process"
        },
        {
          "tag": "fixed",
          "description": "Bug where <code>mrc</code> volumes were being saved as <code>float64</code> files, which the <code>mrc</code> file format doesn't support, causing the Sharpening Tools job to fail"
        },
        {
          "tag": "fixed",
          "description": "Bug where Heterogenous Refinement and Multi-Class Ab-Initio jobs would fail due to a <code>ValueError</code>"
        }
      ]
    },
    {
      "tag": "v2.12.4",
      "date": "12/04/2019",
      "items": [
        {
          "tag": "new",
          "description": "Exposure Groups Utility Updates: Create exposure groups using regular expressions and separators and test your exposure group creation strategy"
        },
        {
          "tag": "new",
          "description": "3D Variability updates to default parameters: create better results without tweaking"
        },
        {
          "tag": "fixed",
          "description": "Multiprocessing jobs (Patch CTF, Patch motion, Full-frame motion) fail with abnormal termination errors"
        },
        {
          "tag": "fixed",
          "description": "Import micrographs and import movies function incorrectly with exposure groups"
        },
        {
          "tag": "fixed",
          "description": "Imported jobs with inputs cause the tree layout to fail or throw an error"
        },
        {
          "tag": "fixed",
          "description": "3D Variability display 'intermediate' mode outputs are incorrectly scaled"
        },
        {
          "tag": "fixed",
          "description": "3D Variability display 'cluster' mode outputs contain no particles"
        }
      ]
    },
    {
      "tag": "v2.12.0",
      "date": "11/29/2019",
      "items": [
        {
          "tag": "new",
          "description": "New 'cluster' mode in 3D Variability Display allows for automatic hierarchical 3D classification based on variability coordinates: directly visualize and see how many discrete classes are present in a dataset, separate them by clustering, and reconstruct each separately. Then recursively perform 3D Variability to look for sub-conformations or flexibility within each cluster, or refine each cluster separately."
        },
        {
          "tag": "new",
          "description": "New 'intermediates' mode in 3D Variability Display allows for weighted reconstructions of intermediate positions along each variability dimension: create more detailed videos of variability that minimize the effect of density appearing and disappearing during large motions. Also output weighted particle subsets for intermediate positions, for refinement of particular flexible conformations."
        },
        {
          "tag": "new",
          "description": "Default options in 3D Variability improve sensitivity to small variations in the 3D density. Plus support for coloured or white noise models, high-pass filter during optimization, per-particle scale optimization."
        },
        {
          "tag": "fixed",
          "description": "Streaking issue in 3D Variability so that (many) more variability modes can be solved simultaneously."
        },
        {
          "tag": "new",
          "description": "Per-particle defocus refinement implemented on GPU allows CTF refinement in minutes for 100,000's of particles. Implemented as a standalone job and also as an in-line on-the-fly option during Homogeneous Refinement: <a href=\"https://cryosparc.com/docs/tutorials/ctf-refinement/\">learn more</a>"
        },
        {
          "tag": "new",
          "description": "Global CTF Refinement and Local CTF Refinement jobs: CTF aberration support, also GPU implemented, corrects for beam tilt, trefoil, spherical aberration, and tetrafoil. Estimation of the new parameters can be done in a standalone job or as an in-line on-the-fly option during Homogeneous Refinement, yielding ultra-high resolution reconstructions: <a href=\"https://cryosparc.com/docs/tutorials/ctf-refinement/\">learn more</a>"
        },
        {
          "tag": "new",
          "description": "Exposure Group Utilities job allows users to split or combine datasets into multiple exposure groups for higher-order aberration correction: <a href=\"https://cryosparc.com/docs/reference/jobs#exposure-group-utilities/\">learn more</a>"
        },
        {
          "tag": "new",
          "description": "First-pass optimization of GPU and CPU code for Homogeneous Refinement: now up to 5x faster, especially for symmetric particles"
        },
        {
          "tag": "new",
          "description": "New admin page with ability to change roles of existing users and create new users through the UI: <a href=\"https://cryosparc.com/docs/tutorials/user-management/\">User Management Tutorial</a>"
        },
        {
          "tag": "new",
          "description": "Users can request to reset their password through the interface: <a href=\"https://cryosparc.com/docs/tutorials/user-management#reset-password/\">Learn more</a>"
        },
        {
          "tag": "new",
          "description": "New Topaz wrapper jobs for integrating Topaz's particle picking and micrograph denoising functionality: <a href=\"https://cryosparc.com/docs/tutorials/topaz/\">Tutorial: Topaz Integration in cryoSPARC</a>"
        },
        {
          "tag": "new",
          "description": "New Symmetry Expansion job expands particle poses around point-group symmetries, to support local refinement of subunits, as well as 3D variability of symmetric particles."
        },
        {
          "tag": "new",
          "description": "New Job Scheduler and Queuing Interface: Override the cryoSPARC scheduler to queue directly to a specific GPU: <a href=\"https://cryosparc.com/docs/tutorials/queue-to-gpu/\">Learn more</a>"
        },
        {
          "tag": "new",
          "description": "Ability to perform non-interactive threshold selection for particle picking and extraction, and non interactive selection of 2D classes, making it possible to process simple data completely end-to-end without manual intervention"
        },
        {
          "tag": "new",
          "description": "Ability to interactively select all classes above or below a threshold in Select 2D job (right-click a class)"
        },
        {
          "tag": "new",
          "description": "Multiprocessing robustness updates in preprocessing jobs (Patch Motion, Full Frame Motion Correction, Patch CTF Estimation) ensure that if a job fails or is interrupted, completed results are recovered and processing can be resumed."
        },
        {
          "tag": "update",
          "description": "Orientation-precision plots in refinement are now coloured with minimum value zero so that differences in ratios can be easily spotted"
        },
        {
          "tag": "update",
          "description": "Relative ice thickness is now available in Exposure Curation"
        },
        {
          "tag": "update",
          "description": "2D Classification allows for changing the maximum alignment resolution and reconstruction resolution separately if desired"
        },
        {
          "tag": "update",
          "description": "Sharpening job now applied a spherical window by default"
        },
        {
          "tag": "update",
          "description": "Added option to skip header check when importing movies, which allows for faster importing on larger datasets"
        },
        {
          "tag": "update",
          "description": "Importing Movies, Micrographs or Particles will auto-populate the 'exposure group ID' field of the dataset based on the project (each project increments from 0)"
        },
        {
          "tag": "update",
          "description": "Set the environment variable <code>CRYOSPARC_DISABLE_IMPORT_ON_MASTER</code> to allow master-direct jobs (import jobs, curate exposures, select 2D) to be queued on any machine you specify, and not only the master node"
        },
        {
          "tag": "update",
          "description": "If a job is queued to a specific GPU, it will be noted in the Resource Manager"
        },
        {
          "tag": "update",
          "description": "Job Cards now show queue message if placed in queue"
        },
        {
          "tag": "update",
          "description": "Job type is more prominently shown in the sidebar"
        },
        {
          "tag": "fixed",
          "description": "Ab-initio job with symmetry enforced fails with invalid memory access error"
        },
        {
          "tag": "fixed",
          "description": "Certain parameter descriptions in the Job Builder don't show"
        },
        {
          "tag": "fixed",
          "description": "Better logging in Align 3D Job"
        },
        {
          "tag": "fixed",
          "description": "Error in non-uniform refinement when run with CPU option"
        },
        {
          "tag": "fixed",
          "description": "3DFSC job doesn't accept mask inputs"
        },
        {
          "tag": "fixed",
          "description": "New <code>ignore_pose</code> option in import particles to enable import of locations when pose information is missing"
        },
        {
          "tag": "fixed",
          "description": "Deadlock in new job types like 3D var on some newer GPUs"
        },
        {
          "tag": "fixed",
          "description": "Select 2D fails when all classes are selected (i.e., if there are no particles in the templates_excluded output result group)"
        },
        {
          "tag": "fixed",
          "description": "White circles in 2D Class job when circular mask diameter parameter is too close to particle box size"
        },
        {
          "tag": "fixed",
          "description": "Exposure Sets Tool Job doesn't recognize particle inputs"
        },
        {
          "tag": "fixed",
          "description": "The 'more' button in the Job History page doesn't load new rows"
        },
        {
          "tag": "fixed",
          "description": "Copy to clipboard functionality is more reliable on various browsers"
        },
        {
          "tag": "fixed",
          "description": "Back button in File Browser correctly expands path variables"
        },
        {
          "tag": "fixed",
          "description": "Project directory sizes are calculated more accurately"
        },
        {
          "tag": "fixed",
          "description": "When updating a worker's SSD configuration, the SSD option remained disabled even though user supplied a path to the SSD"
        }
      ]
    },
    {
      "tag": "v2.11.0",
      "date": "09/13/2019",
      "items": [
        {
          "tag": "new",
          "description": "Data Management: Export/Import of Projects, Jobs, Output Result Groups and more! <a href=\"https://cryosparc.com/docs/tutorials/data-management/\">Data Management Tutorial</a>"
        },
        {
          "tag": "new",
          "description": "Notifications and Notification Manager"
        },
        {
          "tag": "new",
          "description": "Dashboard Improvements: Helpful links, relevant statistics and more!"
        },
        {
          "tag": "new",
          "description": "Resource Manager Improvements: Intuitive queue, job history table and more!"
        },
        {
          "tag": "new",
          "description": "Particle & Exposure Set Utility Jobs: Split/join/separate/compare/make subsets of particles and exposures"
        },
        {
          "tag": "update",
          "description": "Instance Size Statistics: View the total size of all jobs and projects from the Project Details panel"
        },
        {
          "tag": "update",
          "description": "Refresh project directory sizes from the Project Details panel"
        },
        {
          "tag": "update",
          "description": "Display job type in the Job Details panel"
        },
        {
          "tag": "fixed",
          "description": "Patch-Based Motion Correction: check that K_Z/K_Y/K_X are least 1"
        },
        {
          "tag": "fixed",
          "description": "Patch-Based Motion Correction: log file for Patch-Based Motion Correction shows an incorrect file path"
        },
        {
          "tag": "fixed",
          "description": "Patch-Based Motion Correction: random selection of movies was not random"
        }
      ]
    },
    {
      "tag": "v2.9.0",
      "date": "06/25/2019",
      "items": [
        {
          "tag": "new",
          "description": "3D Variability Analysis job <span class='tag tag--beta'>Beta</span> (requires CUDA 9+)"
        },
        {
          "tag": "update",
          "description": "Support for CUDA 10.1 (recompile cryoSPARC with a newer CUDA Toolkit by using <code>bin/cryosparcw newcuda</code>)"
        },
        {
          "tag": "fixed",
          "description": "Micrographs with Patch CTF Extraction fail when particles are extracted"
        }
      ]
    },
    {
      "tag": "v2.8.3",
      "date": "06/14/2019",
      "items": [
        {
          "tag": "update",
          "description": "Install script for cryoSPARC (new version of anaconda used when installing)"
        },
        {
          "tag": "fixed",
          "description": "Dependency issue caused numpy functions to fail"
        },
        {
          "tag": "fixed",
          "description": "CTFFIND4 wrapper crashes when it tries to output failed micrographs"
        }
      ]
    },
    {
      "tag": "v2.8.0",
      "date": "05/30/2019",
      "items": [
        {
          "tag": "new",
          "description": "Local Patch-Based Motion Correction <span class='tag tag--beta'>Beta</span>"
        },
        {
          "tag": "new",
          "description": "Local Patch-Based CTF Estimation <span class='tag tag--beta'>Beta</span>"
        },
        {
          "tag": "new",
          "description": "Create Templates job"
        },
        {
          "tag": "new",
          "description": "Blob picker job"
        },
        {
          "tag": "new",
          "description": "Support for movies produced by K3 Camera (including fixes for quirks of Leginon/Gatan Latitude)"
        },
        {
          "tag": "new",
          "description": "Heartbeat time is now configurable. Addresses problem where long-running jobs stop communicating with the master process intermittently due to network issues."
        },
        {
          "tag": "new",
          "description": "Network requests between worker and master processes now by default have a 300 second timeout (instead of 120s) and also retry 3 times in case the host is unreachable. This should reduce the occurrence of failed jobs due to network timeout issues or slowdowns of the master process"
        },
        {
          "tag": "new",
          "description": "Ability to mark failed or killed jobs in cryoSPARC as completed allowing it's latest outputs to be used for further processing) - use the 'Mark Job as Complete' button in the Job Details panel"
        },
        {
          "tag": "new",
          "description": "Import <code>.star</code> files now also imports rlnRandomSubset to preserve the gold-standard split and <code>rlnAngle*</code> and <code>rlnOriginX/Y</code> to preserve alignments of particles"
        },
        {
          "tag": "new",
          "description": "Ab-initio reconstruction now has a parameter to limit it to running on only a subset of particles, to more easily deal with very large (million+ particle) datasets. You can use the volumes generated by a 'partial' ab-initio reconstruction as the initial references for a heterogeneous refinement, which will then quickly classify and refine the rest of the dataset"
        },
        {
          "tag": "update",
          "description": "Memory usage for motion correction and picking is now minimized for super-res K3 movies"
        },
        {
          "tag": "update",
          "description": "Box size range in interactive jobs increased to <code>[4, 1024]</code>"
        },
        {
          "tag": "update",
          "description": "MRC Extended header size (NSYMBT) taken into account when reading MRC files"
        },
        {
          "tag": "fixed",
          "description": "Particles extracted from K3 Movies produced NaN values"
        },
        {
          "tag": "fixed",
          "description": "MRC mode 0 is now interpreted as uint8 rather than int8, to match Latitude for K3 movies"
        },
        {
          "tag": "fixed",
          "description": "Power threshold slider in interactive jobs can be more finely controlled"
        },
        {
          "tag": "fixed",
          "description": "NCC and Power Thresholds for picking are limited to 1st and 99th percentile to reduce number of outliers"
        },
        {
          "tag": "fixed",
          "description": "Bug in GPU extraction that would cause job to hang indefinitely after starting"
        },
        {
          "tag": "fixed",
          "description": "Bug in dynamic mask generation in Local Refinement (when Non-uniform Refinement is turned on)"
        },
        {
          "tag": "fixed",
          "description": "Off-by-one bug in fulcrum selection in Local Refinement"
        }
      ]
    },
    {
      "tag": "v2.5.0",
      "date": "01/08/2019",
      "items": [
        {
          "tag": "new",
          "description": "MotionCor2 Wrapper <span class='tag tag--beta'>Beta</span> <a href=\"https://cryosparc.com/docs/reference/jobs/#motioncor2-wrapper\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Ability to force reinstall updates <a href=\"https://cryosparc.com/docs/reference/install#forced-update\">More details</a>"
        },
        {
          "tag": "update",
          "description": "Various GCTF Wrapper bugfixes"
        },
        {
          "tag": "fixed",
          "description": "Certain plots created by GCTF fail to display in Curate Exposures"
        },
        {
          "tag": "fixed",
          "description": "Template Picker fails to allocate GPU memory"
        },
        {
          "tag": "fixed",
          "description": "Extract From Micrographs runs out of GPU memory prematurely"
        }
      ]
    },
    {
      "tag": "v2.4.6",
      "date": "11/30/2018",
      "items": [
        {
          "tag": "new",
          "description": "cryoSPARC now supports CUDA 9 and 10. <strong>Note:</strong> Updating to this version will trigger a reinstallation of cryoSPARC dependencies. These are included in the installation bundle and should not cause any issues but updating could take longer than normal"
        },
        {
          "tag": "fixed",
          "description": "Bug in GCTF wrapper that caused problems when run in per-particle local CTF refinement mode"
        },
        {
          "tag": "fixed",
          "description": "Bug in exposure curation when some micrographs contained no particles"
        }
      ]
    },
    {
      "tag": "v2.4.2",
      "date": "11/08/2018",
      "items": [
        {
          "tag": "new",
          "description": "Wrapper for GCTF <span class='tag tag--beta'>Beta</span> <a href=\"https://cryosparc.com/docs/reference/jobs#ctf-estimation-gctf\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Wrapper for CTFFIND 4.1.10 <a href=\"https://cryosparc.com/docs/reference/jobs#ctf-estimation-ctffind\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Added lowpass filter option under Volume Tools"
        },
        {
          "tag": "new",
          "description": "Simulate Data <span class='tag tag--beta'>Beta</span> job to create particle images from up to two input volumes at random relative and global alignments"
        },
        {
          "tag": "update",
          "description": "Jobs no longer run if required inputs are missing; user is prompted to connect required inputs before queuing is possible"
        },
        {
          "tag": "update",
          "description": "Plotting projections of generated volume in Ab-Initio Reconstruction instead of slices. Refinements still plot slices"
        },
        {
          "tag": "fixed",
          "description": "CTF error 'binary not found'"
        },
        {
          "tag": "fixed",
          "description": "CTFFIND same filename issues"
        },
        {
          "tag": "fixed",
          "description": "<code>CudaFftError</code> on some GPUs in compute-exclusive mode"
        }
      ]
    },
    {
      "tag": "v2.3.2",
      "date": "10/02/2018",
      "items": [
        {
          "tag": "new",
          "description": "Revamped job builder with support for low-level result connections, new outputs tab in job details view. <a href=\"https://cryosparc.com/docs/tutorials/job-builder\">Learn more</a>"
        },
        {
          "tag": "new",
          "description": "Backup &amp; Restore cryoSPARC database through the command line. <a href=\"https://cryosparc.com/docs/reference/install/#backup--restore\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Project directory path now in the project details panel, copy it to your clipboard by clicking on it"
        },
        {
          "tag": "update",
          "description": "Redesigned Select 2D interactive job including support for quick selection (all/none/invert) and sorting classes by number of particles, resolution, and effective classes assigned. <a href=\"https://cryosparc.com/docs/tutorials/t20s/#113-select-2d-classes-interactive\">Learn more</a>"
        },
        {
          "tag": "update",
          "description": "Volume tools can now be used to invert a mask"
        },
        {
          "tag": "update",
          "description": "Added a volume premultiplier to Particle Subtraction to improve scaling of subtracted projections"
        },
        {
          "tag": "update",
          "description": "Added option to not use halfmaps in Particle Subtraction"
        },
        {
          "tag": "update",
          "description": "cryoSPARC username now available in cluster submission scripts. <a href=\"https://cryosparc.com/docs/reference/install/#installation-cluster\">More details</a>"
        },
        {
          "tag": "fixed",
          "description": "After queuing a job in the tree view, you will remain in the tree view when the details view is opened"
        },
        {
          "tag": "fixed",
          "description": "Exposure curation bug fixes (handling NaNs in inputs, can input multiple numerals to edit selections, corrected phase_shift and fit_to values in CTF fit image)"
        },
        {
          "tag": "fixed",
          "description": "Import volumes saves volume to the correct directory"
        },
        {
          "tag": "fixed",
          "description": "Volume tools conversion between map/mask volume types"
        },
        {
          "tag": "fixed",
          "description": "Non-uniform refinement now outputs a mask. Also removed duplicate volume outputs"
        },
        {
          "tag": "fixed",
          "description": "Use per-particle scale factors in particle subtraction"
        },
        {
          "tag": "fixed",
          "description": "CTFFIND file path reference pointed to an incorrect location, causing CTF Estimation jobs to fail"
        }
      ]
    },
    {
      "tag": "v2.2.0",
      "date": "09/17/2018",
      "items": [
        {
          "tag": "new",
          "description": "Local Refinement <span class='tag tag--beta'>Beta</span> and Particle Subtraction <span class='tag tag--beta'>Beta</span> jobs - read a detailed <a href=\"https://cryosparc.com/blog/local-refinement-snRNP-case-study/\">tutorial</a> and <a href=\"https://cryosparc.com/blog/local-refinement/\">blog post</a> with usage instructions"
        },
        {
          "tag": "new",
          "description": "Sharpening job for post processing of refinement outputs. Every user should re-sharpen refinement outputs to ensure maximum map quality"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://discuss.cryosparc.com/t/how-to-clear-the-cache-in-v2/2161/11\">Command line option</a> to turn off SSD caching for an entire project"
        },
        {
          "tag": "update",
          "description": "Non-Uniform Refinement fixes for issue that caused peripheral artefacts on some datasets, speedups"
        },
        {
          "tag": "update",
          "description": "Volume tools can now be used to threshold, pad, and dilate masks"
        },
        {
          "tag": "update",
          "description": "Output separate <code>.mrc</code> files for templates included and templates excluded in select2D, for use with other template-pickers"
        },
        {
          "tag": "update",
          "description": "Added phase shifts to Manually Curate Exposures job"
        },
        {
          "tag": "update",
          "description": "Set default amplitude contrast value to <code>0.07</code> when importing <code>.star</code> files with particles"
        },
        {
          "tag": "update",
          "description": "Added parameter to specify Negative Stain images in Extract from Micrographs and Local Motion Correction to output particles with correct datasign"
        },
        {
          "tag": "fixed",
          "description": "Job scheduler now checks if all necessary inputs are connected before launching a job"
        },
        {
          "tag": "fixed",
          "description": "Bugfixes and performance improvements for Manually Curate Exposures"
        },
        {
          "tag": "fixed",
          "description": "Users can now <a href=\"https://cryosparc.com/docs/reference/general/#delete-a-project\">delete projects</a>"
        },
        {
          "tag": "fixed",
          "description": "Bash is no longer required to be the default shell on worker nodes"
        },
        {
          "tag": "fixed",
          "description": "Creation time displays correctly on projects and workspaces"
        },
        {
          "tag": "fixed",
          "description": "Added option to limit the number of plots made in Inspect Picks"
        },
        {
          "tag": "fixed",
          "description": "Local motion correction can now handle empty movies with no particles"
        },
        {
          "tag": "fixed",
          "description": "Plotting bug in Extract from Micrographs that inverted the printed particles"
        },
        {
          "tag": "fixed",
          "description": "Volume plots are now created and labelled with the correct axis convention"
        },
        {
          "tag": "fixed",
          "description": "2D classification CPU RAM allocation increased to avoid crashes on cluster systems"
        }
      ]
    },
    {
      "tag": "v2.1.0",
      "date": "08/31/2018",
      "items": [
        {
          "tag": "new",
          "description": "Standalone installation method for single-workstation instances - install cryoSPARC with only one line!"
        },
        {
          "tag": "new",
          "description": "It is now possible to delete workspaces with jobs, a prompt will specify which jobs will be deleted or removed from target workspace"
        },
        {
          "tag": "new",
          "description": "Custom job titles appear as label underneath job cards in the tree view for quick referencing"
        },
        {
          "tag": "update",
          "description": "When creating a new project you now just need to specify a container directory in which cryoSPARC can auto-manage project directory names and contents"
        },
        {
          "tag": "update",
          "description": "The dropdown for linking and moving jobs has been updated to allow for scrolling through many workspaces"
        },
        {
          "tag": "update",
          "description": "Various changes to the interface based on user feedback"
        },
        {
          "tag": "fixed",
          "description": "Improved stability for refinement of large particles (1024 pixels+)"
        },
        {
          "tag": "fixed",
          "description": "Users that run standalone instances of cryoSPARC don't require ssh keys to run jobs anymore"
        },
        {
          "tag": "fixed",
          "description": "Bug where deleted workspaces would show in the project view"
        }
      ]
    },
    {
      "tag": "v2.0.27",
      "date": "08/17/2018",
      "items": [
        {
          "tag": "release",
          "description": "Public release of cryoSPARC v2!"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://cryosparc.com/docs\">Documentation</a> and <a href=\"https://cryosparc.com/docs/tutorial\">Tutorial</a>"
        },
        {
          "tag": "new",
          "description": "Resource manager and queue view for active jobs"
        },
        {
          "tag": "new",
          "description": "User isolation: users can now see only their own projects, and choose to select other users to share projects with. Admin users can see all projects. Users can be limited to browse only particular directories"
        },
        {
          "tag": "new",
          "description": "Several UI updates and improvements, filters and searchability for projects and workspaces"
        },
        {
          "tag": "new",
          "description": "New installation and configuration commands"
        },
        {
          "tag": "update",
          "description": "Downsample particles job can now also highpass and lowpass filter particle images"
        },
        {
          "tag": "fixed",
          "description": "Bug fixes to enable SLURM and other cluster schedulers"
        }
      ]
    },
    {
      "tag": "v2.0.23",
      "date": "07/24/2018",
      "items": [
        {
          "tag": "new",
          "description": "Detailed <a href=\"https://github.com/cryoem-uoft/cryosparc2_public/blob/master/INSTALL.md\">Installation Guide</a> that has details of how to configure cryoSPARC v2, as well as documentation for admin and advanced functions"
        },
        {
          "tag": "new",
          "description": "Volume utility for upsampling, cropping, and flipping maps (for example after importing, or to correct the hand of an ab-initio result)"
        },
        {
          "tag": "new",
          "description": "Added settings for worker nodes to configure SSD cache quota and reserve space, on a per-node basis"
        },
        {
          "tag": "new",
          "description": "Import jobs can now import using environment variables like <code>$HOME</code>"
        },
        {
          "tag": "new",
          "description": "All jobs that use SSD caching now have an option to disable caching"
        },
        {
          "tag": "update",
          "description": "Updates to installation and configuration system, making cluster setup easier"
        },
        {
          "tag": "update",
          "description": "2D classification now has options to recenter and window class references during classification, helpful with crowding or when generating templates for picking. Re-centering is on by default"
        },
        {
          "tag": "update",
          "description": "2D classification now defaults to using colored noise, can yield better results in some cases (thanks to Oliver Clarke)"
        },
        {
          "tag": "update",
          "description": "Many parameter descriptions now expanded"
        },
        {
          "tag": "fixed",
          "description": "Bugfix in heterogeneous refinement that would cause over-sharpening"
        },
        {
          "tag": "fixed",
          "description": "Fix bug causing jobs to stall if they require files to be cached that are in use by another job"
        }
      ]
    },
    {
      "tag": "v2.0.20",
      "date": "07/06/2018",
      "items": [
        {
          "tag": "new",
          "description": "Exposure curation interactive job: allows population or individual-level inspection, sorting, and selecting subsets of exposures (movies/micrographs) based on CTF estimates, motion trajectories, particle picks, etc."
        },
        {
          "tag": "new",
          "description": "Multi-GPU motion correction (global and local)"
        },
        {
          "tag": "new",
          "description": "Support for loading <code>mrc.bz2</code> format movies and decompressing on the fly (using <code>pbzip2</code>)"
        },
        {
          "tag": "new",
          "description": "Wrapper for <a href=\"https://github.com/nysbc/Anisotropy\">3DFSC</a>"
        },
        {
          "tag": "new",
          "description": "Changelog on dashboard"
        },
        {
          "tag": "update",
          "description": "Tweaks/updates to non-uniform refinement <span class='tag tag--beta'>Beta</span>"
        },
        {
          "tag": "fixed",
          "description": "Fixes for GPUs in process-exclusive mode"
        },
        {
          "tag": "fixed",
          "description": "Fixes in GPU parallelized particle extraction"
        },
        {
          "tag": "fixed",
          "description": "Various bug fixes"
        }
      ]
    }
  ]
}
