{
 "items": [
  {
   "category": "Update", 
   "date": "2018-11-30T23:35:51.472758", 
   "description": "<ul>\n<li>Update: cryoSPARC now supports CUDA 9 and 10. </li>\n<li><strong>Note:</strong> Updating to this version will trigger a reinstallation of cryoSPARC dependencies. These are included in the installation bundle and should not cause any issues but updating could take longer than normal.</li>\n<li>Fixed: Bug in GCTF wrapper that caused problems when run in per-particle local CTF refinement mode.</li>\n<li>Fixed: Bug in exposure curation when some micrographs contained no particles.</li>\n</ul>", 
   "title": "v2.4.6"
  }, 
  {
   "category": "Update", 
   "date": "2018-11-08T12:55:40.621447", 
   "description": "<ul>\n<li>New: Wrapper for GCTF (BETA) <a href=\"https://cryosparc.com/docs/reference/jobs#ctf-estimation-gctf\">More details</a></li>\n<li>New: Wrapper for CTFFIND 4.1.10 <a href=\"https://cryosparc.com/docs/reference/jobs#ctf-estimation-ctffind\">More details</a></li>\n<li>New: Added lowpass filter option under Volume Tools </li>\n<li>New: Simulate Data (BETA) job to create particle images from up to two input volumes at random relative and global alignments </li>\n<li>Update: Jobs no longer run if required inputs are missing; user is prompted to connect required inputs before queuing is possible </li>\n<li>Update: Plotting projections of generated volume in Ab-Initio Reconstruction instead of slices. Refinements still plot slices</li>\n<li>Fixed: CTF error 'binary not found'</li>\n<li>Fixed: CTFFIND same filename issues</li>\n<li>Fixed: CudaFftError on some GPUs in compute-exclusive mode</li></ul>", 
   "title": "v2.4.2"
  }, 
  {
   "category": "Update", 
   "date": "2018-10-02T18:31:02.978123", 
   "description": "<ul>\n<li>New: Revamped job builder with support for low-level result connections, new outputs tab in job details view. <a href=\"https://cryosparc.com/docs/tutorials/job-builder\">Learn more</a></li>\n<li>New: Backup &amp; Restore cryoSPARC database through the command line. <a href=\"https://cryosparc.com/docs/reference/install/#backup--restore\">More details</a></li>\n<li>Update: Redesigned Select 2D interactive job including support for quick selection (all/none/invert) and sorting classes by number of particles, resolution, and effective classes assigned. <a href=\"https://cryosparc.com/docs/tutorials/t20s/#113-select-2d-classes-interactive\">Learn more</a></li>\n<li>Update: Volume tools can now be used to invert a mask</li>\n<li>Update: Added a volume premultiplier to Particle Subtraction to improve scaling of subtracted projections</li>\n<li>Update: Added option to not use halfmaps in Particle Subtraction</li>\n<li>Update: New dependency manager for packages and external binaries, making updates and fresh installations more robust</li>\n<li>Update: cryoSPARC username now available in cluster submission scripts. <a href=\"https://cryosparc.com/docs/reference/install/#installation-cluster\">More details</a></li>\n<li>Fixed: After queuing a job in the tree view, you will remain in the tree view when the details view is opened</li>\n<li>Fixed: Exposure curation bug fixes (handling NaNs in inputs, can input multiple numerals to edit selections, corrected phase_shift and fit_to values in CTF fit image)</li>\n<li>Fixed: Import volumes saves volume to the correct directory</li>\n<li>Fixed: Volume tools conversion between map/mask volume types</li>\n<li>Fixed: Non-uniform refinement now outputs a mask. Also removed duplicate volume outputs</li>\n<li>Fixed: Use per-particle scale factors in particle subtraction</li>\n<li>New: Project directory path now in the project details panel, copy it to your clipboard by clicking on it</li>\n<li>Fixed: CTFFIND file path reference pointed to an incorrect location, causing CTF Estimation jobs to fail</li>\n</ul>", 
   "title": "v2.3.2"
  }, 
  {
   "category": "Update", 
   "date": "2018-09-17T21:54:39.544055", 
   "description": "<ul>\n<li><strong>New:</strong> Local Refinement (BETA) and Particle Subtraction (BETA) jobs - read a detailed <a href=\"https://cryosparc.com/blog/local-refinement-snRNP-case-study/\">tutorial</a> and <a href=\"https://cryosparc.com/blog/local-refinement/\">blog post</a> with usage instructions</li>\n<li>New: Sharpening job for post processing of refinement outputs. Every user should re-sharpen refinement outputs to ensure maximum map quality</li>\n<li>Update: Non-Uniform Refinement fixes for issue that caused peripheral artefacts on some datasets, speedups</li>\n<li>New: <a href=\"https://discuss.cryosparc.com/t/how-to-clear-the-cache-in-v2/2161/11\">Command line option</a> to turn off SSD caching for an entire project</li>\n<li>Update: Volume tools can now be used to threshold, pad, and dilatemasks</li>\n<li>Update: Output separate .mrc files for templates included and templates excluded in select2D, for use with other template-pickers</li>\n<li>Update: Added phase shifts to Manually Curate Exposures job</li>\n<li>Update: Set default amplitude contrast value to 0.07 when importing .star files with particles</li>\n<li>Update: Added parameter to specify Negative Stain images in Extract from Micrographs and Local Motion Correction to output particles with correct datasign</li>\n<li>Fixed: Job scheduler now checks if all necessary inputs are connected before launching a job</li>\n<li>Fixed: Bugfixes and performance improvements for Manually Curate Exposures</li>\n<li>Fixed: Users can now <a href=\"https://cryosparc.com/docs/reference/general/#delete-a-project\">delete projects</a></li>\n<li>Fixed: Bash is no longer required to be the default shell on worker nodes</li>\n<li>Fixed: Creation time displays correctly on projects and workspaces</li>\n<li>Fixed: Added option to limit the number of plots made in Inspect Picks</li>\n<li>Fixed: Local motion correction can now handle empty movies with no particles</li>\n<li>Fixed: Plotting bug in Extract from Micrographs that inverted the printed particles</li>\n<li>Fixed: Volume plots are now created and labelled with the correct axis convention</li>\n<li>Fixed: 2D classification CPU RAM allocation increased to avoid crashes on cluster systems</li>\n</ul>", 
   "title": "v2.2.0"
  }, 
  {
   "category": "Update", 
   "date": "2018-08-31T17:30:00.000000", 
   "description": "<ul>\n<li>New: Standalone installation method for single-workstation instances - install cryoSPARC with only one line!</li>\n<li>New: It is now possible to delete workspaces with jobs, a prompt will specify which jobs will be deleted or removed from target workspace</li>\n<li>New: Custom job titles appear as label underneath job cards in the tree view for quick referencing</li>\n<li>Update: When creating a new project you now just need to specify a container directory in which cryoSPARC can auto-manage project directory names and contents</li>\n<li>Update: The dropdown for linking and moving jobs has been updated to allow for scrolling through many workspaces</li>\n<li>Update: Various changes to the interface based on user feedback</li>\n<li>Fixed: Improved stability for refinement of large particles (1024 pixels+)</li>\n<li>Fixed: Users that run standalone instances of cryoSPARC don't require ssh keys to run jobs anymore</li>\n<li>Fixed: Bug where deleted workspaces would show in the project view</li>\n</ul>", 
   "title": "v2.1.0"
  }, 
  {
   "category": "Update", 
   "date": "2018-08-17T09:50:01.915683", 
   "description": "<ul>\n<li>Public release of cryoSPARC v2!</li>\n<li>New <a href=\"https://cryosparc.com/docs\">Documentation</a> and <a href=\"https://cryosparc.com/docs/tutorial\">Tutorial</a></li>\n<li>All new dynamic Tree View for projects and workspaces that shows entire workflows, connections between jobs, automatically computes layouts, and is zoomable and scrollable to inspect and work with large projects</li>\n<li>New resource manager and queue view for active jobs</li>\n<li>New user isolation: users can now see only their own projects, and choose to select other users to share projects with. Admin users can see all projects. Users can be limited to browse only particular directories.</li>\n<li>Several UI updates and improvements, filters and searchability for projects and workspaces</li>\n<li>Downsample particles job can now also highpass and lowpass filter particle images</li>\n<li>New installation and configuration commands</li>\n<li>Bug fixes to enable SLURM and other cluster schedulers</li>\n</ul>", 
   "title": "v2.0.27"
  }, 
  {
   "category": "Update", 
   "date": "2018-07-24T01:38:38.814254", 
   "description": "<ul>\n<li>Updates to installation and configuration system, making cluster setup easier</li>\n<li>New detailed <a href=\"https://github.com/cryoem-uoft/cryosparc2_public/blob/master/INSTALL.md\">Installation Guide</a> that has details of how to configure cryoSPARC v2, as well as documentation for admin and advanced functions</li>\n<li>2D classification now has options to recenter and window class references during classification, helpful with crowding or when generating templates for picking. Re-centering is on by default.</li>\n<li>2D classification now defaults to using colored noise, can yield better results in some cases (thanks to Oliver Clarke)</li>\n<li>New volume utility for upsampling, cropping, and flipping maps (for example after importing, or to correct the hand of an ab-initio result)</li>\n<li>Bugfix in heterogeneous refinement that would cause over-sharpening</li>\n<li>All jobs that use SSD caching now have an option to disable caching</li>\n<li>New settings for worker nodes to configure SSD cache quota and reserve space, on a per-node basis</li>\n<li>Import jobs can now import using environment variables like <code>$HOME</code></li>\n<li>Fix bug causing jobs to stall if they require files to be cached that are in use by another job</li>\n<li>Many parameter descriptions now expanded</li>\n</ul>", 
   "title": "v2.0.23"
  }, 
  {
   "category": "Update", 
   "date": "2018-07-06T13:40:46.891178", 
   "description": "<ul>\n<li><strong>NEW</strong> Exposure curation interactive job: allows population or individual-level inspection, sorting, and selecting subsets of exposures (movies/micrographs) based on CTF estimates, motion trajectories, particle picks, etc.</li>\n<li>Fixes for GPUs in process-exclusive mode</li>\n<li>Fixes in GPU parallelized particle extraction</li>\n<li>Support for loading <code>mrc.bz2</code> format movies and decompressing on the fly (using <code>pbzip2</code>)</li>\n<li>Multi-GPU motion correction (global and local)</li>\n<li>Tweaks/updates to non-uniform refinement (beta)</li>\n<li>New wrapper for <a href=\"https://github.com/nysbc/Anisotropy\">3DFSC</a></li>\n<li>Changelog on dashboard</li>\n<li>Various bug fixes</li>\n</ul>", 
   "title": "v2.0.20"
  }
 ]
}