{
  "versions": [
    {
      "tag": "v3.2.0",
      "date": "03/29/2021",
      "items": [
        {
          "tag": "new",
          "description": "Added option for sorting jobs by date and title. Projects and workspaces can be sorted by title as well" 
        },
        {
          "tag": "new",
          "description": "Check Particles job for verifying data integrity of particle stacks [Patch 210511]" 
        },
        {
          "tag": "new",
          "description": "Computational batch size parameter in Heterogeneous Refinement job [Patch 210511]" 
        },
        {
          "tag": "new",
          "description": "<code>cryosparcm changeport</code> command and related utilities for changing the base port [Patch 210601]" 
        },
        {
          "tag": "update",
          "description": "Substantially improved performance in iterative particle-processing jobs (2D Classification, Refinement) when particles are stored on some types of filesystems (including FSx for Lustre), resolving cases where some users found that jobs run in v3.1 were slower than in v2.15"
        },
        {
          "tag": "update",
          "description": "Deep Particle Picking jobs (Deep Picker Train, Deep Picker Inference) now require CUDA Toolkit 11+"
        },
        {
          "tag": "update",
          "description": "The 'Metadata' tab within the job preview dialog is more performant and features expandable sections and colour highlighting based on data type"
        },
        {
          "tag": "update",
          "description": "Import Particles no longer ignores the <code>rlnImagePixelSize</code> column while trying to import a particle <code>.star</code> file"
        },
        {
          "tag": "update",
          "description": "CryoSPARC processes are now less likely to become orphaned due to more robust supervisor management configuration"
        },
        {
          "tag": "update",
          "description": "Removed unused cuBLAS dependency that caused multiple GPU contexts on all GPUs in a system to be created even when using only a single GPU"
        },
        {
          "tag": "update",
          "description": "GPU status info is now updated when a worker is connected for the first time, or when a worker connection is updated"
        },
        {
          "tag": "update",
          "description": "New option to work around bug in CUDA on CentOS 7 that causes <code>cuMemHostAlloc failed</code> errors in multiple job types. To engage this, add <code>export CRYOSPARC_NO_PAGELOCK=true</code> to the <code>cryosparc_worker/config.sh</code> file."
        },
        {
          "tag": "update",
          "description": "Patch CTF Estimation no longer fails when encountering an error on a specific micrograph. Failed micrographs are outputted to a separate group if exceptions are encountered and processing continues."
        },
        {
          "tag": "update",
          "description": "Local Resolution job now prints local resolution statistics (minimum, median, maximum, 25th percentile, 75th percentile) in job event log [Patch 210401]"
        },
        {
          "tag": "update",
          "description": "CryoSPARC Live Data Management now supports executing a script upon a datatype's state change. Add <code>export CRYOSPARC_LIVE_DATA_MANAGEMENT_SCRIPT_ENABLE=true</code> and <code>export CRYOSPARC_LIVE_DATA_MANAGEMENT_SCRIPT_PATH=/path/to/script.sh</code> in <code>cryosparc_master/config.sh</code> to enable this feature [Patch 210401]"
        },
        {
          "tag": "fixed",
          "description": "Issue in Patch Motion that causes dose weighting to be incorrectly applied in some cases. This was caused by the introduction of variable-dose support in v3.1."
        },
        {
          "tag": "fixed",
          "description": "Patch CTF Estimation fails with <code>IndexError: index 0 is out of bounds for axis 0 with size 0</code>"
        },
        {
          "tag": "fixed",
          "description": "Patch CTF Estimation fails with <code>ValueError: Axis limits cannot be NaN or Inf</code>"
        },
        {
          "tag": "fixed",
          "description": "Patch CTF Estimation sometimes reports underestimated CTF fit resolution in cryoSPARC Live, in cases where the correlation between the fit and the actual signal is very poor at low resolutions"
        },
        {
          "tag": "fixed",
          "description": "Issue that can cause exposure groups set up at import to be lost during processing, specifically through wrapper jobs for GCTF or CTFFIND"
        },
        {
          "tag": "fixed",
          "description": "Issue where Deep Picker Train job would fail reporting that there are no training particles on any micrographs"
        },
        {
          "tag": "fixed",
          "description": "Topaz wrapper TypeError during negative stain processing: can't multiple sequence by non-int of type <code>numpy.float32</code>"
        },
        {
          "tag": "fixed",
          "description": "Issue causing <code>IndexError</code> in wrapper for Motioncor2"
        },
        {
          "tag": "fixed",
          "description": "Issue in particle simulator job where all particles would be modulated by the same CTF regardless of specified input CTF parameters"
        },
        {
          "tag": "fixed",
          "description": "Issue in <code>cryosparcm cli delete_user</code> command that prevented an admin user from being authenticated"
        },
        {
          "tag": "fixed",
          "description": "Issue in Extract From Micrographs (CPU) job requiring a GPU dependency, causing it to fail on CPU-only workstations"
        },
        {
          "tag": "fixed",
          "description": "Import Job/Import Result Group fails with <code>Unable to find data referenced by cs files</code> when importing a <code>mscope_params</code> result group due to empty fields [Patch 210401]"
        },
        {
          "tag": "fixed",
          "description": "Local Motion correction with EER data [Patch 210413]"
        },
        {
          "tag": "fixed",
          "description": "Jobs no longer wait on cache forever after the cache is unlocked in other jobs [Patch 210413]"
        },
        {
          "tag": "fixed",
          "description": "Restore missing \"Use Class Weights\" parameter in Deep Picker Train job [Patch 210413]"
        },
        {
          "tag": "fixed",
          "description": "Prevent <code>LD_PRELOAD</code> warning when launching cluster jobs [Patch 210413]"
        },
        {
          "tag": "fixed",
          "description": "<code>ValueError</code> during 3DFSC job volume output stage [Patch 210511]"
        },
        {
          "tag": "fixed",
          "description": "Empty workspaces after importing project [Patch 210511]"
        },
        {
          "tag": "fixed",
          "description": "Prevent error when extracting particles generated by Topaz [Patch 210601]"
        },
        {
          "tag": "fixed",
          "description": "Prevent error in Deep Inference job during plotting [Patch 210601]"
        },
        {
          "tag": "fixed",
          "description": "Improved error messages when reading invalid exposures or particle stacks [Patch 210601]"
        },
        {
          "tag": "fixed",
          "description": "Prevent numeric initialization error in Ab-Initio Reconstruction jobs for some systems [Patch 210615]"
        },
        {
          "tag": "fixed",
          "description": "Prevent numeric error in Inspect Picks job [Patch 210615]"
        }
      ]
    },
    {
      "tag": "v3.1.0",
      "date": "01/28/2021",
      "items": [
        {
          "tag": "new",
          "description": "Local Refinement (NEW! BETA) job, supporting features including: <ul><li>→ Non-Uniform regularization and adaptive pose marginalization</li><li>→ Alignment priors for soft penalization of unlikely poses</li><li>→ Reconstruction using higher-order CTF aberrations</li><li>→ Enforced point-group symmetry</li></ul>" 
        },
        {
          "tag": "new",
          "description": "Helical Processing feature improvements: <ul><li>→ Helical refinement now supports Non-Uniform regularization</li><li>→ Symmetry expansion now supports helical symmetry</li><li>→ In helical refinement, shifts along the helical axis can be limited to the asymmetric unit, improving resolutions for many datasets</li><li>→ \"z-clip\" parameter added to helical refinement's dynamic masking, to generate a mask covering only the central region along the z-axis</li></ul>" 
        },
        {
          "tag": "new",
          "description": "New Extract from Micrographs (CPU) job, supporting particle extraction on CPU in parallel using multiple cores." 
        },
        {
          "tag": "new",
          "description": "Admin users can now modify the list of users in which a project is shared with" 
        },
        {
          "tag": "update",
          "description": "Major updates to SSD caching to avoid issues of <code>Detected file change due to change in file size</code> and improve performance"
        },
        {
          "tag": "update",
          "description": "Several robustness improvements for Patch-CTF Estimation. Previous behaviour can be enabled using \"Classic mode\" parameter."
        },
        {
          "tag": "update",
          "description": "You can now quickly queue interactive jobs via the job details in the sidebar. The queue dialog has also been updated to clarify what machine the interactive jobs will run on."
        },
        {
          "tag": "update",
          "description": "Import Movies and Patch Motion now skip bad files instead of failing. Skipped files are added as a separate output."
        },
        {
          "tag": "update",
          "description": "Import Particles no longer ignores the <code>data_optics</code> section while trying to import a particle .star file. Exposure groups and CTF parameters other than high-order aberrations are retained from <code>data_optics</code> table."
        },
        {
          "tag": "update",
          "description": "Rebalance 2D Classes now has a \"Override maximum superclass size\" parameter that can be set to override the maximum size of all superclasses"
        },
        {
          "tag": "update",
          "description": "When launching a job, hidden files (files that start with a '.') will be ignored when checking if the job directory is empty if the <code>CRYOSPARC_IGNORE_HIDDEN_FILES</code> environment variable exists (add to <code>cryosparc_master/config.sh</code>)"
        },
        {
          "tag": "update",
          "description": "Homogeneous Reconstruct now has the option to reconstruct with helical symmetry, and to reconstruct with an inverted hand"
        },
        {
          "tag": "update",
          "description": "Homogeneous Reconstruct now supports input alignments on any pixel size, regardless of the reconstruction pixel size"
        },
        {
          "tag": "update",
          "description": "cryoSPARC Job Scheduler will now ignore CPU requirements when queuing jobs to non-cluster lanes; only RAM and GPU will be considered"
        },
        {
          "tag": "update",
          "description": "Change the parameter \"Remove leading UID in input micrograph path\" in Import Particles to be optional"
        },
        {
          "tag": "fixed",
          "description": "Discussion forum topics have returned to the dashboard"
        },
        {
          "tag": "fixed",
          "description": "Some users were unable to create an account or reset their password in Chrome"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug in Import Particles that caused it will fail when trying to convert <code>rlnOriginX/rlnOriginY</code> to <code>rlnOriginXAngst/rlnOriginYAngst</code> while importing Relion 3.1 star files"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused the cryoSPARC start process to not complete"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused the string of characters appended to the micrograph file paths created by cryoSPARC to be a variable length (now 21 characters)"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused the Import Project function to fail with <code>_pickle.UnpicklingError: could not find MARK</code>"
        },
        {
          "tag": "fixed",
          "description": "Filament tracer now eliminates particles beyond the micrograph's edge"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that prevented the Rebalance 2D Classes job from launching on clusters"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug in the Volume Tools job that gave erroneous output when the \"Invert mask\" and \"Fill holes\" options were both true"
        },
        {
          "tag": "fixed",
          "description": "Fixed a plotting issue in Heterogeneous Refinement causing orientation plots to fail with a <code>ValueError</code>"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue that prevented pre-v3.0 Extract From Micrographs, 2D Classification, and Create Templates jobs from being cleared"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue causing static masks to be improperly resized in Homogeneous Refinement New, Non-Uniform Refinement New, and Helical Refinement"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue preventing Helical Refinement from running with static masks that were sampled on a different grid than the volume; fixed related bug with static masks being improperly rotated when the \"Align input structure to helical (z) axis\" parameter was activated"
        },
        {
          "tag": "fixed",
          "description": "Fixed bug where running \"Clear Intermediate Results\" on a project caused the outputs of Curate Exposures jobs within the project to be inadvertently deleted."
        },
        {
          "tag": "fixed",
          "description": "Add support for pre-release versions of Topaz"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where job queue modal would display incorrect default lane/target info when 'default' lane doesn't exist"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where systemd service used wrong python interpreter"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where deleted sessions still appear in cryoSPARC Live browse view"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue in <code>cryosparcm updateuser</code> when using <code>lastname</code> flag"
        },
        {
          "tag": "fixed",
          "description": "Fixed IndexError in motioncor2 wrapper job"
        },
        {
          "tag": "fixed",
          "description": "Fixed issue where Topaz denoise would not work"
        },
        {
          "tag": "new",
          "description": "Clicking on the number of failed exposures in the navigation sidebar will open a dialog displaying the error details for each exposure" 
        },
        {
          "tag": "fixed",
          "description": "Fixed a case where a deleted session would display in the browse page when selected"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug that caused manual picks on \"Test\" exposures to be excluded from session statistics and from being extracted"
        },
        {
          "tag": "fixed",
          "description": "Job cards in the \"current jobs\" and \"target\" modals will now open their respective job modals when clicked. Job cards will also display the job's priority if one has been set"
        },
        {
          "tag": "fixed",
          "description": "Fixed a bug in the cryoSPARC Live Worker that caused it to fail repeatedly due to uncaught exceptions caused by IO errors"
        },
        {
          "tag": "fixed",
          "description": "Blob and template particle diameters are now correctly shown as Å values"
        }
      ]
    },
    {
      "tag": "v3.0.1",
      "date": "12/15/2020",
      "items": [
        {
          "tag": "update",
          "description": "Disable existing conda environments before activating cryoSPARC's conda environment"
        },
        {
          "tag": "fixed",
          "description": "Specifying initial user credentials in install.sh fails with \"improper usage\" because of incorrect arguments"
        },
        {
          "tag": "fixed",
          "description": "Command <code>cryosparcm updateuser</code> fails because of incorrect arguments"
        },
        {
          "tag": "fixed",
          "description": "cURL symbol lookup error on CentOS8 when starting cryoSPARC after update to v3.0.0"
        },
        {
          "tag": "fixed",
          "description": "Importing Projects from v2.15.0 or earlier into v3.0.0 fails with UnicodeDecodeError"
        },
        {
          "tag": "fixed",
          "description": "Command <code>cryosparcw newcuda</code> uses old pyCUDA binary that doesn't exist"
        },
        {
          "tag": "fixed",
          "description": "Deleting an Extract From Micrographs job fails with KeyError"
        },
        {
          "tag": "fixed",
          "description": "Importing particle pose information in Import Particles fails with TypeError"
        },
        {
          "tag": "fixed",
          "description": "Command <code>cryosparcm backup</code> fails if cryoSPARC is turned off"
        },
        {
          "tag": "fixed",
          "description": "Inspect Picks job fails with ValueError if using micrographs imported with \"Constant CTF\" parameter"
        },
        {
          "tag": "fixed",
          "description": "Symmetry Search Utility job fails with TypeError in \"rise\" mode"
        }
      ]
    },
    {
      "tag": "v3.0.0",
      "date": "12/09/2020",
      "items": [
        {
          "tag": "new",
          "description": "New and improved cryoSPARC Live app, redesigned and reworked for robust and seamless real-time end-to-end cryo-EM data processing. CryoSPARC Live is built for data collection facilities, cryo-EM cores, industry labs, microscope operators and individual users who want to perform real-time cryo-EM data quality assessment and decision-making based on streaming 2D and 3D results that update in time with new data. CryoSPARC Live is also now the best and fastest way for users to perform their first-cut processing and curation on already available data. <ul><li>→ Expedited and optimized preprocessing, <a href=\"https://guide.cryosparc.com/live/performance-metrics\">enabling up to 600+ movies per hour per GPU</a> (motion correction, CTF estimation, particle picking and extraction)</li><li>→ The ability to seamlessly reprocess data at any time, to curate exposures, test/refine picking strategies and the choice of particles for refinement, on the fly</li><li>→ <em>Streaming 2D classification</em>, in-line <em>Ab-initio Reconstruction</em>, and <em>Streaming high-resolution 3D Refinement</em>, which update automatically as new particles become available</li><li>→ Seamless integration with cryoSPARC, allowing for direct advanced processing from the results generated in cryoSPARC Live without any data shuffling</li></ul>" 
        },
        {
          "tag": "new",
          "description": "After extensive beta testing globally, cryoSPARC Live is now available free of charge for general academic use. To learn more and to access Live, please see: <a href=\"https://guide.cryosparc.com\">guide.cryosparc.com</a><ul><li>→ Watch Now: <a href=\"https://guide.cryosparc.com/live/tutorial-videos\">CryoSPARC Live Walkthrough</li></ul>"
        },
        {
          "tag": "new",
          "description": "Improved <em>Non-Uniform Refinement</em> algorithm <span class='tag tag--new'>NEW</span> and job type <span class='tag tag--beta'>Beta</span>. Higher resolution results and reduced sensitivity to parameter changes. For more details, see the new paper published in <a href=\"https://www.nature.com/articles/s41592-020-00990-8\">Nature Methods</a> Plus: <ul><li>→ Support for local and global CTF refinement during non-uniform refinement</li><li>→ Fast, new GPU implementation of non-uniform regularization developed with support from NVIDIA</li><li>→ Additionally, support for automatic adaptive marginalization over alignment variables (enabled by default) yielding further improvements for small molecules.</li></ul>"
        },
        {
          "tag": "new",
          "description": "Upgraded to modern Python 3.7 runtime, including new updated dependencies and installation. Easy upgrades and downgrades between cryoSPARC v2 and v3."
        },
        {
          "tag": "new",
          "description": "Support for CUDA 11 + Ampere Architecture GPUs (3080, 3090, A100, etc.). <ul><li>→ Please ensure you’re running the latest NVIDIA Driver compatible with your GPU and CUDA Toolkit version. <a href=\"https://www.nvidia.com/Download/index.aspx\">You can download the latest driver for your GPUs here</a>. Visit <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/troubleshooting#gpu-issues\">Troubleshooting</a> for common GPU errors.</li></ul>"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-eer-file-support\">Full support for Thermo Fisher Scientific EER data</a> in cryoSPARC and cryoSPARC Live. EER data is decompressed on the fly and can be upsampled and split into the desired number of fractions during processing."
        },
        {
          "tag": "new",
          "description": "Improved defect file and defect pixel support in motion correction jobs in cryoSPARC and cryoSPARC Live. Defect pixels can be specified in a <code>.txt</code> defect file or as zeros in the gain reference."
        },
        {
          "tag": "new",
          "description": "Helical Reconstruction <span class='tag tag--beta'>BETA</span>: New suite of tools for end-to-end helical processing and refinement, including: <ul><li>→ <span class='tag tag--new'>NEW</span> high-resolution Helical Refinement job that also supports non-uniform regularization, and enforcement and local optimization of helical symmetry</li><li>→ <span class='tag tag--new'>NEW</span> <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/particle-picking/job-filament-tracer-beta\">Filament Tracer</a> job tailored to the picking of filaments</li><li>→ Updates to <em>Inspect Particle Picks</em> to allow pruning of filament picks by curvature</li><li>→ <span class='tag tag--new'>New</span> <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/helical-reconstruction-beta/job-symmetry-search-utility-beta\"></a>Symmetry search utility</a> for exploring the symmetry space in a helical volume</li></ul>"
        },
        {
          "tag": "new",
          "description": "<em>Extract From Micrographs</em> will now re-center particles by default if they have already been extracted and aligned through 2D classification, 3D reconstruction, or refinement."
        },
        {
          "tag": "new",
          "description": "<span class='tag tag--new'>New</span> <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/3d-refinement/job-homogeneous-reconstruction-only\">Homogeneous Reconstruction Only</a> job type that performs 3D reconstruction from previously aligned particle images."
        },
        {
          "tag": "new",
          "description": "Ability to set priority values for jobs and users in cryoSPARC and cryoSPARC Live, allowing jobs to run in priority order instead of the order they were queued. Learn more about this feature with our <a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/tutorial-priority-job-queuing\">Guide to Priority Job Queuing</a>"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://guide.cryosparc.com/processing-data/tutorials-and-case-studies/cryosparc-live-session-data-management\">CryoSPARC Live Session Data Management:</a> View, delete and archive data created by cryoSPARC Live on a granular level. Save space taken up by data generated in old sessions and projects, while still being able to browse and view results."
        },
        {
          "tag": "new",
          "description": "A new Data Management tab is available in the Resource Manager in cryoSPARC, displaying details of all projects and workspaces available to the logged in user. At-a-glance information includes: project creation and ownership info, project directory location, last accessed/viewed, project size and other details."
        },
        {
          "tag": "new",
          "description": "Reduced GPU memory footprint in Patch Motion Correction. The overall GPU memory footprint of patch motion correction has been reduced. This enables most K3-sized image data to be processed on 11GB GPUs. Additionally, a \"low-memory mode\" switch is now available, which reduces it even further (at expense of speed)."
        },
        {
          "tag": "new",
          "description": "<span class='tag tag--new'>New</span> <a href=\"https://guide.cryosparc.com/processing-data/all-job-types-in-cryosparc/utilities/job-remove-duplicate-particles\">Remove Duplicate Particles job</a> checks for particles that are extracted too close together on a micrograph and keeps only one, to allow combining picks from multiple pickers without affecting FSC estimates."
        },
        {
          "tag": "new",
          "description": "<span class='tag tag--beta'>Beta</span> Patch Motion Correction in cryoSPARC and cryoSPARC Live now optionally support movie data that has been saved with a variable dose rate among frames (e.g., from Leginon)"
        },
        {
          "tag": "new",
          "description": "<span class='tag tag--new'>New</span> <a href=\"https://guide.cryosparc.com/setup-configuration-and-management/management-and-monitoring/optional-cryosparc-and-systemd\">Systemd Unit File</a> to restart cryoSPARC after server shutdown: A systemd unit file is now included to allow running cryoSPARC as a service."
        },
        {
          "tag": "update",
          "description": "Improvements to <em>Patch CTF estimation</em> for better CTF fit in cases where background or envelope estimation is difficult. Improved robustness in relative ice thickness measure."
        },
        {
          "tag": "update",
          "description": "<em>Downsample Particles</em> and <em>Extract from Micrographs</em> will now correctly scale particle alignment shifts, fixing issues where downsample was used immediately prior to local refinement or 3D variability."
        },
        {
          "tag": "update",
          "description": "Orientation distribution and posterior precision plots were added to <em>Heterogeneous Refinement</em>, and can be disabled by turning off the \"Show viewing orientation distribution plots\" parameter."
        },
        {
          "tag": "update",
          "description": "<em>Import Micrographs</em> now has an option to output constant CTF values, so that subsequent steps will ignore the CTF entirely. Useful for negative stain and exotic data collection."
        },
        {
          "tag": "update",
          "description": "Improved <code>cryosparcm patch</code> pre-apply validation."
        },
        {
          "tag": "update",
          "description": "Reduced SSD-cache coordination bandwidth, improving the robustness of caching on multi-node systems."
        },
        {
          "tag": "update",
          "description": "Smarter cluster job ID parsing following cluster submission. Ability to use shell redirects in cluster submission commands, enabling native support for the LSF cluster management system."
        },
        {
          "tag": "update",
          "description": "Each project, workspace and job now records a 'last accessed' timestamp, updating whenever a user views the project, workspace or job through the web application interface. This allows for administrators to quickly identify and remove/archive data that is no longer used."
        },
        {
          "tag": "update",
          "description": "Queuing interactive jobs always default to the master node."
        },
        {
          "tag": "update",
          "description": "Ability to specify a first and last name for new users in the Admin panel and through the command line interface."
        },
        {
          "tag": "update",
          "description": "Default umask is now <code>002</code>, to allow write permissions by 'group' for folders created by cryoSPARC."
        },
        {
          "tag": "update",
          "description": "Renamed internal installation directories from <code>cryosparc2_*</code> to <code>cryosparc_*</code>"
        },
        {
          "tag": "fixed",
          "description": "<em>Import Particles</em> job fixes: Importing particle locations using micrographs created in v2.15+ failed because of a variable length UID prepended to the path of each micrograph; Using the \"ignore raw data\" parameter causes the job to fail with a missing pixel size error; Support for offsets specified in angstroms (<code>_rlnOriginXAngst</code>, <code>_rlnOriginYAngst</code>)."
        },
        {
          "tag": "fixed",
          "description": "Import result group fails if some path fields are blank."
        },
        {
          "tag": "fixed",
          "description": "<em>Inspect Picks</em> \"use_denoise\" button failed to actually load denoised micrographs, even if they were connected."
        },
        {
          "tag": "fixed",
          "description": " <em>Local Refinement</em> now respects the static masking and minimization-over-per-particle-scale parameters, which were previously not used correctly."
        },
        {
          "tag": "fixed",
          "description": "Setting \"Override number of iterations\" to True without providing a number of iterations previously prevented Local Refinement from ever terminating."
        },
        {
          "tag": "fixed",
          "description": "<em>Non-Uniform Refinement</em>: Local processing causes an error if masks are too close to the edge of the refinement box."
        },
        {
          "tag": "fixed",
          "description": "<em>Local Filtering</em> had <code>SSD:True</code> hard-coded, causing it to fail when running on resources without SSDs."
        },
        {
          "tag": "fixed",
          "description": "Usernames are now correctly displayed in the details panel for a job."
        }
      ]
    },
    {
      "tag": "v2.15.0",
      "date": "05/13/2020",
      "items": [
        {
          "tag": "new",
          "description": "First version of a new, comprehensive cryoSPARC guide! Available at <a href=\"https://guide.cryosparc.com\">guide.cryosparc.com</a> (Beta). This guide will consolidate all existing documentation and be populated with cryo-EM data processing tutorials, tips, descriptions of methods, case studies, etc."
        },
        {
          "tag": "new",
          "description": "Use the new <code>cryosparcm patch</code> command to install bug fixes and improvements without a full update"
        },
        {
          "tag": "new",
          "description": "It is now possible to set a project-level default value for whether or not to cache particle images to the local SSD before running jobs within a project. The parameter can be adjusted from the sidebar when a project is selected"
        },
        {
          "tag": "new",
          "description": "New <em>Particle Class Probability Filter</em> job: Filter particles based on the probability of matching their assigned 2D or 3D classes"
        },
        {
          "tag": "update",
          "description": "In the <em>Topaz Denoise</em> job, the default values for the following parameters have been altered to better suit Topaz: The default value for the \"shape of split micrographs\" parameter has been changed to 1536. The default value for the \"padding around each split micrograph\" parameter has been changed to 256."
        },
        {
          "tag": "update",
          "description": "The <em>Topaz Cross-Validation</em> job has been updated with various improvements: Added option to output models from subsidiary training jobs when running cross-validation. Added expected number of particles and training radius as cross-validation parameters. Improved GPU distribution for subsidiary training jobs."
        },
        {
          "tag": "update",
          "description": "All Topaz jobs now store preprocessed micrographs to avoid unnecessary preprocessing in subsequent Topaz jobs."
        },
        {
          "tag": "update",
          "description": "Added option for the <em>Extensive Workflow</em> to run additional job types, including <em>Local Motion Correction</em>, Multi-class <em>ab-initio</em> and <em>3D Variability</em>. This can be used as a full system test for new installs and updates."
        },
        {
          "tag": "update",
          "description": "Use dynamically-generated SSD cache paths by including environment variables in the <code>CRYOSPARC_SSD_PATH</code> definition for a worker's <code>config.sh</code>"
        },
        {
          "tag": "update",
          "description": "<em>Import Movies</em> and <em>Import Micrographs</em> jobs are now parallelizable across multiple threads while reading the headers of all exposures to import"
        },
        {
          "tag": "update",
          "description": "Initial and final mini-batch size parameters for <em>Ab-initio Reconstruction</em> can now be set to zero to automatically tune based on the estimated particle size"
        },
        {
          "tag": "update",
          "description": "The project and workspace switchers, which allow you to quickly search and navigate, have been revamped. When you're viewing a project or workspace, the switcher will highlight and scroll to it, allowing you to easily navigate relative to them. When viewing a job within a workspace, the workspace switcher will display a link icon next to every workspace that particular job is linked to."
        },
        {
          "tag": "update",
          "description": "The job history tab within the resource manager page now shows only jobs that have not been deleted by default. Select the 'show deleted' toggle to show only jobs that have been deleted."
        },
        {
          "tag": "update",
          "description": "Jobs can now only be imported from inside the project directory. This fixes a bug that causes particles to not be cached if they were imported from outside the project."
        },
        {
          "tag": "update",
          "description": "Executing a <code>cryosparcm</code> command is now only allowed by the owner of the script and on the master node. You can override this parameter by setting <code>CRYOSPARC_FORCE_USER</code> or <code>CRYOSPARC_FORCE_HOSTNAME</code> to <code>true</code> in your shell (or permanently inside <code>cryosparc2_master/config.sh</code>)."
        },
        {
          "tag": "fixed",
          "description": "Bug where multiple jobs launched simultaneously using the same particles could result in endless \"cache waiting\" messages"
        },
        {
          "tag": "fixed",
          "description": "<em>Full-frame Motion Correction</em> runs out of memory on 8GB cards with K3 data. There is now a switch to reduce memory usage by approximately half"
        },
        {
          "tag": "fixed",
          "description": "<code>ValueError</code> was raised in <em>2D classification</em> or <em>Patch CTF Estimation</em> jobs when movies that were imported separately but contain files with the same names get overwritten"
        },
        {
          "tag": "fixed",
          "description": "All refinement jobs now use the first (rather than last) FSC threshold crossing for filtering during iterations"
        },
        {
          "tag": "fixed",
          "description": "Bug in <em>Particle Set Tools</em> intersection when set A is smaller than set B"
        },
        {
          "tag": "fixed",
          "description": "Bug in <em>Heterogeneous Refinement</em> which fails if intermediate plots are disabled"
        },
        {
          "tag": "fixed",
          "description": "<em>Manual Picker</em> fails while calculating the contrast intensity range for a micrograph with an irregular shape"
        },
        {
          "tag": "fixed",
          "description": "Topaz Denoised micrographs display fail to display correctly in the <em>Manual Picker</em> job (as either gray or black images)"
        },
        {
          "tag": "fixed",
          "description": "Micrographs captured at a low magnification fail during <em>Patch CTF Estimation</em> with an <code>IndexError</code>"
        },
        {
          "tag": "fixed",
          "description": "<em>Select 2D</em> fails when trying to select classes from a particle <code>.mrc</code> file that is too large to fit in memory. Also fixed a bug where an <code>IndexError</code> is raised if a class has less than 3 particles in it."
        },
        {
          "tag": "fixed",
          "description": "<em>Exposure Group Utility</em> job fails with a <code>KeyError</code> when an input dataset has a missing CTF result field"
        },
        {
          "tag": "fixed",
          "description": "<em>Inspect Picks</em> job fails if you try to extract locations and the box size set is not an even number"
        },
        {
          "tag": "fixed",
          "description": "<em>Downsample Particles</em> now exports particles in the correct order if the input particles are out of order on disk"
        },
        {
          "tag": "fixed",
          "description": "<em>MotionCor2</em> Wrapper: <code>total dose</code> is incorrectly specified as the <code>frame dose</code> argument for dose weighting"
        },
        {
          "tag": "fixed",
          "description": "<em>MotionCor2</em> Wrapper: output pixel size is incorrect after specifying a Fourier crop factor, causing CTF Estimates to fail"
        },
        {
          "tag": "fixed",
          "description": "Project directory sizes don't update when a project is deleted"
        },
        {
          "tag": "fixed",
          "description": "Allow importing movies shot on high-aspect ratio detectors (2:1 aspect ratio or higher)"
        },
        {
          "tag": "fixed",
          "description": "Resolved version incompatibilities with Topaz version <code>0.2.4a</code>"
        }
      ]
    },
    {
      "tag": "v2.14.2",
      "date": "02/21/2020",
      "items": [
        {
          "tag": "new",
          "description": "The job builder includes a search bar to quickly find the job you're looking for"
        },
        {
          "tag": "update",
          "description": "Many optimizations across cryoSPARC jobs - datasets containing a large number of items will see significant speedups"
        },
        {
          "tag": "update",
          "description": "Added option to use pre-trained initializations in Topaz Train"
        },
        {
          "tag": "update",
          "description": "Added option to use pre-trained model when running Topaz Extract"
        },
        {
          "tag": "fixed",
          "description": "Topaz Denoise fails when trained model is input"
        },
        {
          "tag": "fixed",
          "description": "Template Picker fails on K3 micrographs motion corrected using external software"
        },
        {
          "tag": "update",
          "description": "All jobs that output FSC plots have been updated to allow for downloading the raw data for external plotting"
        },
        {
          "tag": "update",
          "description": "Curate Exposures job can be run without connecting micrographs, allowing for CTF-based curation using only movies"
        },
        {
          "tag": "new",
          "description": "\"Cache Particles on SSD\" Job that will cache particles on a node of your choice"
        },
        {
          "tag": "fixed",
          "description": "Turning on the \"Generate new FSC Mask\" parameter in the Sharpening Tools job caused an <code>AssertionError</code>"
        },
        {
          "tag": "fixed",
          "description": "\"Particles Excluded\" output group image in Select2D job was the same as the \"Particles Included\" output group image"
        },
        {
          "tag": "fixed",
          "description": "New Homogeneous Refinement job sometimes fails when resampling initial model because boxes were not even sized"
        },
        {
          "tag": "fixed",
          "description": "Performance regressions in the \"Extract from Micrographs\" job where the time to extract particles increased non-linearly with a larger number of exposures"
        },
        {
          "tag": "fixed",
          "description": "\"Inspect Particle Picks\" job fails with a <code>KeyError</code> when it encounters an exposure with no particle locations"
        }
      ]
    },
    {
      "tag": "v2.13.2",
      "date": "01/30/2020",
      "items": [
        {
          "tag": "new",
          "description": "The 3D Variability Display job output now includes an in-browser, in-line interactive 3D scatter plot to analyze clusters in the distribution of particle reaction coordinates! The user can select which three reaction coordinates to display, and individual clusters can be shown or hidden. Read the new full tutorial, including examples of results: <a href=\"https://cryosparc.com/docs/tutorials/3d-variability-analysis-2/\">3D Variability Analysis Tutorial: Part Two</a>"
        },
        {
          "tag": "fixed",
          "description": "CPU and GPU memory usage of Homogeneous Refinement is substantially reduced. In tests, it is now possible to refine a 1024 box size on a 11GB consumer-grade NVIDIA GPU (GTX 1080Ti), though this does require ~160GB of CPU RAM. A smaller 256 box size can run on a 4GB GPU and requires only 6GB of CPU RAM"
        },
        {
          "tag": "new",
          "description": "When inspecting particle picks from template or blob pickers, particle pick scores (NCC) and power scores are automatically calibrated with respect to the defocus of each micrograph. This ensures that setting an appropriate threshold on one micrograph will yield good picks on other micrographs with very different defocus. See the tutorial: <a href=\"https://cryosparc.com/docs/tutorials/particle-picking-calibration/\">Particle Picking Calibration</a>"
        },
        {
          "tag": "new",
          "description": "Negative stain and phase-plate datasets are now more easy to process. A single toggle can be set during import and no other parameter changes are necessary in subsequent job types. See the tutorial for details: <a href=\"https://cryosparc.com/docs/tutorials/negative-stain-phase-plate/\">Negative Stain and Phase Plate Data Workflows</a>"
        },
        {
          "tag": "new",
          "description": "The blob picker can now use \"ring\" shaped blobs, which perform well in picking viruses and other spherical particles (eg. apoferritin)"
        },
        {
          "tag": "fixed",
          "description": "The template picker now uses substantially less GPU memory for large micrographs (e.g., K3 super-resolution data)"
        },
        {
          "tag": "new",
          "description": "Relion 3.1 format <code>.star</code> files can now be imported without errors, though optics group data is not currently parsed"
        },
        {
          "tag": "fixed",
          "description": "Local per-particle motion correction of K3 data now works correctly"
        },
        {
          "tag": "new",
          "description": "Manual picker interactive job now has adaptive robust contrast normalization to make seeing particles in imperfect images easier"
        },
        {
          "tag": "new",
          "description": "Manual Picker interactive job now includes a \"Contrast Intensity Override\" slider that allows users to manually select the contrast bounds when viewing a micrograph. The average, patch-based intensity is used by default for the Manual Picker and Exposure Curation jobs"
        },
        {
          "tag": "new",
          "description": "Validation (FSC) Job: Validation of a refinement result (i.e. half-maps) using the FSC is now available as a separate job type, with optional mask input"
        },
        {
          "tag": "update",
          "description": "Fourier-space plots in Homogeneous Refinement display correctly"
        },
        {
          "tag": "new",
          "description": "Multiple updates to Topaz-wrapped jobs in cryoSPARC:<ul><li>→ Added multiprocessing to substantially improve preprocessing times in all Topaz jobs</li><li>→ Added parameter to select number of CPUs in the Topaz Extract job</li><li>→ Topaz jobs now automatically account for negative stain data</li><li>→ Topaz-extracted particles no longer cause 2D classification jobs to occasionally fail due to inconsistent CTF outputs</li></ul>"
        },
        {
          "tag": "update",
          "description": "Passthrough output files now include the project and job numbers for easier referencing (e.g.,<code>P1_J1_passthrough.cs</code>)"
        },
        {
          "tag": "update",
          "description": "Manual Picker job now fails by default if the CTF inputs are not connected. An override switch has been added to allow manual picking without CTF estimates, which is not the recommended workflow"
        },
        {
          "tag": "update",
          "description": "3D Variability Display can now flip the handedness of output volume series"
        },
        {
          "tag": "fixed",
          "description": "Bug that would cause <code>cufftInvalidPlan</code> error during refinement"
        },
        {
          "tag": "fixed",
          "description": "Bug where two Select 2D jobs are jobs connected to each other, the last Select 2D job shows incorrect class average thumbnails"
        },
        {
          "tag": "fixed",
          "description": "Bug where the <code>command_vis</code> would repeatedly try to start but fails, using 100% CPU in the process"
        },
        {
          "tag": "fixed",
          "description": "Bug where <code>mrc</code> volumes were being saved as <code>float64</code> files, which the <code>mrc</code> file format doesn't support, causing the Sharpening Tools job to fail"
        },
        {
          "tag": "fixed",
          "description": "Bug where Heterogenous Refinement and Multi-Class Ab-Initio jobs would fail due to a <code>ValueError</code>"
        }
      ]
    },
    {
      "tag": "v2.12.4",
      "date": "12/04/2019",
      "items": [
        {
          "tag": "new",
          "description": "Exposure Groups Utility Updates: Create exposure groups using regular expressions and separators and test your exposure group creation strategy"
        },
        {
          "tag": "new",
          "description": "3D Variability updates to default parameters: create better results without tweaking"
        },
        {
          "tag": "fixed",
          "description": "Multiprocessing jobs (Patch CTF, Patch motion, Full-frame motion) fail with abnormal termination errors"
        },
        {
          "tag": "fixed",
          "description": "Import micrographs and import movies function incorrectly with exposure groups"
        },
        {
          "tag": "fixed",
          "description": "Imported jobs with inputs cause the tree layout to fail or throw an error"
        },
        {
          "tag": "fixed",
          "description": "3D Variability display 'intermediate' mode outputs are incorrectly scaled"
        },
        {
          "tag": "fixed",
          "description": "3D Variability display 'cluster' mode outputs contain no particles"
        }
      ]
    },
    {
      "tag": "v2.12.0",
      "date": "11/29/2019",
      "items": [
        {
          "tag": "new",
          "description": "New 'cluster' mode in 3D Variability Display allows for automatic hierarchical 3D classification based on variability coordinates: directly visualize and see how many discrete classes are present in a dataset, separate them by clustering, and reconstruct each separately. Then recursively perform 3D Variability to look for sub-conformations or flexibility within each cluster, or refine each cluster separately."
        },
        {
          "tag": "new",
          "description": "New 'intermediates' mode in 3D Variability Display allows for weighted reconstructions of intermediate positions along each variability dimension: create more detailed videos of variability that minimize the effect of density appearing and disappearing during large motions. Also output weighted particle subsets for intermediate positions, for refinement of particular flexible conformations."
        },
        {
          "tag": "new",
          "description": "Default options in 3D Variability improve sensitivity to small variations in the 3D density. Plus support for coloured or white noise models, high-pass filter during optimization, per-particle scale optimization."
        },
        {
          "tag": "fixed",
          "description": "Streaking issue in 3D Variability so that (many) more variability modes can be solved simultaneously."
        },
        {
          "tag": "new",
          "description": "Per-particle defocus refinement implemented on GPU allows CTF refinement in minutes for 100,000's of particles. Implemented as a standalone job and also as an in-line on-the-fly option during Homogeneous Refinement: <a href=\"https://cryosparc.com/docs/tutorials/ctf-refinement/\">learn more</a>"
        },
        {
          "tag": "new",
          "description": "Global CTF Refinement and Local CTF Refinement jobs: CTF aberration support, also GPU implemented, corrects for beam tilt, trefoil, spherical aberration, and tetrafoil. Estimation of the new parameters can be done in a standalone job or as an in-line on-the-fly option during Homogeneous Refinement, yielding ultra-high resolution reconstructions: <a href=\"https://cryosparc.com/docs/tutorials/ctf-refinement/\">learn more</a>"
        },
        {
          "tag": "new",
          "description": "Exposure Group Utilities job allows users to split or combine datasets into multiple exposure groups for higher-order aberration correction: <a href=\"https://cryosparc.com/docs/reference/jobs#exposure-group-utilities/\">learn more</a>"
        },
        {
          "tag": "new",
          "description": "First-pass optimization of GPU and CPU code for Homogeneous Refinement: now up to 5x faster, especially for symmetric particles"
        },
        {
          "tag": "new",
          "description": "New admin page with ability to change roles of existing users and create new users through the UI: <a href=\"https://cryosparc.com/docs/tutorials/user-management/\">User Management Tutorial</a>"
        },
        {
          "tag": "new",
          "description": "Users can request to reset their password through the interface: <a href=\"https://cryosparc.com/docs/tutorials/user-management#reset-password/\">Learn more</a>"
        },
        {
          "tag": "new",
          "description": "New Topaz wrapper jobs for integrating Topaz's particle picking and micrograph denoising functionality: <a href=\"https://cryosparc.com/docs/tutorials/topaz/\">Tutorial: Topaz Integration in cryoSPARC</a>"
        },
        {
          "tag": "new",
          "description": "New Symmetry Expansion job expands particle poses around point-group symmetries, to support local refinement of subunits, as well as 3D variability of symmetric particles."
        },
        {
          "tag": "new",
          "description": "New Job Scheduler and Queuing Interface: Override the cryoSPARC scheduler to queue directly to a specific GPU: <a href=\"https://cryosparc.com/docs/tutorials/queue-to-gpu/\">Learn more</a>"
        },
        {
          "tag": "new",
          "description": "Ability to perform non-interactive threshold selection for particle picking and extraction, and non interactive selection of 2D classes, making it possible to process simple data completely end-to-end without manual intervention"
        },
        {
          "tag": "new",
          "description": "Ability to interactively select all classes above or below a threshold in Select 2D job (right-click a class)"
        },
        {
          "tag": "new",
          "description": "Multiprocessing robustness updates in preprocessing jobs (Patch Motion, Full Frame Motion Correction, Patch CTF Estimation) ensure that if a job fails or is interrupted, completed results are recovered and processing can be resumed."
        },
        {
          "tag": "update",
          "description": "Orientation-precision plots in refinement are now coloured with minimum value zero so that differences in ratios can be easily spotted"
        },
        {
          "tag": "update",
          "description": "Relative ice thickness is now available in Exposure Curation"
        },
        {
          "tag": "update",
          "description": "2D Classification allows for changing the maximum alignment resolution and reconstruction resolution separately if desired"
        },
        {
          "tag": "update",
          "description": "Sharpening job now applied a spherical window by default"
        },
        {
          "tag": "update",
          "description": "Added option to skip header check when importing movies, which allows for faster importing on larger datasets"
        },
        {
          "tag": "update",
          "description": "Importing Movies, Micrographs or Particles will auto-populate the 'exposure group ID' field of the dataset based on the project (each project increments from 0)"
        },
        {
          "tag": "update",
          "description": "Set the environment variable <code>CRYOSPARC_DISABLE_IMPORT_ON_MASTER</code> to allow master-direct jobs (import jobs, curate exposures, select 2D) to be queued on any machine you specify, and not only the master node"
        },
        {
          "tag": "update",
          "description": "If a job is queued to a specific GPU, it will be noted in the Resource Manager"
        },
        {
          "tag": "update",
          "description": "Job Cards now show queue message if placed in queue"
        },
        {
          "tag": "update",
          "description": "Job type is more prominently shown in the sidebar"
        },
        {
          "tag": "fixed",
          "description": "Ab-initio job with symmetry enforced fails with invalid memory access error"
        },
        {
          "tag": "fixed",
          "description": "Certain parameter descriptions in the Job Builder don't show"
        },
        {
          "tag": "fixed",
          "description": "Better logging in Align 3D Job"
        },
        {
          "tag": "fixed",
          "description": "Error in non-uniform refinement when run with CPU option"
        },
        {
          "tag": "fixed",
          "description": "3DFSC job doesn't accept mask inputs"
        },
        {
          "tag": "fixed",
          "description": "New <code>ignore_pose</code> option in import particles to enable import of locations when pose information is missing"
        },
        {
          "tag": "fixed",
          "description": "Deadlock in new job types like 3D var on some newer GPUs"
        },
        {
          "tag": "fixed",
          "description": "Select 2D fails when all classes are selected (i.e., if there are no particles in the templates_excluded output result group)"
        },
        {
          "tag": "fixed",
          "description": "White circles in 2D Class job when circular mask diameter parameter is too close to particle box size"
        },
        {
          "tag": "fixed",
          "description": "Exposure Sets Tool Job doesn't recognize particle inputs"
        },
        {
          "tag": "fixed",
          "description": "The 'more' button in the Job History page doesn't load new rows"
        },
        {
          "tag": "fixed",
          "description": "Copy to clipboard functionality is more reliable on various browsers"
        },
        {
          "tag": "fixed",
          "description": "Back button in File Browser correctly expands path variables"
        },
        {
          "tag": "fixed",
          "description": "Project directory sizes are calculated more accurately"
        },
        {
          "tag": "fixed",
          "description": "When updating a worker's SSD configuration, the SSD option remained disabled even though user supplied a path to the SSD"
        }
      ]
    },
    {
      "tag": "v2.11.0",
      "date": "09/13/2019",
      "items": [
        {
          "tag": "new",
          "description": "Data Management: Export/Import of Projects, Jobs, Output Result Groups and more! <a href=\"https://cryosparc.com/docs/tutorials/data-management/\">Data Management Tutorial</a>"
        },
        {
          "tag": "new",
          "description": "Notifications and Notification Manager"
        },
        {
          "tag": "new",
          "description": "Dashboard Improvements: Helpful links, relevant statistics and more!"
        },
        {
          "tag": "new",
          "description": "Resource Manager Improvements: Intuitive queue, job history table and more!"
        },
        {
          "tag": "new",
          "description": "Particle & Exposure Set Utility Jobs: Split/join/separate/compare/make subsets of particles and exposures"
        },
        {
          "tag": "update",
          "description": "Instance Size Statistics: View the total size of all jobs and projects from the Project Details panel"
        },
        {
          "tag": "update",
          "description": "Refresh project directory sizes from the Project Details panel"
        },
        {
          "tag": "update",
          "description": "Display job type in the Job Details panel"
        },
        {
          "tag": "fixed",
          "description": "Patch-Based Motion Correction: check that K_Z/K_Y/K_X are least 1"
        },
        {
          "tag": "fixed",
          "description": "Patch-Based Motion Correction: log file for Patch-Based Motion Correction shows an incorrect file path"
        },
        {
          "tag": "fixed",
          "description": "Patch-Based Motion Correction: random selection of movies was not random"
        }
      ]
    },
    {
      "tag": "v2.9.0",
      "date": "06/25/2019",
      "items": [
        {
          "tag": "new",
          "description": "3D Variability Analysis job <span class='tag tag--beta'>Beta</span> (requires CUDA 9+)"
        },
        {
          "tag": "update",
          "description": "Support for CUDA 10.1 (recompile cryoSPARC with a newer CUDA Toolkit by using <code>bin/cryosparcw newcuda</code>)"
        },
        {
          "tag": "fixed",
          "description": "Micrographs with Patch CTF Extraction fail when particles are extracted"
        }
      ]
    },
    {
      "tag": "v2.8.3",
      "date": "06/14/2019",
      "items": [
        {
          "tag": "update",
          "description": "Install script for cryoSPARC (new version of anaconda used when installing)"
        },
        {
          "tag": "fixed",
          "description": "Dependency issue caused numpy functions to fail"
        },
        {
          "tag": "fixed",
          "description": "CTFFIND4 wrapper crashes when it tries to output failed micrographs"
        }
      ]
    },
    {
      "tag": "v2.8.0",
      "date": "05/30/2019",
      "items": [
        {
          "tag": "new",
          "description": "Local Patch-Based Motion Correction <span class='tag tag--beta'>Beta</span>"
        },
        {
          "tag": "new",
          "description": "Local Patch-Based CTF Estimation <span class='tag tag--beta'>Beta</span>"
        },
        {
          "tag": "new",
          "description": "Create Templates job"
        },
        {
          "tag": "new",
          "description": "Blob picker job"
        },
        {
          "tag": "new",
          "description": "Support for movies produced by K3 Camera (including fixes for quirks of Leginon/Gatan Latitude)"
        },
        {
          "tag": "new",
          "description": "Heartbeat time is now configurable. Addresses problem where long-running jobs stop communicating with the master process intermittently due to network issues."
        },
        {
          "tag": "new",
          "description": "Network requests between worker and master processes now by default have a 300 second timeout (instead of 120s) and also retry 3 times in case the host is unreachable. This should reduce the occurrence of failed jobs due to network timeout issues or slowdowns of the master process"
        },
        {
          "tag": "new",
          "description": "Ability to mark failed or killed jobs in cryoSPARC as completed allowing it's latest outputs to be used for further processing) - use the 'Mark Job as Complete' button in the Job Details panel"
        },
        {
          "tag": "new",
          "description": "Import <code>.star</code> files now also imports rlnRandomSubset to preserve the gold-standard split and <code>rlnAngle*</code> and <code>rlnOriginX/Y</code> to preserve alignments of particles"
        },
        {
          "tag": "new",
          "description": "Ab-initio reconstruction now has a parameter to limit it to running on only a subset of particles, to more easily deal with very large (million+ particle) datasets. You can use the volumes generated by a 'partial' ab-initio reconstruction as the initial references for a heterogeneous refinement, which will then quickly classify and refine the rest of the dataset"
        },
        {
          "tag": "update",
          "description": "Memory usage for motion correction and picking is now minimized for super-res K3 movies"
        },
        {
          "tag": "update",
          "description": "Box size range in interactive jobs increased to <code>[4, 1024]</code>"
        },
        {
          "tag": "update",
          "description": "MRC Extended header size (NSYMBT) taken into account when reading MRC files"
        },
        {
          "tag": "fixed",
          "description": "Particles extracted from K3 Movies produced NaN values"
        },
        {
          "tag": "fixed",
          "description": "MRC mode 0 is now interpreted as uint8 rather than int8, to match Latitude for K3 movies"
        },
        {
          "tag": "fixed",
          "description": "Power threshold slider in interactive jobs can be more finely controlled"
        },
        {
          "tag": "fixed",
          "description": "NCC and Power Thresholds for picking are limited to 1st and 99th percentile to reduce number of outliers"
        },
        {
          "tag": "fixed",
          "description": "Bug in GPU extraction that would cause job to hang indefinitely after starting"
        },
        {
          "tag": "fixed",
          "description": "Bug in dynamic mask generation in Local Refinement (when Non-uniform Refinement is turned on)"
        },
        {
          "tag": "fixed",
          "description": "Off-by-one bug in fulcrum selection in Local Refinement"
        }
      ]
    },
    {
      "tag": "v2.5.0",
      "date": "01/08/2019",
      "items": [
        {
          "tag": "new",
          "description": "MotionCor2 Wrapper <span class='tag tag--beta'>Beta</span> <a href=\"https://cryosparc.com/docs/reference/jobs/#motioncor2-wrapper\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Ability to force reinstall updates <a href=\"https://cryosparc.com/docs/reference/install#forced-update\">More details</a>"
        },
        {
          "tag": "update",
          "description": "Various GCTF Wrapper bugfixes"
        },
        {
          "tag": "fixed",
          "description": "Certain plots created by GCTF fail to display in Curate Exposures"
        },
        {
          "tag": "fixed",
          "description": "Template Picker fails to allocate GPU memory"
        },
        {
          "tag": "fixed",
          "description": "Extract From Micrographs runs out of GPU memory prematurely"
        }
      ]
    },
    {
      "tag": "v2.4.6",
      "date": "11/30/2018",
      "items": [
        {
          "tag": "new",
          "description": "cryoSPARC now supports CUDA 9 and 10. <strong>Note:</strong> Updating to this version will trigger a reinstallation of cryoSPARC dependencies. These are included in the installation bundle and should not cause any issues but updating could take longer than normal"
        },
        {
          "tag": "fixed",
          "description": "Bug in GCTF wrapper that caused problems when run in per-particle local CTF refinement mode"
        },
        {
          "tag": "fixed",
          "description": "Bug in exposure curation when some micrographs contained no particles"
        }
      ]
    },
    {
      "tag": "v2.4.2",
      "date": "11/08/2018",
      "items": [
        {
          "tag": "new",
          "description": "Wrapper for GCTF <span class='tag tag--beta'>Beta</span> <a href=\"https://cryosparc.com/docs/reference/jobs#ctf-estimation-gctf\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Wrapper for CTFFIND 4.1.10 <a href=\"https://cryosparc.com/docs/reference/jobs#ctf-estimation-ctffind\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Added lowpass filter option under Volume Tools"
        },
        {
          "tag": "new",
          "description": "Simulate Data <span class='tag tag--beta'>Beta</span> job to create particle images from up to two input volumes at random relative and global alignments"
        },
        {
          "tag": "update",
          "description": "Jobs no longer run if required inputs are missing; user is prompted to connect required inputs before queuing is possible"
        },
        {
          "tag": "update",
          "description": "Plotting projections of generated volume in Ab-Initio Reconstruction instead of slices. Refinements still plot slices"
        },
        {
          "tag": "fixed",
          "description": "CTF error 'binary not found'"
        },
        {
          "tag": "fixed",
          "description": "CTFFIND same filename issues"
        },
        {
          "tag": "fixed",
          "description": "<code>CudaFftError</code> on some GPUs in compute-exclusive mode"
        }
      ]
    },
    {
      "tag": "v2.3.2",
      "date": "10/02/2018",
      "items": [
        {
          "tag": "new",
          "description": "Revamped job builder with support for low-level result connections, new outputs tab in job details view. <a href=\"https://cryosparc.com/docs/tutorials/job-builder\">Learn more</a>"
        },
        {
          "tag": "new",
          "description": "Backup &amp; Restore cryoSPARC database through the command line. <a href=\"https://cryosparc.com/docs/reference/install/#backup--restore\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Project directory path now in the project details panel, copy it to your clipboard by clicking on it"
        },
        {
          "tag": "update",
          "description": "Redesigned Select 2D interactive job including support for quick selection (all/none/invert) and sorting classes by number of particles, resolution, and effective classes assigned. <a href=\"https://cryosparc.com/docs/tutorials/t20s/#113-select-2d-classes-interactive\">Learn more</a>"
        },
        {
          "tag": "update",
          "description": "Volume tools can now be used to invert a mask"
        },
        {
          "tag": "update",
          "description": "Added a volume premultiplier to Particle Subtraction to improve scaling of subtracted projections"
        },
        {
          "tag": "update",
          "description": "Added option to not use halfmaps in Particle Subtraction"
        },
        {
          "tag": "update",
          "description": "cryoSPARC username now available in cluster submission scripts. <a href=\"https://cryosparc.com/docs/reference/install/#installation-cluster\">More details</a>"
        },
        {
          "tag": "fixed",
          "description": "After queuing a job in the tree view, you will remain in the tree view when the details view is opened"
        },
        {
          "tag": "fixed",
          "description": "Exposure curation bug fixes (handling NaNs in inputs, can input multiple numerals to edit selections, corrected phase_shift and fit_to values in CTF fit image)"
        },
        {
          "tag": "fixed",
          "description": "Import volumes saves volume to the correct directory"
        },
        {
          "tag": "fixed",
          "description": "Volume tools conversion between map/mask volume types"
        },
        {
          "tag": "fixed",
          "description": "Non-uniform refinement now outputs a mask. Also removed duplicate volume outputs"
        },
        {
          "tag": "fixed",
          "description": "Use per-particle scale factors in particle subtraction"
        },
        {
          "tag": "fixed",
          "description": "CTFFIND file path reference pointed to an incorrect location, causing CTF Estimation jobs to fail"
        }
      ]
    },
    {
      "tag": "v2.2.0",
      "date": "09/17/2018",
      "items": [
        {
          "tag": "new",
          "description": "Local Refinement <span class='tag tag--beta'>Beta</span> and Particle Subtraction <span class='tag tag--beta'>Beta</span> jobs - read a detailed <a href=\"https://cryosparc.com/blog/local-refinement-snRNP-case-study/\">tutorial</a> and <a href=\"https://cryosparc.com/blog/local-refinement/\">blog post</a> with usage instructions"
        },
        {
          "tag": "new",
          "description": "Sharpening job for post processing of refinement outputs. Every user should re-sharpen refinement outputs to ensure maximum map quality"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://discuss.cryosparc.com/t/how-to-clear-the-cache-in-v2/2161/11\">Command line option</a> to turn off SSD caching for an entire project"
        },
        {
          "tag": "update",
          "description": "Non-Uniform Refinement fixes for issue that caused peripheral artefacts on some datasets, speedups"
        },
        {
          "tag": "update",
          "description": "Volume tools can now be used to threshold, pad, and dilate masks"
        },
        {
          "tag": "update",
          "description": "Output separate <code>.mrc</code> files for templates included and templates excluded in select2D, for use with other template-pickers"
        },
        {
          "tag": "update",
          "description": "Added phase shifts to Manually Curate Exposures job"
        },
        {
          "tag": "update",
          "description": "Set default amplitude contrast value to <code>0.07</code> when importing <code>.star</code> files with particles"
        },
        {
          "tag": "update",
          "description": "Added parameter to specify Negative Stain images in Extract from Micrographs and Local Motion Correction to output particles with correct datasign"
        },
        {
          "tag": "fixed",
          "description": "Job scheduler now checks if all necessary inputs are connected before launching a job"
        },
        {
          "tag": "fixed",
          "description": "Bugfixes and performance improvements for Manually Curate Exposures"
        },
        {
          "tag": "fixed",
          "description": "Users can now <a href=\"https://cryosparc.com/docs/reference/general/#delete-a-project\">delete projects</a>"
        },
        {
          "tag": "fixed",
          "description": "Bash is no longer required to be the default shell on worker nodes"
        },
        {
          "tag": "fixed",
          "description": "Creation time displays correctly on projects and workspaces"
        },
        {
          "tag": "fixed",
          "description": "Added option to limit the number of plots made in Inspect Picks"
        },
        {
          "tag": "fixed",
          "description": "Local motion correction can now handle empty movies with no particles"
        },
        {
          "tag": "fixed",
          "description": "Plotting bug in Extract from Micrographs that inverted the printed particles"
        },
        {
          "tag": "fixed",
          "description": "Volume plots are now created and labelled with the correct axis convention"
        },
        {
          "tag": "fixed",
          "description": "2D classification CPU RAM allocation increased to avoid crashes on cluster systems"
        }
      ]
    },
    {
      "tag": "v2.1.0",
      "date": "08/31/2018",
      "items": [
        {
          "tag": "new",
          "description": "Standalone installation method for single-workstation instances - install cryoSPARC with only one line!"
        },
        {
          "tag": "new",
          "description": "It is now possible to delete workspaces with jobs, a prompt will specify which jobs will be deleted or removed from target workspace"
        },
        {
          "tag": "new",
          "description": "Custom job titles appear as label underneath job cards in the tree view for quick referencing"
        },
        {
          "tag": "update",
          "description": "When creating a new project you now just need to specify a container directory in which cryoSPARC can auto-manage project directory names and contents"
        },
        {
          "tag": "update",
          "description": "The dropdown for linking and moving jobs has been updated to allow for scrolling through many workspaces"
        },
        {
          "tag": "update",
          "description": "Various changes to the interface based on user feedback"
        },
        {
          "tag": "fixed",
          "description": "Improved stability for refinement of large particles (1024 pixels+)"
        },
        {
          "tag": "fixed",
          "description": "Users that run standalone instances of cryoSPARC don't require ssh keys to run jobs anymore"
        },
        {
          "tag": "fixed",
          "description": "Bug where deleted workspaces would show in the project view"
        }
      ]
    },
    {
      "tag": "v2.0.27",
      "date": "08/17/2018",
      "items": [
        {
          "tag": "release",
          "description": "Public release of cryoSPARC v2!"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://cryosparc.com/docs\">Documentation</a> and <a href=\"https://cryosparc.com/docs/tutorial\">Tutorial</a>"
        },
        {
          "tag": "new",
          "description": "Resource manager and queue view for active jobs"
        },
        {
          "tag": "new",
          "description": "User isolation: users can now see only their own projects, and choose to select other users to share projects with. Admin users can see all projects. Users can be limited to browse only particular directories"
        },
        {
          "tag": "new",
          "description": "Several UI updates and improvements, filters and searchability for projects and workspaces"
        },
        {
          "tag": "new",
          "description": "New installation and configuration commands"
        },
        {
          "tag": "update",
          "description": "Downsample particles job can now also highpass and lowpass filter particle images"
        },
        {
          "tag": "fixed",
          "description": "Bug fixes to enable SLURM and other cluster schedulers"
        }
      ]
    },
    {
      "tag": "v2.0.23",
      "date": "07/24/2018",
      "items": [
        {
          "tag": "new",
          "description": "Detailed <a href=\"https://github.com/cryoem-uoft/cryosparc2_public/blob/master/INSTALL.md\">Installation Guide</a> that has details of how to configure cryoSPARC v2, as well as documentation for admin and advanced functions"
        },
        {
          "tag": "new",
          "description": "Volume utility for upsampling, cropping, and flipping maps (for example after importing, or to correct the hand of an ab-initio result)"
        },
        {
          "tag": "new",
          "description": "Added settings for worker nodes to configure SSD cache quota and reserve space, on a per-node basis"
        },
        {
          "tag": "new",
          "description": "Import jobs can now import using environment variables like <code>$HOME</code>"
        },
        {
          "tag": "new",
          "description": "All jobs that use SSD caching now have an option to disable caching"
        },
        {
          "tag": "update",
          "description": "Updates to installation and configuration system, making cluster setup easier"
        },
        {
          "tag": "update",
          "description": "2D classification now has options to recenter and window class references during classification, helpful with crowding or when generating templates for picking. Re-centering is on by default"
        },
        {
          "tag": "update",
          "description": "2D classification now defaults to using colored noise, can yield better results in some cases (thanks to Oliver Clarke)"
        },
        {
          "tag": "update",
          "description": "Many parameter descriptions now expanded"
        },
        {
          "tag": "fixed",
          "description": "Bugfix in heterogeneous refinement that would cause over-sharpening"
        },
        {
          "tag": "fixed",
          "description": "Fix bug causing jobs to stall if they require files to be cached that are in use by another job"
        }
      ]
    },
    {
      "tag": "v2.0.20",
      "date": "07/06/2018",
      "items": [
        {
          "tag": "new",
          "description": "Exposure curation interactive job: allows population or individual-level inspection, sorting, and selecting subsets of exposures (movies/micrographs) based on CTF estimates, motion trajectories, particle picks, etc."
        },
        {
          "tag": "new",
          "description": "Multi-GPU motion correction (global and local)"
        },
        {
          "tag": "new",
          "description": "Support for loading <code>mrc.bz2</code> format movies and decompressing on the fly (using <code>pbzip2</code>)"
        },
        {
          "tag": "new",
          "description": "Wrapper for <a href=\"https://github.com/nysbc/Anisotropy\">3DFSC</a>"
        },
        {
          "tag": "new",
          "description": "Changelog on dashboard"
        },
        {
          "tag": "update",
          "description": "Tweaks/updates to non-uniform refinement <span class='tag tag--beta'>Beta</span>"
        },
        {
          "tag": "fixed",
          "description": "Fixes for GPUs in process-exclusive mode"
        },
        {
          "tag": "fixed",
          "description": "Fixes in GPU parallelized particle extraction"
        },
        {
          "tag": "fixed",
          "description": "Various bug fixes"
        }
      ]
    }
  ]
}
