{
  "versions": [
    {
      "tag": "v2.12.4",
      "date": "12-04-2019",
      "items": [
        {
          "tag": "new",
          "description": "Exposure Groups Utility Updates: Create exposure groups using regular expressions and separators and test your exposure group creation strategy"
        },
        {
          "tag": "new",
          "description": "3D Variability updates to default parameters: create better results without tweaking"
        },
        {
          "tag": "fixed",
          "description": "Multiprocessing jobs (Patch CTF, Patch motion, Full-frame motion) fail with abnormal termination errors"
        },
        {
          "tag": "fixed",
          "description": "Import micrographs and import movies function incorrectly with exposure groups"
        },
        {
          "tag": "fixed",
          "description": "Imported jobs with inputs cause the tree layout to fail or throw an error"
        },
        {
          "tag": "fixed",
          "description": "3D Variability display 'intermediate' mode outputs are incorrectly scaled"
        },
        {
          "tag": "fixed",
          "description": "3D Variability display 'cluster' mode outputs contain no particles"
        }
      ]
    },
    {
      "tag": "v2.12.0",
      "date": "11-29-2019",
      "items": [
        {
          "tag": "new",
          "description": "New 'cluster' mode in 3D Variability Display allows for automatic hierarchical 3D classification based on variability coordinates: directly visualize and see how many discrete classes are present in a dataset, separate them by clustering, and reconstruct each separately. Then recursively perform 3D Variability to look for sub-conformations or flexibility within each cluster, or refine each cluster separately."
        },
        {
          "tag": "new",
          "description": "New 'intermediates' mode in 3D Variability Display allows for weighted reconstructions of intermediate positions along each variability dimension: create more detailed videos of variability that minimize the effect of density appearing and disappearing during large motions. Also output weighted particle subsets for intermediate positions, for refinement of particular flexible conformations."
        },
        {
          "tag": "new",
          "description": "Default options in 3D Variability improve sensitivity to small variations in the 3D density. Plus support for coloured or white noise models, high-pass filter during optimization, per-particle scale optimization."
        },
        {
          "tag": "fixed",
          "description": "Streaking issue in 3D Variability so that (many) more variability modes can be solved simultaneously."
        },
        {
          "tag": "new",
          "description": "Per-particle defocus refinement implemented on GPU allows CTF refinement in minutes for 100,000's of particles. Implemented as a standalone job and also as an in-line on-the-fly option during Homogeneous Refinement: <a href=\"https://cryosparc.com/docs/tutorials/ctf-refinement/\">learn more</a>"
        },
        {
          "tag": "new",
          "description": "Global CTF Refinement and Local CTF Refinement jobs: CTF aberration support, also GPU implemented, corrects for beam tilt, trefoil, spherical aberration, and tetrafoil. Estimation of the new parameters can be done in a standalone job or as an in-line on-the-fly option during Homogeneous Refinement, yielding ultra-high resolution reconstructions: <a href=\"https://cryosparc.com/docs/tutorials/ctf-refinement/\">learn more</a>"
        },
        {
          "tag": "new",
          "description": "Exposure Group Utilities job allows users to split or combine datasets into multiple exposure groups for higher-order aberration correction: <a href=\"https://cryosparc.com/docs/reference/jobs#exposure-group-utilities/\">learn more</a>"
        },
        {
          "tag": "new",
          "description": "First-pass optimization of GPU and CPU code for Homogeneous Refinement: now up to 5x faster, especially for symmetric particles"
        },
        {
          "tag": "new",
          "description": "New admin page with ability to change roles of existing users and create new users through the UI: <a href=\"https://cryosparc.com/docs/tutorials/user-management/\">User Management Tutorial</a>"
        },
        {
          "tag": "new",
          "description": "Users can request to reset their password through the interface: <a href=\"https://cryosparc.com/docs/tutorials/user-management#reset-password/\">Learn more</a>"
        },
        {
          "tag": "new",
          "description": "New Topaz wrapper jobs for integrating Topaz's particle picking and micrograph denoising functionality: <a href=\"https://cryosparc.com/docs/tutorials/topaz/\">Tutorial: Topaz Integration in cryoSPARC</a>"
        },
        {
          "tag": "new",
          "description": "New Symmetry Expansion job expands particle poses around point-group symmetries, to support local refinement of subunits, as well as 3D variability of symmetric particles."
        },
        {
          "tag": "new",
          "description": "New Job Scheduler and Queuing Interface: Override the cryoSPARC scheduler to queue directly to a specific GPU: <a href=\"https://cryosparc.com/docs/tutorials/queue-to-gpu/\">Learn more</a>"
        },
        {
          "tag": "new",
          "description": "Ability to perform non-interactive threshold selection for particle picking and extraction, and non interactive selection of 2D classes, making it possible to process simple data completely end-to-end without manual intervention"
        },
        {
          "tag": "new",
          "description": "Ability to interactively select all classes above or below a threshold in Select 2D job (right-click a class)"
        },
        {
          "tag": "new",
          "description": "Multiprocessing robustness updates in preprocessing jobs (Patch Motion, Full Frame Motion Correction, Patch CTF Estimation) ensure that if a job fails or is interrupted, completed results are recovered and processing can be resumed."
        },
        {
          "tag": "update",
          "description": "Orientation-precision plots in refinement are now coloured with minimum value zero so that differences in ratios can be easily spotted"
        },
        {
          "tag": "update",
          "description": "Relative ice thickness is now available in Exposure Curation"
        },
        {
          "tag": "update",
          "description": "2D Classification allows for changing the maximum alignment resolution and reconstruction resolution separately if desired"
        },
        {
          "tag": "update",
          "description": "Sharpening job now applied a spherical window by default"
        },
        {
          "tag": "update",
          "description": "Added option to skip header check when importing movies, which allows for faster importing on larger datasets"
        },
        {
          "tag": "update",
          "description": "Importing Movies, Micrographs or Particles will auto-populate the 'exposure group ID' field of the dataset based on the project (each project increments from 0)"
        },
        {
          "tag": "update",
          "description": "Set the environment variable <code>CRYOSPARC_DISABLE_IMPORT_ON_MASTER</code> to allow master-direct jobs (import jobs, curate exposures, select 2D) to be queued on any machine you specify, and not only the master node"
        },
        {
          "tag": "update",
          "description": "If a job is queued to a specific GPU, it will be noted in the Resource Manager"
        },
        {
          "tag": "update",
          "description": "Job Cards now show queue message if placed in queue"
        },
        {
          "tag": "update",
          "description": "Job type is more prominently shown in the sidebar"
        },
        {
          "tag": "fixed",
          "description": "Ab-initio job with symmetry enforced fails with invalid memory access error"
        },
        {
          "tag": "fixed",
          "description": "Certain parameter descriptions in the Job Builder don't show"
        },
        {
          "tag": "fixed",
          "description": "Better logging in Align 3D Job"
        },
        {
          "tag": "fixed",
          "description": "Error in non-uniform refinement when run with CPU option"
        },
        {
          "tag": "fixed",
          "description": "3DFSC job doesn't accept mask inputs"
        },
        {
          "tag": "fixed",
          "description": "New <code>ignore_pose</code> option in import particles to enable import of locations when pose information is missing"
        },
        {
          "tag": "fixed",
          "description": "Deadlock in new job types like 3D var on some newer GPUs"
        },
        {
          "tag": "fixed",
          "description": "Select 2D fails when all classes are selected (i.e., if there are no particles in the templates_excluded output result group)"
        },
        {
          "tag": "fixed",
          "description": "White circles in 2D Class job when circular mask diameter parameter is too close to particle box size"
        },
        {
          "tag": "fixed",
          "description": "Exposure Sets Tool Job doesn't recognize particle inputs"
        },
        {
          "tag": "fixed",
          "description": "The 'more' button in the Job History page doesn't load new rows"
        },
        {
          "tag": "fixed",
          "description": "Copy to clipboard functionality is more reliable on various browsers"
        },
        {
          "tag": "fixed",
          "description": "Back button in File Browser correctly expands path variables"
        },
        {
          "tag": "fixed",
          "description": "Project directory sizes are calculated more accurately"
        },
        {
          "tag": "fixed",
          "description": "When updating a worker's SSD configuration, the SSD option remained disabled even though user supplied a path to the SSD"
        }
      ]
    },
    {
      "tag": "v2.11.0",
      "date": "09-13-2019",
      "items": [
        {
          "tag": "new",
          "description": "Data Management: Export/Import of Projects, Jobs, Output Result Groups and more! <a href=\"https://cryosparc.com/docs/tutorials/data-management/\">Data Management Tutorial</a>"
        },
        {
          "tag": "new",
          "description": "Notifications and Notification Manager"
        },
        {
          "tag": "new",
          "description": "Dashboard Improvements: Helpful links, relevant statistics and more!"
        },
        {
          "tag": "new",
          "description": "Resource Manager Improvements: Intuitive queue, job history table and more!"
        },
        {
          "tag": "new",
          "description": "Particle & Exposure Set Utility Jobs: Split/join/separate/compare/make subsets of particles and exposures"
        },
        {
          "tag": "update",
          "description": "Instance Size Statistics: View the total size of all jobs and projects from the Project Details panel"
        },
        {
          "tag": "update",
          "description": "Refresh project directory sizes from the Project Details panel"
        },
        {
          "tag": "update",
          "description": "Display job type in the Job Details panel"
        },
        {
          "tag": "fixed",
          "description": "Patch-Based Motion Correction: check that K_Z/K_Y/K_X are least 1"
        },
        {
          "tag": "fixed",
          "description": "Patch-Based Motion Correction: log file for Patch-Based Motion Correction shows an incorrect file path"
        },
        {
          "tag": "fixed",
          "description": "Patch-Based Motion Correction: random selection of movies was not random"
        }
      ]
    },
    {
      "tag": "v2.9.0",
      "date": "06-25-2019",
      "items": [
        {
          "tag": "new",
          "description": "3D Variability Analysis job <span class='tag tag--beta'>Beta</span> (requires CUDA 9+)"
        },
        {
          "tag": "update",
          "description": "Support for CUDA 10.1 (recompile cryoSPARC with a newer CUDA Toolkit by using <code>bin/cryosparcw newcuda</code>)"
        },
        {
          "tag": "fixed",
          "description": "Micrographs with Patch CTF Extraction fail when particles are extracted"
        }
      ]
    },
    {
      "tag": "v2.8.3",
      "date": "06-14-2019",
      "items": [
        {
          "tag": "update",
          "description": "Install script for cryoSPARC (new version of anaconda used when installing)"
        },
        {
          "tag": "fixed",
          "description": "Dependency issue caused numpy functions to fail"
        },
        {
          "tag": "fixed",
          "description": "CTFFIND4 wrapper crashes when it tries to output failed micrographs"
        }
      ]
    },
    {
      "tag": "v2.8.0",
      "date": "05-30-2019",
      "items": [
        {
          "tag": "new",
          "description": "Local Patch-Based Motion Correction <span class='tag tag--beta'>Beta</span>"
        },
        {
          "tag": "new",
          "description": "Local Patch-Based CTF Estimation <span class='tag tag--beta'>Beta</span>"
        },
        {
          "tag": "new",
          "description": "Create Templates job"
        },
        {
          "tag": "new",
          "description": "Blob picker job"
        },
        {
          "tag": "new",
          "description": "Support for movies produced by K3 Camera (including fixes for quirks of Leginon/Gatan Latitude)"
        },
        {
          "tag": "new",
          "description": "Heartbeat time is now configurable. Addresses problem where long-running jobs stop communicating with the master process intermittently due to network issues."
        },
        {
          "tag": "new",
          "description": "Network requests between worker and master processes now by default have a 300 second timeout (instead of 120s) and also retry 3 times in case the host is unreachable. This should reduce the occurrence of failed jobs due to network timeout issues or slowdowns of the master process"
        },
        {
          "tag": "new",
          "description": "Ability to mark failed or killed jobs in cryoSPARC as completed allowing it's latest outputs to be used for further processing) - use the 'Mark Job as Complete' button in the Job Details panel"
        },
        {
          "tag": "new",
          "description": "Import <code>.star</code> files now also imports rlnRandomSubset to preserve the gold-standard split and <code>rlnAngle*</code> and <code>rlnOriginX/Y</code> to preserve alignments of particles"
        },
        {
          "tag": "new",
          "description": "Ab-initio reconstruction now has a parameter to limit it to running on only a subset of particles, to more easily deal with very large (million+ particle) datasets. You can use the volumes generated by a 'partial' ab-initio reconstruction as the initial references for a heterogeneous refinement, which will then quickly classify and refine the rest of the dataset"
        },
        {
          "tag": "update",
          "description": "Memory usage for motion correction and picking is now minimized for super-res K3 movies"
        },
        {
          "tag": "update",
          "description": "Box size range in interactive jobs increased to <code>[4, 1024]</code>"
        },
        {
          "tag": "update",
          "description": "MRC Extended header size (NSYMBT) taken into account when reading MRC files"
        },
        {
          "tag": "fixed",
          "description": "Particles extracted from K3 Movies produced NaN values"
        },
        {
          "tag": "fixed",
          "description": "MRC mode 0 is now interpreted as uint8 rather than int8, to match Latitude for K3 movies"
        },
        {
          "tag": "fixed",
          "description": "Power threshold slider in interactive jobs can be more finely controlled"
        },
        {
          "tag": "fixed",
          "description": "NCC and Power Thresholds for picking are limited to 1st and 99th percentile to reduce number of outliers"
        },
        {
          "tag": "fixed",
          "description": "Bug in GPU extraction that would cause job to hang indefinitely after starting"
        },
        {
          "tag": "fixed",
          "description": "Bug in dynamic mask generation in Local Refinement (when Non-uniform Refinement is turned on)"
        },
        {
          "tag": "fixed",
          "description": "Off-by-one bug in fulcrum selection in Local Refinement"
        }
      ]
    },
    {
      "tag": "v2.5.0",
      "date": "01-08-2019",
      "items": [
        {
          "tag": "new",
          "description": "MotionCor2 Wrapper <span class='tag tag--beta'>Beta</span> <a href=\"https://cryosparc.com/docs/reference/jobs/#motioncor2-wrapper\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Ability to force reinstall updates <a href=\"https://cryosparc.com/docs/reference/install#forced-update\">More details</a>"
        },
        {
          "tag": "update",
          "description": "Various GCTF Wrapper bugfixes"
        },
        {
          "tag": "fixed",
          "description": "Certain plots created by GCTF fail to display in Curate Exposures"
        },
        {
          "tag": "fixed",
          "description": "Template Picker fails to allocate GPU memory"
        },
        {
          "tag": "fixed",
          "description": "Extract From Micrographs runs out of GPU memory prematurely"
        }
      ]
    },
    {
      "tag": "v2.4.6",
      "date": "11-30-2018",
      "items": [
        {
          "tag": "new",
          "description": "cryoSPARC now supports CUDA 9 and 10. <strong>Note:</strong> Updating to this version will trigger a reinstallation of cryoSPARC dependencies. These are included in the installation bundle and should not cause any issues but updating could take longer than normal"
        },
        {
          "tag": "fixed",
          "description": "Bug in GCTF wrapper that caused problems when run in per-particle local CTF refinement mode"
        },
        {
          "tag": "fixed",
          "description": "Bug in exposure curation when some micrographs contained no particles"
        }
      ]
    },
    {
      "tag": "v2.4.2",
      "date": "11-08-2018",
      "items": [
        {
          "tag": "new",
          "description": "Wrapper for GCTF <span class='tag tag--beta'>Beta</span> <a href=\"https://cryosparc.com/docs/reference/jobs#ctf-estimation-gctf\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Wrapper for CTFFIND 4.1.10 <a href=\"https://cryosparc.com/docs/reference/jobs#ctf-estimation-ctffind\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Added lowpass filter option under Volume Tools"
        },
        {
          "tag": "new",
          "description": "Simulate Data <span class='tag tag--beta'>Beta</span> job to create particle images from up to two input volumes at random relative and global alignments"
        },
        {
          "tag": "update",
          "description": "Jobs no longer run if required inputs are missing; user is prompted to connect required inputs before queuing is possible"
        },
        {
          "tag": "update",
          "description": "Plotting projections of generated volume in Ab-Initio Reconstruction instead of slices. Refinements still plot slices"
        },
        {
          "tag": "fixed",
          "description": "CTF error 'binary not found'"
        },
        {
          "tag": "fixed",
          "description": "CTFFIND same filename issues"
        },
        {
          "tag": "fixed",
          "description": "<code>CudaFftError</code> on some GPUs in compute-exclusive mode"
        }
      ]
    },
    {
      "tag": "v2.3.2",
      "date": "10-02-2018",
      "items": [
        {
          "tag": "new",
          "description": "Revamped job builder with support for low-level result connections, new outputs tab in job details view. <a href=\"https://cryosparc.com/docs/tutorials/job-builder\">Learn more</a>"
        },
        {
          "tag": "new",
          "description": "Backup &amp; Restore cryoSPARC database through the command line. <a href=\"https://cryosparc.com/docs/reference/install/#backup--restore\">More details</a>"
        },
        {
          "tag": "new",
          "description": "Project directory path now in the project details panel, copy it to your clipboard by clicking on it"
        },
        {
          "tag": "update",
          "description": "Redesigned Select 2D interactive job including support for quick selection (all/none/invert) and sorting classes by number of particles, resolution, and effective classes assigned. <a href=\"https://cryosparc.com/docs/tutorials/t20s/#113-select-2d-classes-interactive\">Learn more</a>"
        },
        {
          "tag": "update",
          "description": "Volume tools can now be used to invert a mask"
        },
        {
          "tag": "update",
          "description": "Added a volume premultiplier to Particle Subtraction to improve scaling of subtracted projections"
        },
        {
          "tag": "update",
          "description": "Added option to not use halfmaps in Particle Subtraction"
        },
        {
          "tag": "update",
          "description": "cryoSPARC username now available in cluster submission scripts. <a href=\"https://cryosparc.com/docs/reference/install/#installation-cluster\">More details</a>"
        },
        {
          "tag": "fixed",
          "description": "After queuing a job in the tree view, you will remain in the tree view when the details view is opened"
        },
        {
          "tag": "fixed",
          "description": "Exposure curation bug fixes (handling NaNs in inputs, can input multiple numerals to edit selections, corrected phase_shift and fit_to values in CTF fit image)"
        },
        {
          "tag": "fixed",
          "description": "Import volumes saves volume to the correct directory"
        },
        {
          "tag": "fixed",
          "description": "Volume tools conversion between map/mask volume types"
        },
        {
          "tag": "fixed",
          "description": "Non-uniform refinement now outputs a mask. Also removed duplicate volume outputs"
        },
        {
          "tag": "fixed",
          "description": "Use per-particle scale factors in particle subtraction"
        },
        {
          "tag": "fixed",
          "description": "CTFFIND file path reference pointed to an incorrect location, causing CTF Estimation jobs to fail"
        }
      ]
    },
    {
      "tag": "v2.2.0",
      "date": "09-17-2018",
      "items": [
        {
          "tag": "new",
          "description": "Local Refinement <span class='tag tag--beta'>Beta</span> and Particle Subtraction <span class='tag tag--beta'>Beta</span> jobs - read a detailed <a href=\"https://cryosparc.com/blog/local-refinement-snRNP-case-study/\">tutorial</a> and <a href=\"https://cryosparc.com/blog/local-refinement/\">blog post</a> with usage instructions"
        },
        {
          "tag": "new",
          "description": "Sharpening job for post processing of refinement outputs. Every user should re-sharpen refinement outputs to ensure maximum map quality"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://discuss.cryosparc.com/t/how-to-clear-the-cache-in-v2/2161/11\">Command line option</a> to turn off SSD caching for an entire project"
        },
        {
          "tag": "update",
          "description": "Non-Uniform Refinement fixes for issue that caused peripheral artefacts on some datasets, speedups"
        },
        {
          "tag": "update",
          "description": "Volume tools can now be used to threshold, pad, and dilate masks"
        },
        {
          "tag": "update",
          "description": "Output separate <code>.mrc</code> files for templates included and templates excluded in select2D, for use with other template-pickers"
        },
        {
          "tag": "update",
          "description": "Added phase shifts to Manually Curate Exposures job"
        },
        {
          "tag": "update",
          "description": "Set default amplitude contrast value to <code>0.07</code> when importing <code>.star</code> files with particles"
        },
        {
          "tag": "update",
          "description": "Added parameter to specify Negative Stain images in Extract from Micrographs and Local Motion Correction to output particles with correct datasign"
        },
        {
          "tag": "fixed",
          "description": "Job scheduler now checks if all necessary inputs are connected before launching a job"
        },
        {
          "tag": "fixed",
          "description": "Bugfixes and performance improvements for Manually Curate Exposures"
        },
        {
          "tag": "fixed",
          "description": "Users can now <a href=\"https://cryosparc.com/docs/reference/general/#delete-a-project\">delete projects</a>"
        },
        {
          "tag": "fixed",
          "description": "Bash is no longer required to be the default shell on worker nodes"
        },
        {
          "tag": "fixed",
          "description": "Creation time displays correctly on projects and workspaces"
        },
        {
          "tag": "fixed",
          "description": "Added option to limit the number of plots made in Inspect Picks"
        },
        {
          "tag": "fixed",
          "description": "Local motion correction can now handle empty movies with no particles"
        },
        {
          "tag": "fixed",
          "description": "Plotting bug in Extract from Micrographs that inverted the printed particles"
        },
        {
          "tag": "fixed",
          "description": "Volume plots are now created and labelled with the correct axis convention"
        },
        {
          "tag": "fixed",
          "description": "2D classification CPU RAM allocation increased to avoid crashes on cluster systems"
        }
      ]
    },
    {
      "tag": "v2.1.0",
      "date": "08-31-2018",
      "items": [
        {
          "tag": "new",
          "description": "Standalone installation method for single-workstation instances - install cryoSPARC with only one line!"
        },
        {
          "tag": "new",
          "description": "It is now possible to delete workspaces with jobs, a prompt will specify which jobs will be deleted or removed from target workspace"
        },
        {
          "tag": "new",
          "description": "Custom job titles appear as label underneath job cards in the tree view for quick referencing"
        },
        {
          "tag": "update",
          "description": "When creating a new project you now just need to specify a container directory in which cryoSPARC can auto-manage project directory names and contents"
        },
        {
          "tag": "update",
          "description": "The dropdown for linking and moving jobs has been updated to allow for scrolling through many workspaces"
        },
        {
          "tag": "update",
          "description": "Various changes to the interface based on user feedback"
        },
        {
          "tag": "fixed",
          "description": "Improved stability for refinement of large particles (1024 pixels+)"
        },
        {
          "tag": "fixed",
          "description": "Users that run standalone instances of cryoSPARC don't require ssh keys to run jobs anymore"
        },
        {
          "tag": "fixed",
          "description": "Bug where deleted workspaces would show in the project view"
        }
      ]
    },
    {
      "tag": "v2.0.27",
      "date": "08-17-2018",
      "items": [
        {
          "tag": "release",
          "description": "Public release of cryoSPARC v2!"
        },
        {
          "tag": "new",
          "description": "<a href=\"https://cryosparc.com/docs\">Documentation</a> and <a href=\"https://cryosparc.com/docs/tutorial\">Tutorial</a>"
        },
        {
          "tag": "new",
          "description": "Resource manager and queue view for active jobs"
        },
        {
          "tag": "new",
          "description": "User isolation: users can now see only their own projects, and choose to select other users to share projects with. Admin users can see all projects. Users can be limited to browse only particular directories"
        },
        {
          "tag": "new",
          "description": "Several UI updates and improvements, filters and searchability for projects and workspaces"
        },
        {
          "tag": "new",
          "description": "New installation and configuration commands"
        },
        {
          "tag": "update",
          "description": "Downsample particles job can now also highpass and lowpass filter particle images"
        },
        {
          "tag": "fixed",
          "description": "Bug fixes to enable SLURM and other cluster schedulers"
        }
      ]
    },
    {
      "tag": "v2.0.23",
      "date": "07-24-2018",
      "items": [
        {
          "tag": "new",
          "description": "Detailed <a href=\"https://github.com/cryoem-uoft/cryosparc2_public/blob/master/INSTALL.md\">Installation Guide</a> that has details of how to configure cryoSPARC v2, as well as documentation for admin and advanced functions"
        },
        {
          "tag": "new",
          "description": "Volume utility for upsampling, cropping, and flipping maps (for example after importing, or to correct the hand of an ab-initio result)"
        },
        {
          "tag": "new",
          "description": "Added settings for worker nodes to configure SSD cache quota and reserve space, on a per-node basis"
        },
        {
          "tag": "new",
          "description": "Import jobs can now import using environment variables like <code>$HOME</code>"
        },
        {
          "tag": "new",
          "description": "All jobs that use SSD caching now have an option to disable caching"
        },
        {
          "tag": "update",
          "description": "Updates to installation and configuration system, making cluster setup easier"
        },
        {
          "tag": "update",
          "description": "2D classification now has options to recenter and window class references during classification, helpful with crowding or when generating templates for picking. Re-centering is on by default"
        },
        {
          "tag": "update",
          "description": "2D classification now defaults to using colored noise, can yield better results in some cases (thanks to Oliver Clarke)"
        },
        {
          "tag": "update",
          "description": "Many parameter descriptions now expanded"
        },
        {
          "tag": "fixed",
          "description": "Bugfix in heterogeneous refinement that would cause over-sharpening"
        },
        {
          "tag": "fixed",
          "description": "Fix bug causing jobs to stall if they require files to be cached that are in use by another job"
        }
      ]
    },
    {
      "tag": "v2.0.20",
      "date": "07-06-2018",
      "items": [
        {
          "tag": "new",
          "description": "Exposure curation interactive job: allows population or individual-level inspection, sorting, and selecting subsets of exposures (movies/micrographs) based on CTF estimates, motion trajectories, particle picks, etc."
        },
        {
          "tag": "new",
          "description": "Multi-GPU motion correction (global and local)"
        },
        {
          "tag": "new",
          "description": "Support for loading <code>mrc.bz2</code> format movies and decompressing on the fly (using <code>pbzip2</code>)"
        },
        {
          "tag": "new",
          "description": "Wrapper for <a href=\"https://github.com/nysbc/Anisotropy\">3DFSC</a>"
        },
        {
          "tag": "new",
          "description": "Changelog on dashboard"
        },
        {
          "tag": "update",
          "description": "Tweaks/updates to non-uniform refinement <span class='tag tag--beta'>Beta</span>"
        },
        {
          "tag": "fixed",
          "description": "Fixes for GPUs in process-exclusive mode"
        },
        {
          "tag": "fixed",
          "description": "Fixes in GPU parallelized particle extraction"
        },
        {
          "tag": "fixed",
          "description": "Various bug fixes"
        }
      ]
    }
  ]
}
