{
 "items": [
  {
   "category": "Update", 
   "date": "2018-01-12T13:04:40.232633", 
   "description": "<ul>\n<li>Bug fixes for CUDA exclusive mode GPUs</li>\n<li>Bug fixes dependency errors in installer </li>\n</ul>", 
   "title": "Version 0.6.5"
  }, 
  {
   "category": "Update", 
   "date": "2017-12-09T21:00:47.280883", 
   "description": "<ul>\n<li>Fix to SSD cache system to address concurrency bug when launching multiple experiments on the same dataset at the same time.</li>\n<li>Minor bug fixes</li>\n</ul>", 
   "title": "Version 0.6.3"
  }, 
  {
   "category": "Update", 
   "date": "2017-10-30T02:35:31.585625", 
   "description": "<ul>\n<li><strong>NEW</strong> Projects workflow for organizing datasets and experiments! Create new projects, add existing and new datasets to projects, and filter experiments by project or dataset.</li>\n<li>Fix for Unicode error</li>\n<li>Input structures can now be selected from different datasets</li>\n<li>General bug fixes</li>\n</ul>", 
   "title": "Version 0.6.1"
  }, 
  {
   "category": "Update", 
   "date": "2017-10-11T20:59:52.505216", 
   "description": "<ul>\n<li><strong>NEW</strong> Ability to combine particles across datasets to create new datasets, useful for merging particles collected in multiple sessions. Also includes an option to re-stack particles into new particle stacks on disk. <a href=\"https://discuss.cryosparc.com/t/combining-merging-particles-into-new-datasets-plus-re-stacking/1375\">See usage instructions here.</a></li>\n<li>CSV files can now be used to create datasets</li>\n<li>Reset password functionality from the command line on the machine running cryosparc: <code>cryosparc resetpassword &lt;user email&gt; &lt;new password&gt;</code></li>\n<li>Update to pyCUDA version for CUDA 9.0 support</li>\n<li>New option to only select particles from ab-initio and heterogeneous refinement experiments that had their maximum assignment probability in the selected class(es) rather than using a threshold.</li>\n<li>Bug fix for re-centering during ab-initio reconstruction</li>\n<li>Bug fix for disk cleanup whereby experiments were not actually being deleted. Disk cleanup jobs should be re-run now to actually take effect.</li>\n<li>General bug fixes</li>\n</ul>", 
   "title": "Version 0.5.6"
  }, 
  {
   "category": "Update", 
   "date": "2017-09-05T01:30:46.715501", 
   "description": "<ul>\n<li><strong>NEW</strong> Local resolution estimation experiment, with fast GPU implementation</li>\n<li>Bug fixes</li>\n</ul>", 
   "title": "Version 0.5.3"
  }, 
  {
   "category": "Update", 
   "date": "2017-08-23T13:43:24.304914", 
   "description": "<ul>\n<li>Change in 2D classification to support very large numbers of 2D classes</li>\n<li>Insecure installation mode</li>\n<li>Bug fixes</li>\n</ul>", 
   "title": "Version 0.5.2"
  }, 
  {
   "category": "Update", 
   "date": "2017-07-28T13:09:24.195488", 
   "description": "<ul>\n<li><strong>NEW</strong> Fast 2D Classification. Classify 200K particles into 100 classes in 75 minutes!</li>\n<li><strong>NEW</strong> Fast Ab-initio reconstructions (5-6x faster than previous versions) especially with multiple classes. Now, a 6-class ab-initio reconstruciton on 200K particles can be done in 90 minutes!</li>\n<li>New tools for selecting sets and subsets of particles</li>\n<li>New tools for aligning 3D maps</li>\n<li>New experiment type for computing and displaying ResLog-type plots</li>\n<li>New posterior precision plot in refinement experiments indicating missing orientations</li>\n<li>New disk-cleanup tool that can purge old experiments or remove intermediate results (keeping final results and plots) to save disk space</li>\n<li>Support for reading type 6 MRC files (16-bit unsigned integer)</li>\n<li>Amplitude contrast, accelerating voltage, and spherical abberation can now be different in all images in a dataset</li>\n<li>SSD Cache can now have a maximum size quota specified</li>\n<li>Many bug fixes</li>\n</ul>", 
   "title": "Version 0.5.0"
  }, 
  {
   "category": "Update", 
   "date": "2017-05-02T21:46:08.850216", 
   "description": "<ul>\n<li>New generate-mask tool for creating soft masks by thresholding densities</li>\n<li>Fix in caching system to clear space for entire dataset at once</li>\n<li>Bug fixes</li>\n</ul>", 
   "title": "Version 0.4.1"
  }, 
  {
   "category": "Update", 
   "date": "2017-04-22T15:59:54.670104", 
   "description": "<ul>\n<li>Major UI updates</li>\n<li>cryoSPARC interface now scales with wider monitors to display more information at once</li>\n<li>Jobs that are queued can now be seen and managed from the new Queue page</li>\n<li>Updated experiment details page</li>\n<li>Sections of the dashboard are now customizable via user settings</li>\n<li>Number of ab-initio classes can now be overridden from the Ab-Initio section of parameters for an experiment that has already been created</li>\n<li>GPU assignment for a job can now be overridden in the Compute section of parameters</li>\n<li>FSC auto-sharpening now checks for mismatch betwen tight-masked and noise-substituted curves at both FSC=0.143 and FSC=0.5</li>\n<li>Fix for bug in sharpening job type that would cause incorrect results with large b-factors</li>\n<li>Bug fix in FSC calculation when half-maps have DC components with opposite sign</li>\n<li>Bug fix for refinements of low-resolution data</li>\n<li>Updates to plots (legend sizes, axis labels)</li>\n<li>Switch to faster FFT routines for particles</li>\n<li>Updated login page</li>\n<li>Various bug fixes in webapp and installation scripts</li>\n</ul>", 
   "title": "Version 0.4.0"
  }, 
  {
   "category": "Update", 
   "date": "2017-03-22T21:28:20.530600", 
   "description": "<ul>\n<li>Major fixes for GPU memory use in refinement. Refinement can now handle larger box sizes, up to <code>768 ^ 3</code> on a 12GB GPU.</li>\n<li>User in-app feedback form and polls</li>\n<li>Password recovery</li>\n<li>Various bug fixes</li>\n</ul>", 
   "title": "Version 0.3.9"
  }, 
  {
   "category": "Update", 
   "date": "2017-02-23T22:13:00.992062", 
   "description": "<ul>\n<li>Refinement can now accept initial structures that are on the wrong greyscale, and the scale is automatically estimated before refinement.</li>\n<li>UI tweaks: dataset is now selectable from experiments page by clicking on the dataset name, and clearable by clicking the 'x' in the navigation bar. Dataset can also be selected while viewing a dataset's details page.</li>\n<li>Input maps are now resized before aligning symmetry, in case of large box-sizes.</li>\n<li>Support for new-style .par files</li>\n<li>Bug fix for sharpening jobs</li>\n<li>Multiple bug fixes for experimental mode</li>\n<li>Several small bug fixes in webapp and CLI tool</li>\n<li>Experiment results on experiments page now update in real time</li>\n</ul>", 
   "title": "Version 0.3.6"
  }, 
  {
   "category": "Update", 
   "date": "2017-02-16T08:51:36.594953", 
   "description": "<ul>\n<li>Critical bug fix in installation and configuration (#138,#139) that affects new installations only</li>\n<li>Small UI fixes to improve usability</li>\n<li>Bug fix for experimental mode</li>\n</ul>", 
   "title": "Version 0.3.2"
  }, 
  {
   "category": "Update", 
   "date": "2017-02-14T18:03:43.812670", 
   "description": "<ul>\n<li><strong>NEW</strong> Results-UI. See results in real time right on the experiments page, and select both structure and particle set results easily when starting a new experiment based on previous results. </li>\n<li>Reworked box size and maximum resolution parameters for ab-initio.  Users can now specify the starting and final resolution (by default 35A and 12A).  The final map is now output using the box size of the input data. This should not affect most users, however if you are performing 3D classification via ab-initio reconstruction, these parameters could be useful based on the scale of expected structural differences between conformations.</li>\n<li>Bug fix for icosahedral symmetry.</li>\n<li>Refinement now outputs the gold-standard split (A or B) for each particle in the csv meta data file.</li>\n<li>Added <code>cryosparc reinstallpycuda</code> command to re-install PyCUDA in case CUDA has been upgraded.</li>\n<li>Enable uploading of densities and maps directly through the browser (Import)</li>\n<li>Warp-speed refinement is now standard (and old refinement is removed)</li>\n<li>All paths internally are now stored relative to the cryoSPARC bulk directory to enable migration of the database.</li>\n<li>(Ab-initio) reconstruction can now use multiple structures as inputs if you want to perform non-ab-initio reconstruction with starting models that are different. You can also select the same starting models more than once each to make multiple classes initialized from each starting model.</li>\n<li>Admin users can now deactivate a cryoSPARC instance through the Admin panel to be able to migrate the license to another instance.</li>\n<li>Many bug fixes</li>\n</ul>", 
   "title": "Version 0.3.0"
  }, 
  {
   "category": "Update", 
   "date": "2017-01-16T18:36:30.925214", 
   "description": "<ul>\n<li>Descriptions and information has been added to task selection page</li>\n<li>Switched to new deployment system</li>\n<li>Switched to new license/activation and registration system to support wider academic release</li>\n<li>Upgrade NodeJS version</li>\n</ul>", 
   "title": "Version 0.2.47"
  }, 
  {
   "category": "Update", 
   "date": "2017-01-09T20:15:34.554071", 
   "description": "<ul>\n<li>Fixes and changes to update system and user information</li>\n</ul>", 
   "title": "Version 0.2.42"
  }, 
  {
   "category": "Update", 
   "date": "2017-01-07T20:31:30.023520", 
   "description": "<ul>\n<li>Plots of viewing direction distributions are now generated automatically to assist in diagnosing issues with preferential orientations.</li>\n<li>Outputs from ab-initio reconstruction are now axis-aligned and upsampled to a minimum box size of 128^3.</li>\n</ul>", 
   "title": "Version 0.2.39"
  }, 
  {
   "category": "Update", 
   "date": "2016-12-25T20:50:01.291101", 
   "description": "<ul>\n<li>Phase plate datasets are now supported in warp speed refinement.</li>\n<li>FSC and noise plots look a little better when low resolutions are ticked.</li>\n<li>During ab initio, each iteration now prints out the current resolution in Angstroms and the progress through the dataset in terms of epochs.</li>\n<li>During ab initio plotting is now done every 25 iterations (previously every 20) in order to synchronize with structure saving which is done every 50 iterations.</li>\n<li>Limit the number of CPU threads used in a single job by numpy and FFT.</li>\n<li>When selecting particles from multiple input classes, sum their combined probabilities in case multiple classes in case multiple classes were similar and particles were evenly split.</li>\n<li>Fixes to Guinier plots and bfactor estimation.  It should now no longer give spurious results when the resolution is around 8A.</li>\n<li>Fixed bug which caused the contrast of the map to be inverted during refinement when the box size was not a multiple of 4.</li>\n<li>Random seed used for randomizing the dataset can now be recorded and set.  Default behaviour is unchanged where two runs will produce slightly different results each time but now this can be controlled if desired.</li>\n<li>When checking the cache for a file, verify it's modification time, size and partial contents.  Currently we check the first and last 1MB of the file which should be relatively fast.</li>\n<li>Updated dataset and experiment parameter descriptions. (Courtesy JLR.)</li>\n</ul>", 
   "title": "Version 0.2.38"
  }, 
  {
   "category": "Update", 
   "date": "2016-12-17T03:38:26.166191", 
   "description": "<ul>\n<li>Phase plate data is now directly supported (using rlnPhaseShift from star files) and initial testing is successful</li>\n<li>FSC curves are now displayed both before and after auto-mask-tightening in the last iteration of refinement</li>\n<li>Plots are in color by default and gray has been added as an option in the Compute section of experiment settings</li>\n<li>New welcome + setup pages for first time install</li>\n<li>New EULA acceptance pages (Note: EULA has not changed)</li>\n<li>Select dataset from cards rather than dropdown in experiment creation</li>\n<li>Select task from cards rather than dropdown in experiment creation</li>\n<li>User settings now includes a toggle for whether or not to open experiments in a new tab</li>\n<li>UI bug fixes</li>\n</ul>", 
   "title": "Version 0.2.36"
  }, 
  {
   "category": "Update", 
   "date": "2016-12-15T03:29:22.763551", 
   "description": "<ul>\n<li>Important bug fixes</li>\n<li>Result selector only shows current user's experiments</li>\n</ul>", 
   "title": "Version 0.2.32"
  }, 
  {
   "category": "Update", 
   "date": "2016-12-08T21:38:49.336512", 
   "description": "<ul>\n<li>Warp-speed refinement now supports symmetry and should yield the same results as standard refinement, faster. You may want to re-process symmetric structures to see how it works. </li>\n<li>Particles can each have their own amplitude contrast now when using a star file input. This allows for basic phase-plate support.</li>\n<li>Dynamic masking now uses a filtered version of the struture to avoid spurious blips in the masks.</li>\n<li>Structure slice plots are now grey</li>\n<li>Clicking clear on a completed experiment now shows a confirmation dialog</li>\n<li>Fixed multithreading bugs in FSC computation, made faster</li>\n<li>Fixed bug in update that would cause older installations to fail</li>\n<li>Fixed bug in loading multiple star files </li>\n<li>Allow specifying the cache directory during the installation process</li>\n<li>Don't require cryoSPARC to be installed on the SSD any more</li>\n<li>Don't auto-add all mount points as bulk directories</li>\n<li>Installer no longer needs to write to bashrc </li>\n</ul>", 
   "title": "Version 0.2.31"
  }, 
  {
   "category": "Update", 
   "date": "2016-11-20T04:19:52.854524", 
   "description": "<ul>\n<li>Users can now toggle viewing only their own experiments and everyone's experiments. Click on the 'person' icon under the New Experiment button on the experiments page.</li>\n<li>Dynamic masking in refinement is now looser by default (rolloff from 6A -&gt; 14A away from structure). There is also a new option to use the absolute value of the structure to generate the mask, so that strong negative regions will be included in the mask.</li>\n<li>SSD Caching is now optional, find the option in the Compute section of experiment parameters. Enabled by default.</li>\n<li>STAR file input support has been greatly improved. Now star files with multiple headers, multiple data blocks, comments, etc are all supported. Error messages have been improved for when some required columns are missing in star file inputs. </li>\n<li>When creating a dataset, specifying the image data location is now optional, and the default behaviour is to use the directory where the input star file is located. This means you can just point straight to a star file inside a RELION project directory and cryosparc will find the mrc files.</li>\n<li>The file browser has been improved: errors for missing directories do not cause crashes, symlinks are indicated, unmounting does not cause crashes, hidden files are hidden.</li>\n<li>Dynamic generated masks in refinement are now output in mrc files.</li>\n<li>Fixed bug where supplying pixel size or other microscope parameters would not override the values in the input star file.</li>\n<li>Fixed bug where cryosparc start or installer can fail with race condition while trying to set up mongodb</li>\n<li>Fixed bug where queued or running jobs could be accidentally deleted by user and lost</li>\n<li>Fixed bug where all plot files were named the same thing when downloaded</li>\n</ul>", 
   "title": "Version 0.2.26"
  }, 
  {
   "category": "Update", 
   "date": "2016-11-12T16:47:28.563714", 
   "description": "<ul>\n<li>Added <code>cryosparc tuning</code> command to tune RAM and GPU settings for maximum performance. This tuning is quite critical to obtaining good performace. Requires sudo.</li>\n</ul>", 
   "title": "Version 0.2.25"
  }, 
  {
   "category": "Update", 
   "date": "2016-11-12T15:58:10.860451", 
   "description": "<ul>\n<li>Bug fix for reading large (500K particles+) csv meta-data files.</li>\n<li>Installer works without curl (uses wget instead)</li>\n<li>Allow clearing cache and changing reserve space when cryosparc is stopped. Cache reserve is now 10GB by default. Make sure cryosparc checks for free disk space (5GB) before starting.</li>\n<li>MongoDB and NodeJS are not auto-restarted when they crash, to protect from possible db corruption.</li>\n<li>Installer now sets all package versions exactly to avoid conflicts.</li>\n<li>Removed <code>cryosparc restart</code> command because it didn't work correctly. Use <code>stop</code> and <code>start</code> for now.</li>\n<li>Fixed bug when there are spaces in the cryosparc installation directory.</li>\n<li>Added changelog to dashboard.</li>\n</ul>", 
   "title": "Version 0.2.24"
  }
 ]
}